{
    "acpl-lscache": {
        "admin": {
            "cache_enabled_label": "Увімкнути LSCache",
            "cache_enabled_help": "Перевірте <a>Інформаційну сторінку</a> про те, як перевірити кеш. ПРИМІТКА: При відключенні кешу всі кешовані записи для цього сайту будуть видалені.",
            "public_cache_ttl_label": "За налаштуванням публічний кеш TTL",
            "public_cache_ttl_help": "Визначте, як довго, в секундах, повинні кешуватися загальнодоступні сторінки. Значення за замовчуванням - 604800 секунд (один тиждень).",
            "clearing_cache_listener_label": "Очищення LSCache після очищення кешу Flarum",
            "serve_stale_label": "Подавати несвіжий контент",
            "serve_stale_help": "Якщо увімкнено, відвідувачам буде показано застарілу версію кешованої сторінки, доки не буде створено свіжу копію кешу. Це зменшує навантаження на сервер. Якщо вимкнено, сторінка буде динамічно генеруватися під час оновлення кешу, що може збільшити час очікування. За задумом, ця опція може показувати застарілий контент. Будь ласка, не вмикайте її, якщо ви вважаєте це неприйнятним.",
            "purge_on_discussion_update_label": "Очистити URL-адреси або кеш-теги в оновленні обговорень",
            "purge_on_discussion_update_help": "Введіть URL-адресу або кеш-теги, які ви хочете очистити при оновленні допису, по одному в рядку. URL має починатися з <code>/</code>, наприклад, <code>/rankings</code>, а тег кешу має починатися з <code>tag=</code>, наприклад, <code>tag=rankings</code>. Для декількох маршрутів, додавання правила в .htaccess з регулярним виразом, який тегує маршрути, і введення тільки цього тега тут буде швидшим. <a>Дізнатися більше</a>. За налаштуванням кеш для головної сторінки та оновлених обговорень очищується.",
            "cache_exclude_label": "Виключення шляхів з кешування",
            "cache_exclude_help": "Шляхи, що містять ці рядки, не будуть кешуватися. Для <code>/mypath/mypage?aa=bb</code> можна використовувати <code>mypage?aa=</code>. Для збігу з початком додайте <code>^</code> на початку. Для точного збігу додайте <code>$</code> в кінці URL-адреси. По одному разу в рядку.",
            "drop_qs_label": "Випадання рядків запиту",
            "drop_qs_help": "Використовуйте цю функцію, щоб вилучити певні рядки запитів, такі як <code>fbclid</code> або <code>utm*</code>, при кешуванні. Це запобігає надлишковому кешуванню сторінок зі «сміттєвими» рядками запитів, такими як UTM-коди, які використовуються для відстеження, але не впливають на вміст сторінки. Для цього потрібна версія LSWS v5.2.3 або новіша. Перелічіть рядки запитів, які потрібно вилучити, по одному в рядку. <a>Дізнайтеся більше про вилучення рядків запитів</a>.<br></br>\n⚠️ Цей параметр змінить файл .htaccess.\n",
            "purge_all": "Очистити весь LSCache",
            "purge_all_success": "Веб-серверу LiteSpeed надіслано повідомлення про очищення всіх записів LSCache"
        }
    }
}
