{
    "askvortsov-auto-moderator": {
        "admin": {
            "action_drivers": {
                "activate_email": "Активувати електронну пошту",
                "add_to_group": "Додати до групи",
                "remove_from_group": "Видалити з групи",
                "suspend": "Призупинено",
                "unsuspend": "Відсторонено"
            },
            "metric_drivers": {
                "discussions_entered": "Обговорення розпочато",
                "discussions_participated": "Участь у дискусіях",
                "discussions_started": "Розпочато обговорення",
                "posts_made": "Зроблені дописи",
                "likes_given": "Додані вподобання",
                "likes_received": "Отримано вподобань",
                "best_answers": "Найкращі відповіді",
                "moderator_strikes": "Попередження модератора про страйки"
            },
            "requirement_drivers": {
                "email_confirmed": "Електронна пошта підтверджена",
                "in_group": "В групі",
                "suspended": "Призупинено",
                "email_matches_regex": "Відповідність адреси електронної пошти за допомогою Regex"
            },
            "in_group_settings": {
                "regex": "Regex для валідних email-адрес (без скісних рисок)"
            },
            "group_selector": {
                "placeholder": "Обрати групу"
            },
            "suspend_selector": {
                "days": "Дні для призупинення на",
                "indefinitely": "Призупинити на невизначений термін?"
            },
            "criterion_status": {
                "heading": "Перевірка статусу",
                "invalid": "Критерій на цю мить недійсний. Будь ласка, перевірте драйвери нижче на наявність помилок.",
                "no_actions": "Для цього критерію не визначено жодних дій. Нічого не відбудеться, коли користувачі отримають або втратять цей критерій.",
                "no_metrics_or_reqs": "Для цього критерію не визначено жодних показників чи вимог. Це означає, що ВСІ користувачі будуть відповідати цьому критерію.",
                "valid": "Цей критерій є коректним!",
                "action_validation_errors": "Виникли наступні помилки перевірки драйверів дій:",
                "requirement_validation_errors": "Були виявлені наступні помилки перевірки драйверів вимог:"
            },
            "criterion_page": {
                "driver_missing_ext": "Цей драйвер залежить від розширень, які не ввімкнено.",
                "back": "Повернутися до списку критеріїв",
                "name_label": "Ім'я",
                "icon_label": "Значок",
                "description_label": "Опис",
                "new_criterion": "Створити критерій",
                "negated": "Негативно?",
                "loading": "=> core.ref.loading",
                "delete_button": "=> core.ref.delete",
                "metrics_and_requirements_label": "Показники та вимоги",
                "metrics_and_requirements_help": "Вони визначають, чи відповідають користувачі цьому критерію. Метрики являють собою діапазони значень, вимоги — булеві умови.",
                "metrics_heading": "Показники",
                "requirements_heading": "Вимоги",
                "add_metric": "Додати показник",
                "actions_label": "Дії",
                "actions_help": "Дії на виграш виконуються, коли користувач відповідає новому критерію. Дії щодо втрати виконуються, коли користувач перестає відповідати критерію.",
                "actions_on_gain_heading": "Дії на виграш",
                "actions_on_loss_heading": "Дії щодо втрати",
                "add_action": "Додати дію"
            },
            "undefined_driver_item": {
                "text": "ПОМИЛКА! The driver <strong>{driverName}</strong> не визначено. Швидше за все, додано розширення, яке наразі не встановлено. Вам потрібно буде повторно ввімкнути розширення або видалити цей драйвер, щоб критерій знову став дійсним."
            },
            "automoderator_page": {
                "criterion_invalid": "Критерій наразі не діє. Будь ласка, перевірте його налаштування для отримання додаткової інформації",
                "list_heading": "Критерій",
                "create_criterion_button": "Створити новий критерій"
            },
            "automoderator_instructions": {
                "header": "Інструкція по розширенню",
                "text": "<li>Tl;dr: коли користувач відповідає критеріям X, виконайте Y. Якщо користувач більше не відповідає критеріям X, виконайте Z.</li>\n<li><strong>Критерії:</strong> критерії є основою цього розширення. Це довільні набори показників і вимог. Коли користувач відповідає критерію, виконуватимуться будь-які дії «при посиленні» для цього критерію. Коли користувач втрачає критерій, буде виконано будь-які дії «у разі втрати» для критерію.</li>\n<ul>\n  <li><strong>Метрика:</strong> числова умова. Наприклад, кількість публікацій або кількість отриманих вподобайок. Для критерію може знадобитися діапазон/мінімум/максимум показників.</li>\n  <li><strong>Вимога:</strong> абстрактна логічна умова. Наприклад, відсутність призупинення або наявність електронної пошти, яка відповідає певному регулярному виразу.</li>\n</ul>\n<li><strong>Дії:</strong> те, що відбувається автоматично, коли критерій виконується або втрачається. Це може включати будь-що: від додавання/видалення групи до надсилання електронного листа та призупинення користувача.</li>\n<li><strong>Тригер:</strong> набір подій, які викликають переоцінку груп критеріїв користувача. Це частина визначень метрик і вимог. Усі критерії будуть оцінені під час входу: це «універсальний тригер».</li>\n<li>Дії «за втрати» завжди виконуватимуться перед діями «за отримання». Таким чином, дії виконуватимуться, доки користувач відповідає принаймні одному з критеріїв, за якими ця дія виконується на користь.</li>\n<li>Пам’ятайте, що дії виконуються лише «за втрати» та «за отримання». Редагування вручну, поки користувач відповідає вимогам критерію, не ініціює повторне застосування дій критерію «при посиленні».</li>\n<li>Якщо ви видалите критерій, дії «у разі втрати» НЕ виконуватимуться для користувачів, які зараз відповідають критерію.</li>\n<li>Якщо ви використовуєте критерії для керування групами, ми рекомендуємо підтримувати окремий набір груп, якими керуватимете за критеріями. Ви не зможете додавати/видаляти користувачів до/з цих груп вручну.</li>\n"
            }
        },
        "lib": {
            "group_id": "ID групи",
            "managed_groups": {
                "header": "Керувати групами:",
                "group_item": "<badge></badge> {groupName}",
                "groups_not_editable": "Групи, керовані за критеріями автомодератора, не можуть бути додані/видалені з користувачів вручну, щоб запобігти невідповідностям."
            }
        }
    }
}
