{
    "askvortsov-pwa": {
        "admin": {
            "nav": {
                "pwa_button": "Прогресивний веб додаток (PWA)",
                "pwa_text": "Налаштуйте Flarum, щоб він працював як прогресивний веб-додаток, який можна встановити на мобільні пристрої."
            },
            "pwa": {
                "about": {
                    "description_label": "Опис",
                    "description_text": "Ви можете налаштувати опис на сторінці «Налаштування» в панелі адміністратора.",
                    "long_name_label": "Довга назва",
                    "long_name_text": "Назва веб-додатку, що відображається користувачу.",
                    "heading": "Про нас",
                    "short_name_label": "Коротка назва",
                    "short_name_text": "Назва програми, що відображається користувачеві, якщо не вистачає місця для довгої назви."
                },
                "colors": {
                    "heading": "Кольори",
                    "background_color_label": "Колір фону",
                    "background_color_text": "Цей колір використовується як колір-заповнювач для заставки, яка відображається під час завантаження PWA. Він не використовується під час завантаження програми.",
                    "theme_color_label": "Колір теми",
                    "theme_color_text": "Цей колір іноді використовується пристроями при відображенні вашого додатку, наприклад, на перемикачі завдань Android, як колір, що оточує сайт."
                },
                "maintenance": {
                    "heading": "Технічне обслуговування",
                    "debug_label": "Режим налагодження?",
                    "debug_text": "Інформація про сповіщення буде записуватися до журналу `storage/logs`. Зазвичай її слід вимкнути, щоб уникнути зайвого заповнення журналів.",
                    "reset_vapid_text": "Це призведе до регенерації ключів VAPID та видалення всіх наявних підписок з використанням поточних ключів VAPID.",
                    "reset_vapid_confirm": "Скидання VAPID-ключів призведе до видалення всіх підписок з використанням наявних ключів, тому користувачі не отримають жодних сповіщень до наступного відвідування вашого сайту. Це слід робити тільки при першому налаштуванні push-сповіщень, або якщо push-сповіщення взагалі не працюють і вище є попередження про відсутність VAPID-ключів.",
                    "reset_vapid_success": "Успішно скинуто VAPID-ключі. Скинуто {count} підписок. Перезавантажте сторінку, щоб побачити оновлений звіт про перевірку стану."
                },
                "other": {
                    "heading": "Інше",
                    "force_portrait_text": "Як портретна орієнтаці?"
                },
                "heading": "Налаштування PWA",
                "text": "Налаштуйте свій сайт Flarum для роботи як прогресивний веб-додаток! Зверніть увагу, що це не означає автоматичного розміщення вашого сайту в магазині додатків. Натомість це означає, що користувачі матимуть можливість «Додати на домашній екран» для вашого сайту. Ми надаємо деякі перевірки статусу, однак, найкращий спосіб перевірити це — спробувати встановити його (пошукайте в Google інструкції про те, як встановити прогресивні веб-додатки). Також, будь ласка, майте на увазі, що спливаючі вікна «встановити цей PWA» контролюються браузерами й не можуть бути викликані розробниками/адміністраторами/програмами. Рекомендуємо включити інструкцію по встановленню PWA в документацію вашого сайту.",
                "status_check_heading": "Перевірити статус",
                "logo_heading": "Логотипи та значки",
                "logo_text": "Ви повинні завантажити принаймні один логотип, щоб ваш прогресивний веб-додаток можна було встановити. Зверніть увагу, що всі логотипи повинні бути квадратними; якщо це не так, вони будуть змінені та, можливо, розтягнуті.\n\nНижче наведено кілька варіантів розмірів. Рекомендуємо спробувати завантажити логотип на якомога більшу кількість сайтів: це підтримує більшу кількість пристроїв.\n\nЗверніть увагу, що ви можете завантажити 1 великий логотип до входів для менших логотипів. Наприклад, ви можете завантажити логотип розміром 1000x1000 пікселів у ВСІ наведені нижче файли. Однак, якщо ви спробуєте завантажити логотип розміром 50x50 пікселів до входу 512x512, він буде сильно розтягнутий.\n",
                "logo_size_text": "Завантажте логотип, який буде масштабовано до {size} пікселів на {size} пікселів.",
                "submit_button": "Зберегти налаштування",
                "refreshed_message": "Конфігурацію PWA успішно оновлено."
            },
            "status": {
                "config_no_https": "Адреса у вашому файлі config.php не використовує HTTPS. HTTPS необхідний для роботи Progressive Web Apps.",
                "possible_https_disabled": "Можливо, ваш сайт не працює за протоколом HTTPS. Очищення кешу (сторінка панелі адміністратора => кнопка «Інструменти») може допомогти. Якщо це так, ігноруйте це. Якщо ні, майте на увазі, що HTTPS необхідний для роботи Progressive Web Apps.",
                "no_logo": "Для роботи додатку необхідно завантажити принаймні один логотип розміром не менше 196 пікселів.",
                "no_name": "Для роботи додатку необхідно вказати повне ім'я.",
                "no_vapid_keys": "VAPID-ключі не знайдено. Вони необхідні для надсилання push-сповіщень. Скинути VAPID-ключі можна нижче.",
                "key_gen_failed": "Не вдалося згенерувати ключі для push-повідомлень. Повне повідомлення про помилку виглядало наступним чином: {error}",
                "suggest_gmp": "Схоже, на вашому сервері не ввімкнено розширення gmp PHP. Воно не є обов'язковим, але може підвищити продуктивність і рекомендується. Однак деякі віртуальні хости можуть його не підтримувати.",
                "success": "Потенційних проблем не виявлено!"
            }
        },
        "forum": {
            "alerts": {
                "optin": "Ви увімкнули push-сповіщення, але не налаштували цей пристрій.",
                "optin_button": "Налаштування"
            },
            "discussion_controls": {
                "share_button": "Поділитися"
            },
            "post_controls": {
                "share_button": "Поділитися",
                "share_api": {
                    "title": "{username} відповів у «{title}»"
                }
            },
            "user_controls": {
                "share_button": "Поділитися"
            },
            "settings": {
                "push_header": "Натиснути",
                "pwa_notifications": {
                    "access_default": "Через обмеження браузера ви повинні погодитися на отримання push-повідомлень на цьому пристрої.",
                    "access_default_button": "Підписатися",
                    "access_denied": "Щоб отримувати push-повідомлення на цьому пристрої, необхідно налаштувати параметри браузера.",
                    "access_denied_button": "Дізнатися більше",
                    "no_browser_support": "Цей браузер не підтримує push-повідомлення для прогресивних веб-додатків.",
                    "no_browser_support_button": "Дізнатися більше"
                }
            }
        },
        "views": {
            "offline": {
                "header": "Помилка підключення до мережі",
                "text": "Цей додаток вимагає підключення до мережі; його не можна використовувати в автономному режимі. Будь ласка, перевірте своє з'єднання."
            }
        }
    }
}
