{
    "fof-stopforumspam": {
        "admin": {
            "settings": {
                "introduction": "Перевірка реєстрації нових користувачів у базі даних <a>StopForumSpam</a>. Якщо досягнуто порогових значень <code>надійності</code> або <code>частоти</code>, користувач не зможе завершити реєстрацію на вашому форумі.\n\nТакож підтримується реєстрація SSO через <code>fof/oauth</code> та <code>fof/passport</code>. Інші постачальники єдиного входу повинні працювати, але вони не перевірені.\n",
                "username_label": "Перевірка імені користувача на спам",
                "ip_label": "Перевірка IP-адреси на спам",
                "email_label": "Перевірка електронної пошти на спам",
                "frequency_label": "Порогове значення",
                "frequency_help": "Кількість повідомлень про спам між усіма увімкненими перевірками, які призведуть до спрацьовування спам-фільтра.\nНаприклад: Якщо електронна адреса має 1 збіг, а ip — 2, то разом буде 3 збіги. Якщо поріг встановлений на 3 або менше, ми не допустимо реєстрацію.\n",
                "api_key_label": "API Key",
                "api_key_text": "У вас увімкнено fof/spamblock, тепер у вас є можливість повідомляти про спамерів до StopForumSpam, щоб захистити більшу частину спільноти форуму від спаму.",
                "api_key_instructions_text": "<register>Реєструйтеся на StopForumSpam</register>. Потім вам потрібно буде <key>отримати ключ API</key>.",
                "regional_endpoint_label": "Географічний доступ",
                "regional_endpoint_help": "За налаштуванням ми спрямовуємо пошук до найближчого регіонального сервера, щоб забезпечити найшвидшу відповідь. Якщо ви бажаєте обмежити трафік певним регіоном, наприклад, для дотримання правил конфіденційності компанії або країни, ви можете примусово встановити з'єднання з певним регіоном.",
                "region_closest_label": "Найближчий",
                "region_europe_label": "Європа",
                "region_us_label": "США",
                "confidence_label": "Довіреність",
                "confidence_help": "Оцінка впевненості є досить хорошим показником того, що в досліджуваній області може виникнути небажана активність. Встановіть рівень довіри у відсотках. Якщо поле дорівнює або перевищує цей показник, реєстрація буде заблокована, незалежно від результатів тесту «частоти», наведеного вище.",
                "email_hash_label": "Використовуйте хешовану адресу електронної пошти",
                "email_hash_help": "Передайте MD5 хеш адреси електронної пошти, якщо ви не бажаєте передавати саму адресу електронної пошти. Цей метод дозволяє обійти всі перевірки чорних списків, нормалізації та обходу завуальованості."
            }
        },
        "forum": {
            "message": {
                "spam": "Ваша інформація була позначена як спам."
            }
        },
        "api": {
            "error": {
                "unknown": "Не вдалося надіслати користувача до StopForumSpam."
            }
        }
    }
}
