{
    "ianm-gravatar": {
        "admin": {
            "settings": {
                "proxy": {
                    "title": "Проксі граватари",
                    "helptext": "За налаштуванням URL-адреси граватарів отримуються безпосередньо з gravatar.com. Це дозволяє обслуговувати всі запити на граватар безпосередньо самим форумом."
                },
                "replace-flarum-custom": {
                    "title": "Заміна користувацьких аватарок, завантажених на форум",
                    "helptext": "Замінити користувацькі аватарки, вже завантажені на форум, на Gravatar"
                },
                "defaults": {
                    "title": "За налаштуванням",
                    "helptext": "Що станеться, якщо адреса електронної пошти не має відповідного зображення для Gravatar? Gravatar має ряд вбудованих опцій, які ви можете використовувати за налаштуванням. Більшість з них беруть хеш запитуваної адреси електронної пошти і використовують його для створення тематичного зображення, унікального для цієї адреси.",
                    "mp_label": "mp: (mystery-person) простий силуетний контур людини в мультяшному стилі (не змінюється залежно від хешу електронної пошти)",
                    "identicon_label": "identicon: геометричний візерунок на основі хешу електронної пошти",
                    "monsterid_label": "monsterid: згенерований \"монстр\" з різними кольорами, обличчями тощо",
                    "wavatar_label": "wavatar: згенеровані обличчя з різними рисами та фоном",
                    "retro_label": "retro: приголомшливі згенеровані 8-розрядні піксельні обличчя в аркадному стилі",
                    "robohash_label": "robohash: згенерований робот з різними кольорами, обличчями тощо"
                },
                "rating": {
                    "title": "Рейтинг",
                    "helptext": "Gravatar дозволяє користувачам самостійно оцінювати свої зображення, щоб вказати, чи підходить зображення для певної аудиторії. За налаштуванням відображаються лише зображення з оцінкою \"G\", якщо ви не вкажете, що бажаєте бачити зображення з вищою оцінкою. Ви можете вказати одну з наступних оцінок, щоб отримати зображення до цієї оцінки включно.",
                    "g_label": "g: підходить для показу на всіх сайтах з будь-якою аудиторією",
                    "pg_label": "pg: може містити грубі жести, провокаційно одягнених людей, ненормативну лексику або легке насильство",
                    "r_label": "r: може містити грубу ненормативну лексику, інтенсивне насильство, оголеність або вживання важких наркотиків",
                    "x_label": "x: може містити жорсткі сексуальні образи або вкрай тривожне насильство"
                },
                "force-default": {
                    "title": "Примусове використання за налаштуванням",
                    "helptext": "Примушує використовувати набір за замовчуванням, навіть якщо хеш листа посилається на завантажену користувачем аватарку"
                }
            }
        },
        "forum": {
            "settings": {
                "edit-gravatar": "Керування аватаром на gravatar.com"
            }
        }
    }
}
