{
    "first-visit-indexpage": {
        "forum": {
            "title": "Правила форуму...",
            "alert-message": "Будь ласка, прийміть ці правила, щоб продовжити",
            "accept-rules": "Я прочитав і приймаю ці правила",
            "app-title": "Правила форуму",
            "warning-title": "Попередження! Ви повинні прийняти ці правила, щоб продовжити участь у форумі!",
            "warning-text": "Ці правила роз'яснюють різні обов'язки всіх членів спільноти на цьому форумі. Вони повинні дотримуватися всіма, щоб забезпечити безперебійну роботу форуму і зробити його цікавим і продуктивним для всіх учасників і відвідувачів нашої спільноти.",
            "agree-button": "Я згоден...",
            "general-rules": "Основні правила",
            "general-rules-text": "<p>Зберігайте повагу до інших учасників у будь-який час.</p>\n<p>Усі дописи мають бути професійними та ввічливими. Ви маєте повне право не погоджуватися з\nіншими учасниками спільноти і пояснити свою точку зору.</p>\n<p>Однак ви не маєте права нападати, принижувати, ображати або іншим чином принижувати будь-кого у цій спільноти. Не має значення, який титул чи владу ви маєте на цих форумах,\nви зобов'язані дотримуватися цього правила.</p>\n",
            "posting-rules": "Допис та дискусії",
            "posting-rules-text": "<p>Будьте <strong>конструктивними</strong> та не використовуйте «загальні» назви тем.</p>\n<p><strong>Будь ласка</strong>, створюйте описові назви тем! Дайте короткий опис вашої проблеми в темі.\n(Не використовуйте теми, що привертають увагу, вони не привертають уваги, а лишень дратують людей).</p>\n<p>Ось великий список тем, які <strong>НЕ МОЖНА ПИСАТИ</strong> :\nДопоможіть мені, Привіт, Дуже терміново, У мене є питання, У мене проблема і подібні.</p>\n",
            "spam": "Спам і контент для самореклами",
            "spam-text": "<p>Не допускається спам/реклама/самореклама на форумах.</p>\n<p>Ці форуми визначають спам як небажану рекламу товарів, послуг та/або інших сайтів, або повідомлення з не пов'язаним змістом. Не розсилайте спам на форумах з посиланнями на ваш сайт або продукт, а також не намагайтеся саморекламувати свій сайт, бізнес, форуми тощо. Спам також включає в себе надсилання приватних повідомлень великій кількості різних користувачів.\nСпам є також надсилання приватних повідомлень великій кількості різних користувачів.</p>\n<p>Посилання на ваш сайт дозволено лише в біографії профілю.</p>\n",
            "copyright": "Авторське право та «образливі» повідомлення, посилання або зображення",
            "copyright-text": "<p>Надавати або запитувати інформацію про те, як незаконно отримати матеріали, захищені авторським правом, заборонено.</p>\n<p>Суворо заборонено будь-які матеріали, що є наклепом, переслідуванням або зловживанням.\nМатеріали, які є сексуальні або іншим чином непристойні, расистські або надмірно дискримінаційними\nне допускається на цих форумах. Це стосується і фотографій користувачів. Використовуйте здоровий глузд під час написання повідомлень.</p>\n",
            "rule-break": "Що буде, якщо я порушу правило?",
            "rule-break-text": "<p>Якщо ви порушите правило, вас буде або попереджено, або забанено. Заборона вашого облікового запису може бути\nбути тимчасовою або постійною. Адміністратори і модератори також мають право редагувати, видаляти,\nпереміщати або закривати будь-яку тему або повідомлення, якщо вони вважають це необхідним, без попереднього попередження.</p>\n"
        }
    }
}
