{
    "kilowhat-wordpress": {
        "admin": {
            "settings": {
                "section_general_intro": "Базові налаштування, необхідні для роботи розширення.",
                "api_key": "Спільний ключ API",
                "api_key_reset": "Згенерувати новий ключ API",
                "api_key_reset_confirm": "Ви дійсно хочете згенерувати новий ключ спільного доступу до API? Старий перестане працювати, і його потрібно буде оновити вручну в налаштуваннях плагіна WordPress.\n",
                "wordpress_url": "URL-адреса WordPress",
                "default_actor": "Виконавець за налаштуванням",
                "default_actor_placeholder_invalid": "Можливе невірне значення: {value} - Введіть для пошуку користувача...",
                "default_actor_placeholder_search": "Введіть, щоб знайти користувача...",
                "default_actor_help": "Цей користувач Flarum буде призначений виконавцем усіх дій з призупинення, блокування, видалення. Він також буде використовуватися як власник обговорень і дописів, якщо не увімкнено опцію \"Призначити автора обговорення з SSO\".\n",
                "report_http_errors": "Надсилати помилки HTTP REST API WordPress налаштованим звітам Flarum",
                "report_http_errors_help": "Незалежно від значення цього параметра, запити завжди записуються у вигляді тексту в логгер за замовчуванням. Цей параметр корисний, якщо ви хочете, щоб помилки API надсилалися до Sentry або інших інструментів моніторингу як винятки з трасуванням стека.\n",
                "section_sso_intro": "Ця функція легко з'єднає користувачів WordPress з Flarum. Для них буде автоматично створено обліковий запис, який буде синхронізовано з WordPress. Якщо у вас вже є облікові записи у Flarum, вони будуть автоматично збігатися з їхніми електронними адресами. Якщо ви видалите користувача з Flarum, він буде створений знову при наступному вході в обліковий запис WordPress. Щоб заблокувати користувача Flarum, призупиніть дію його облікового запису у Flarum.\n",
                "enable_sso": "Увімкніть інтеграцію з SSO",
                "login_method": "Глобальний механізм входу",
                "login_method_help": "\"Cookie\" працює, тільки якщо WordPress і Flarum мають спільний домен верхнього рівня. \"Перенаправлення\" спричинить перенаправлення після кожного входу з WordPress, навіть якщо користувач не має наміру відвідувати форум. \"Прихований фрейм\" підключатиметься тільки при відвідуванні Flarum, викликаючи оновлення сторінки при першому завантаженні. У поєднанні з \"Затримкою Iframe\" нижче цей параметр може бути використаний для входу на форум лише на вимогу.\n",
                "login_method_options": {
                    "cookie": "Cookie",
                    "redirect": "Перенаправлення",
                    "iframe": "Прихований Iframe"
                },
                "cookie_domain": "Домен Cookie",
                "cookie_domain_help": "Цей параметр використовується тільки при використанні механізму входу за допомогою \"Cookie\". Вам потрібно встановити це значення, тільки якщо обидва веб-сайти знаходяться на різних субдоменах.\n",
                "iframe_redirect_delay": "Затримка перенаправлення iframe (мілісекунди)",
                "iframe_redirect_delay_help": "Цей параметр використовується тільки при використанні механізму входу \"Прихований фрейм\". Через який час після першого завантаження сторінки Flarum розширення все ще намагатиметься увійти в систему та оновити сторінку без участі користувача. Якщо час очікування відповіді від WordPress перевищує це значення, користувач просто отримає пропозицію увійти та оновити сторінку. Встановіть нульове значення, щоб завжди пропонувати користувачеві авторизуватися замість автоматичного оновлення.\n",
                "wordpress_login_path": "Шлях для входу в WordPress",
                "wordpress_login_path_help": "Необхідно тільки якщо ви перейменували кінцеву точку входу вручну або за допомогою плагіна",
                "wordpress_login_full_page": "Відкрийте вхід до WordPress як сторінку, а не спливаюче вікно",
                "wordpress_login_full_page_help": "За налаштуванням, натискання на посилання для входу з Flarum відкриває сторінку входу в WordPress у спливаючому вікні, як і в інших методах OAuth. Якщо цей параметр увімкнено, поточна вкладка браузера буде переходити на сторінку входу в WordPress, а потім перенаправлятиме на Flarum.\n",
                "username_strategy": "Ім'я користувача для нових користувачів",
                "username_strategy_options": {
                    "user_login": "Ім'я користувача з WordPress",
                    "first_name": "Ім'я з WordPress",
                    "random": "Випадкове ім'я користувача"
                },
                "username_strategy_help": "До імені користувача буде додано номер, якщо він вже існує у Flarum",
                "force_username_choice": "Дозвольте користувачам обирати ім'я користувача під час першого візиту",
                "force_username_choice_help": "Значення за налаштуванням буде надано з вибраним вище правилом.",
                "welcome_message": "Вступне повідомлення",
                "welcome_message_help": "Це повідомлення буде показано при першому відвідуванні форуму разом з вибором імені користувача, якщо його ввімкнено.",
                "wordpress_login_only": "Дозволити вхід лише з WordPress",
                "wordpress_login_only_help": "Вимикає вхід на Flarum і відкриває безпосередньо модальне вікно/сторінку входу на WordPress, коли запитується вхід. При зміні цього налаштування розширення спробує встановити дозвіл \"Реєстрація\" на \"Закритий\". Переконайтеся, що він залишається \"Закритий\", інакше відвідувачі зможуть створювати окремі акаунти Flarum.\n",
                "user_delete": "Дії при видаленні користувача в WordPress",
                "user_delete_options": {
                    "ignore": "Ігнорувати (зберегти користувача Flarum)",
                    "delete": "Видалити користувача Flarum",
                    "suspend": "Призупинити роботу користувача Flarum на невизначений термін (розширення має бути ввімкнено)"
                },
                "user_delete_desc": "Якщо ви виберете \"видалити\", буде видалено лише користувача, а не його вміст на Flarum.",
                "role_group_sync": "",
                "role_group_sync_help": "",
                "section_comments_intro": "Ця функція замінює коментарі WordPress на iframe від Flarum. Публікація гостьових повідомлень більше не можлива. Обговорення створюються лише для дописів з увімкненими коментарями у WordPress. Увімкнення або вимкнення коментарів синхронізується з блокуванням дискусій Flarum. Якщо ваш блог вже містить публікації, коли ви вмикаєте цю функцію, вам потрібно знову ввімкнути та вимкнути коментарі для кожної статті, щоб створити дискусію на Flarum.\n",
                "enable_comments": "Увімкнути інтеграцію коментарів",
                "excerpt_html_whitelist": "Білий список HTML-тегів для збереження у фрагменті (через кому)",
                "excerpt_html_nodes": "Довжина фрагмента контенту (у кількості HTML-вузлів)",
                "excerpt_length": "Довжина фрагменту контенту (у символах)",
                "post_thumbnail_summary": "Показати мініатюру публікації WordPress над уривком",
                "post_thumbnail_list": "Показати мініатюру допису WordPress у списку обговорень Flarum",
                "comment_author_sync": "Призначити автора дискусії від SSO",
                "comment_author_sync_help": "Якщо автор Wordpress створив обліковий запис Flarum через SSO, цей обліковий запис Flarum буде призначено власником обговорення коментарів.",
                "comment_tag": "Тег для нових потоків коментарів",
                "comment_tag_none": "Не присвоювати тег",
                "comment_tag_custom": "Користувацькі значення",
                "comment_tag_custom_help": "Список ідентифікаторів тегів через кому",
                "summary_as_last_post": "Встановіть підсумкове повідомлення як останнє повідомлення в нових обговореннях",
                "summary_as_last_post_help": "Таким чином, нові обговорення коментарів піднімаються на вершину списку обговорень у Flarum, як тільки публікація на WordPress публікується. За налаштуванням дискусія піднімалася в топ тільки після того, як перший користувач писав коментар.\n",
                "use_post_date": "Використовуйте дату публікації в WordPress як дату створення дискусії",
                "use_post_date_help": "За налаштуванням дискусії на Flarum використовують поточний час як дату створення. Ця опція дозволяє створювати обговорення з минулою датою, якщо публікація на WordPress також має минулу дату.\n",
                "post_hide": "Дія, коли публікацію WordPress приховано (видалено або переміщено до чернетки)",
                "post_hide_options": {
                    "ignore": "Ігнорувати (заблокувати обговорення відповідно до Дозволити коментарі)",
                    "lock": "Заблокувати обговорення у Flarum",
                    "hide": "Приховати обговорення у Flarum",
                    "delete": "Назавжди видалити обговорення з Flarum"
                },
                "post_delete": "Дії, коли публікація WordPress видаляється назавжди",
                "post_delete_options": {
                    "ignore": "Ігнорувати (зберегти обговорення Flarum у поточному стані)",
                    "lock": "Зберегти обговорення Flarum і заблокувати",
                    "hide": "Приховати обговорення у Flarum",
                    "delete": "Назавжди видалити обговорення з Flarum"
                },
                "wordpress_username": "Ім'я користувача адміністратора WordPress"
            },
            "tabs": {
                "wizard": "Майстер встановлення",
                "general": "Загальні налаштування",
                "sso": "Інтеграція SSO",
                "comments": "Інтеграція коментарів",
                "enabled": "Увімкнено",
                "disabled": "Вимкнено"
            },
            "appearance": {
                "edit_css_button": "Редагування користувацького CSS для WordPress"
            },
            "edit_css": {
                "title": "Редагування користувацького вбудованого CSS",
                "customize_text": "Ваш власний LESS/CSS, який буде застосовано поверх <a>стилів за замовчуванням</a> Flarum лише всередині iframe WordPress."
            },
            "permissions": {
                "gambits": "WordPress Сторонні гамбіти (див. документацію)"
            },
            "save-controls": {
                "validation-errors": "Ми знайшли кілька помилок у вашій заявці",
                "unsaved-changes": "У вас є незбережені зміни",
                "saved-at": "Збережено {ago}",
                "no-unsaved-changes": "Все збережено",
                "save": "Зберегти"
            },
            "health": {
                "title": "Перевірка здоров'я",
                "check": "Перевірити зараз",
                "errors": "Ми знайшли деякі проблеми.",
                "healthy": "Все виглядає чудово!",
                "not-run": "Перевірка здоров'я стане доступною після підключення WordPress і Flarum.",
                "request-error": "Ми не змогли провести перевірку стану здоров'я."
            },
            "wizard": {
                "intro": "Дякуємо за придбання преміум-розширення WordPress! Введіть свої облікові дані нижче, щоб автоматично з'єднати Flarum і WordPress разом.\n",
                "wordpress_url": "URL-адреса WordPress",
                "wordpress_url_help": "Посилання на домашню сторінку WordPress",
                "wordpress_username": "Ім'я користувача адміністратора WordPress",
                "wordpress_password": "Пароль адміністратора WordPress",
                "wordpress_password_help": "Пароль використовується лише для початкового налаштування і не зберігається.",
                "install": "Встановлення"
            },
            "role-group-sync": {
                "head": {
                    "role": "",
                    "group": ""
                },
                "choose": {
                    "role": "",
                    "group": ""
                },
                "custom": {
                    "role": "",
                    "group": ""
                },
                "selected-custom-group": "",
                "delete": "",
                "role-loader": {
                    "loading": "",
                    "error": ""
                }
            }
        },
        "forum": {
            "welcome-modal": {
                "title": "Ласкаво просимо!",
                "default_message": "Ласкаво просимо на форум. Оберіть ім'я користувача і ви готові до роботи!",
                "username": "Оберіть ім'я користувача",
                "submit": "Увімкнути обліковий запис на форумі",
                "not_now": "Пропустіть і читайте як гість"
            },
            "instant-login": {
                "welcome_known_user": "",
                "welcome_unknown_user": "",
                "avatar_alt_text": "Аватар WordPress",
                "message": "",
                "button": ""
            },
            "edit-user-modal": {
                "warning": "Цей користувач синхронізується з WordPress. Вам слід відредагувати електронну пошту та пароль від WordPress.\n",
                "edit_in_wordpress": "Редагування в WordPress",
                "should_not_edit_email": "Ви повинні відредагувати лист у WordPress. <a>Все одно відредагуйте</a>",
                "unlink": "Від'єднайте цього користувача від користувача wordpress",
                "unlink_help": "Якщо email збігається з користувачем WordPress, він буде пов'язаний з ним наступного разу, коли цей користувач підключиться до WordPress."
            },
            "settings": {
                "edit_on_wordpress": "Змініть електронну пошту та пароль на головному сайті"
            },
            "log_in": {
                "with_wordpress_button": "Увійдіть за допомогою WordPress"
            },
            "summary-post": {
                "head_label": "Допис на WordPress",
                "blog_link": "Читайте в блозі",
                "read_more": "Детальніше"
            },
            "embed": {
                "title": "Коментарі"
            },
            "embed-link-modal": {
                "title": "Вийти з потоку коментарів",
                "message": "Сторінка намагається перенаправити вас на {href}",
                "open": "Відкрити посилання"
            },
            "thumbnail_alt_fallback": "Ескіз публікації WordPress"
        },
        "api": {
            "blocked_actions": {
                "login": "Цей акаунт пов'язаний з WordPress. Для підключення використовуйте форму входу на головному сайті.",
                "password_reset": "Цей обліковий запис пов'язаний з WordPress. Щоб скинути пароль, скористайтеся формою входу на головному сайті.",
                "email_change": "Цей акаунт пов'язаний з WordPress. Використовуйте головну сторінку профілю веб-сайту, щоб змінити свою електронну пошту."
            },
            "health": {
                "suspend-extension-required": "Розширення Suspend має бути ввімкнено, щоб використовувати опцію «Призупинити» в параметрі «Дія при видаленні користувача»",
                "cookie-domain-format": "Домен cookie, схоже, не є дійсним доменом. Переконайтеся, що це просто домен без протоколу або шляху",
                "login-only-signup-open": "Щоб налаштування «Дозволити лише вхід на WordPress» повністю набуло чинності, вам потрібно вимкнути реєстрацію в дозволах Flarum",
                "role-group-sync-syntax": "",
                "role-group-sync-incomplete": "",
                "role-group-sync-invalid-group": "",
                "role-group-sync-invalid-role": "",
                "lock-extension-required": "Розширення Lock має бути ввімкнено, щоб використовувати інтеграцію з коментарями",
                "tags-extension-required": "Розширення Tags має бути ввімкнено, щоб використовувати опцію «Тег для нових потоків коментарів»",
                "tag-not-exist": "Ідентифікатор тегу {id}, вибраний для параметра «Ідентифікатори тегів для нових потоків коментарів», не існує",
                "debug-mode": "Режим налагодження Flarum увімкнено. Вимкніть його після завершення налагодження",
                "config-url-trailing-slash": "URL-адреса Flarum, визначена в config.php, не повинна містити кінцевого слешу (поточне значення: {url})",
                "config-url-https": "URL-адреса Flarum, визначена в config.php, має бути HTTPS (поточне значення: {url})",
                "default-actor-not-set": "",
                "default-actor-not-found": "",
                "api-key-missing": "Відсутній «Ключ API Flarum». Спробуйте оновити адмінпанель і перевірити лог-файл на наявність можливих помилок",
                "wordpress-url-missing": "Параметр «URL-адреса WordPress» має бути заповнений",
                "wordpress-url-invalid": "Параметр «URL-адреса WordPress» не є дійсною URL-адресою (поточне значення: {url})",
                "wordpress-url-index-php": "Параметр «URL-адреса WordPress» не повинен містити /index.php (поточне значення: {url})",
                "wordpress-url-trailing-slash": "Параметр «URL-адреса WordPress» не повинен містити кінцеву косу риску (поточне значення: {url})",
                "wordpress-url-https": "Параметр «URL-адреса WordPress» має бути HTTPS (поточне значення: {url})",
                "wordpress-url-mismatch": "Параметр «URL-адреса WordPress» у Flarum не відповідає параметру «Адреса WordPress (URL)» у WordPress (очікуваний: «{expected}», фактичний: «{actual}»)",
                "flarum-url-mismatch": "Параметр «URL-адреса Flarum» у WordPress не відповідає URL-адресі, налаштованій у файлі Flarum config.php (очікуване: «{expected}», фактичне: «{actual}»)",
                "api-key-mismatch": "Параметр «Ключ API Flarum» у WordPress не відповідає параметру «Ключ API Flarum» у Flarum (очікуване: «{expected}», фактичне: «{actual}»)",
                "user-id-not-found": "Параметр «Flarum User ID» у WordPress не відповідає жодному відомому користувачеві Flarum (поточне значення: «{actual}»). Для використання поточного користувача ви можете використовувати ID «{suggested}»\n",
                "user-id-not-admin": "Параметр «Ідентифікатор користувача Flarum» у WordPress не відповідає адміністратору Flarum (поточне значення: «{actual}»). Щоб використовувати поточного користувача, ви можете використовувати ID «{suggested}»\n",
                "sso-mismatch-flarum": "Інтеграція SSO увімкнена у Flarum, але не в WordPress",
                "sso-mismatch-wordpress": "Інтеграція SSO увімкнена в WordPress, але не в Flarum",
                "comments-mismatch-flarum": "Інтеграція коментарів увімкнена у Flarum, але не в WordPress",
                "comments-mismatch-wordpress": "Інтеграція коментарів увімкнена в WordPress, але не у Flarum",
                "api-error-json": "Спроба отримати доступ до API WordPress призвела до помилки: {message} - Тіло: {body}",
                "api-error-401": "Спроба отримати доступ до API WordPress призвела до помилки 401. Перевірте «Ім'я користувача адміністратора WordPress» у Flarum та «Ключ API Flarum» у WordPress",
                "api-error-other": "Спроба отримати доступ до API WordPress призвела до помилки: {message}",
                "wordpress-username-missing": "Параметр «Ім'я користувача адміністратора WordPress» має бути заповнений",
                "cookie-domain-mismatch": "Параметр «Домен файлів cookie» у WordPress не відповідає параметру «Домен файлів cookie» у Flarum (значення WordPress — «{wordpress}», значення Flarum — «{flarum}»)"
            },
            "wizard": {
                "already_installed": "Flarum вже під'єднано до WordPress. Щоб запустити майстер знову, видаліть налаштування «URL-адреса WordPress» у Flarum і налаштування «Ключ API Flarumю у WordPress.\n",
                "api_unauthorized": "Ми не змогли автентифікуватися за допомогою цих облікових даних. Перевірте URL-адресу, ім'я користувача та пароль. Зверніться до документації, щоб дізнатися про подальші кроки з усунення несправностей.\n",
                "api_error_generic": "",
                "invalid_wordpress_url": "Параметр «Адреса WordPress (URL)» у WordPress, схоже, не є дійсною URL-адресою ({actual}).",
                "api_error_get": "Помилка при виконанні GET-запиту до налаштувань WordPress ({exception}).",
                "api_error_post": "Помилка при виконанні POST-запиту до налаштувань WordPress ({exception}).",
                "plugin_not_installed": "Схоже, що плагін WordPress не встановлений або не увімкнений на цьому сайті WordPress. Переконайтеся, що у вас встановлена принаймні версія 1.2.0.\n"
            },
            "sync_setting_error": ""
        },
        "views": {
            "error": {
                "missing_wordpress_embed": "Цей допис ще не має теми для коментарів. Якщо ви є адміністратором блогу, опублікуйте цей допис або вимкніть і знову увімкніть коментарі, щоб створити тему.\n"
            }
        }
    }
}
