{
    "kyrne-websocket": {
        "forum": {
            "discussion_list": {
                "show_updates_text": "{count, plural, one {Показати # оновлену дискусію} other {Показати # оновлені дискусії}}"
            },
            "discussion_page": {
                "viewing_title": "Я тут:"
            },
            "widget": {
                "title": "Користувачі онлайн",
                "empty": "Наразі немає користувачів онлайн.",
                "guests": "{count, plural, one {1 гість} other {{count} гостей}}"
            }
        },
        "admin": {
            "chart": {
                "title": "Статистика вебсокетів"
            },
            "pusher_settings": {
                "local_cert_path": "Шлях до локального сертифіката SSL",
                "local_pk_path": "Шлях до локального приватного ключа SSL",
                "passphrase": "(Необов'язково) пароль для ключа SSL",
                "cert_self_signed": "Підтримка самопідписаних сертифікатів",
                "app_port_label": "Порт",
                "app_host_label": "Хост",
                "app_id_label": "App ID",
                "auto_update": "Автоматичне оновлення дискусії",
                "app_key_label": "App Key",
                "app_secret_label": "App Secret",
                "stats_label": "Інтервал статистики",
                "secure": "Примусити wss/https для вебсокетів",
                "title": "Налаштування Websocket/Pusher",
                "reverse_proxy": "Підтримка зворотного проксі",
                "auth_only": "Вебсокет тільки для зареєстрованих користувачів"
            },
            "help": {
                "stats": "Час між збереженнями статистики, в секундах. Рекомендовано від 3600 (1 година) до 21600 (6 годин) За налаштуванням: 7200.",
                "auto_update": "Не показуйте жовтий банер оновлення, негайно оновлюйте список обговорень.",
                "app_id": "Pusher App ID - залиште як є, якщо ви використовуєте вбудований сервер вебсокетів.",
                "app_key": "Pusher App Key - залишити як є, якщо використовується вбудований сервер вебсокетів.",
                "secret": "Pusher App Secret - залишити як є, якщо використовується вбудований сервер вебсокетів.",
                "secure": "Змусити вебсокет використовувати безпечні протоколи - увімкніть цю опцію, якщо ви використовуєте захищений сервер вебсокетів, а не веб-сайт.",
                "host": "Хост вашого сервера вебсокетів - залиште як є, якщо сервер знаходиться на тому ж хості, що і ваш адміністратор.",
                "reverse_proxy": "Вебсокети з'єднуватимуться через порт 443, якщо цей параметр увімкнено. Використовуйте цей параметр, якщо ви використовуєте зворотний проксі з порту 443 на ваш сервер вебсокетів.",
                "port": "Порт вашого сервера вебсокетів - залиште як є, якщо ви не змінюєте вбудований порт сервера.",
                "cert_path": "Потрібен лише у разі використання ssl, а НЕ зворотного проксі. Шлях до вашого SSL (https) сертифікату НА СЕРВЕРІ, на якому знаходиться ваш сервер вебсокетів - зазвичай це файл .crt або .pem.",
                "pk_path": "Потрібно лише у випадку використання ssl, а НЕ зворотного проксі. Шлях до вашого приватного ключа SSL (https) НА СЕРВЕРІ, на якому знаходиться ваш сервер вебсокетів - зазвичай це файл .key або .pem.",
                "passphrase": "Потрібен лише у разі використання ssl і НЕ зворотного проксі. Ключова фраза, яка використовується для кодування вашого сертифіката - зазвичай не потрібна.",
                "self_signed": "Потрібно лише у разі використання ssl і НЕ зворотного проксі. Увімкніть цю опцію, якщо ваш сертифікат SSL (https) є самопідписаним.",
                "auth_only": "Дозволяйте тільки аутентифікованим користувачам підключатися до сервера вебсокетів, це може зменшити навантаження на процесор."
            }
        }
    }
}
