{
    "ordinaryjellyfish-automod": {
        "admin": {
            "permissions": {
                "bypass": "Обхідні автоматичні фільтри"
            },
            "settings": {
                "threshold": "Поріг довіри",
                "threshold_help": "Довірчий поріг становить від 0,00 до 1,00, відображаючи ймовірність того, що вхідні дані або відповідь належать до певної категорії. Нижчий поріг призведе до меншої кількості хибних спрацьовувань, але також може призвести до більшої кількості хибних негативних результатів. Вищий поріг призводить до більшої кількості хибних спрацьовувань, але також може призвести до меншої кількості хибних несприятливих результатів.",
                "moderate_categories_label": "Категорії модерування",
                "moderate_categories_label_help": "Категорії, які автоматично позначатимуть контент для модерації, якщо вони ввімкнені та відповідають правилам довіри.",
                "moderate_categories_enable": "Увімкнути категорії модерації",
                "service_account": "Сервісний обліковий запис",
                "filter_label": "Попередньо встановлені фільтри",
                "filter_help": "Це фільтри, які я особисто створив, щоб допомогти захистити ваш форум. Увімкнені фільтри будуть автоматично прапорцями, так само як і категорії модерації.",
                "filter_enable": "Увімкнути попередньо створені фільтри",
                "filters": {
                    "doxxing": "Доксінг",
                    "doxxing_help": "Акт публічного розкриття раніше приватної особистої інформації про особу чи організацію, як правило, зі зловмисними намірами.",
                    "flag_unsafe_images": "Небезпечні зображення",
                    "flag_unsafe_images_help": "Запуск виявлення безпечного пошуку Google і позначення небезпечних зображень. Майте на увазі, що це може збільшити затримку при публікації вашого коментаря."
                }
            }
        },
        "lib": {
            "moderate_categories": {
                "toxic": "Токсичний",
                "toxic_help": "Вміст, який є грубим, неповажним або необґрунтованим.",
                "derogatory": "Принизливий",
                "derogatory_help": "Негативні або шкідливі коментарі, спрямовані проти особистості та/або захищених атрибутів.",
                "violent": "Жорстокий",
                "violent_help": "Описує сценарії, що зображують насильство над людиною або групою людей, або загальні описи крові.",
                "sexual": "Сексуальний",
                "sexual_help": "Містить посилання на сексуальні дії або інший непристойний контент.",
                "insult": "Образа",
                "insult_help": "Образливий, підбурювальний або негативний коментар на адресу людини або групи людей.",
                "profanity": "Ненормативна лексика",
                "profanity_help": "Непристойна або вульгарна лексика, наприклад, лайка.",
                "death": "Смерть, шкода і трагедія",
                "death_help": "Людські смерті, трагедії, нещасні випадки, катастрофи та самоушкодження.",
                "weapons": "Зброя та вогнепальна зброя",
                "weapons_help": "Вміст, в якому згадуються ножі, пістолети, особиста зброя та аксесуари, такі як боєприпаси, кобури тощо.",
                "public_safety": "Громадська безпека",
                "public_safety_help": "Служби та організації, які надають допомогу та забезпечують громадську безпеку.",
                "health": "Здоров'я",
                "health_help": "Здоров'я людини, зокрема: стан здоров'я, хвороби та розлади Медичні методи лікування, ліки, вакцинація, медичні практики та ресурси для зцілення, включаючи групи підтримки.",
                "religion": "Релігія та віра",
                "religion_help": "Системи вірувань, які мають справу з можливістю існування надприродних законів та істот; релігія, віра, переконання, духовна практика, церкви та місця поклоніння. Включає астрологію та окультизм.",
                "drugs": "Заборонені наркотики",
                "drugs_help": "Рекреаційні та заборонені наркотики; наркотична атрибутика та вирощування наркотиків, кустарне виробництво тощо. Включає медичне вживання наркотиків, які зазвичай вживаються з рекреаційною метою (наприклад: марихуана).",
                "war": "Війна та конфлікт",
                "war_help": "Війна, військові конфлікти та великі фізичні конфлікти за участю великої кількості людей. Включає обговорення військової служби, навіть якщо вона безпосередньо не пов'язана з війною чи конфліктом.",
                "finance": "Фінанси",
                "finance_help": "Споживчі та ділові фінансові послуги, такі як банківські послуги, позики, кредити, інвестування та страхування.",
                "politics": "Політика",
                "politics_help": "Політичні новини та медіа; обговорення соціальної, урядової та державної політики.",
                "legal": "Право",
                "legal_help": "Юридичний вміст, включаючи юридичні фірми, юридичну інформацію, первинні юридичні матеріали, параюридичні послуги, юридичні публікації та технології, експертів-свідків, судових консультантів та інших постачальників юридичних послуг."
            }
        },
        "forum": {
            "flag_reason": "Automod позначив цю публікацію як {reason}"
        }
    }
}
