{
    "askvortsov-auto-moderator": {
        "admin": {
            "action_drivers": {
                "activate_email": "Aktifkan Email",
                "add_to_group": "Tambahkan ke Grup",
                "remove_from_group": "Hapus dari Grup",
                "suspend": "Tangguhkan",
                "unsuspend": "Cabut penangguhan"
            },
            "metric_drivers": {
                "discussions_entered": "Diskusi dimasuki",
                "discussions_participated": "Diskusi Yang Diikuti",
                "discussions_started": "Diskusi dimulai",
                "posts_made": "Post Dibuat",
                "likes_given": "Tanda Suka Yang Diberikan",
                "likes_received": "Tanda Suka Yang Diterima",
                "best_answers": "Jawaban Terbaik",
                "moderator_strikes": "Peneguran Moderator"
            },
            "requirement_drivers": {
                "email_confirmed": "Email Terkonfirmasi",
                "in_group": "Dalam grup",
                "suspended": "Ditangguhkan",
                "email_matches_regex": "Regex Cocok Dengan Email"
            },
            "in_group_settings": {
                "regex": "Regex untuk Email yang Valid (tanpa garis miring)"
            },
            "group_selector": {
                "placeholder": "Pilih grup"
            },
            "suspend_selector": {
                "days": "Hari untuk penundaan",
                "indefinitely": "Menangguhkan Tanpa Batas Waktu?"
            },
            "criterion_status": {
                "heading": "Periksa Status",
                "invalid": "Kriteria saat ini tidak valid. Silakan periksa driver di bawah ini untuk mengetahui adanya error.",
                "no_actions": "Tidak ada tindakan yang didefinisikan untuk kriteria ini. Tidak ada yang akan terjadi ketika pengguna menambah atau menghapus kriteria ini.",
                "no_metrics_or_reqs": "Tidak ada metrik atau persyaratan yang ditetapkan untuk kriteria ini. Ini berarti SEMUA pengguna akan memenuhi syarat untuk kriteria ini.",
                "valid": "Kriteria ini valid!",
                "action_validation_errors": "Kesalahan validasi driver tindakan berikut ini ditemukan:",
                "requirement_validation_errors": "Kesalahan validasi driver persyaratan berikut ini ditemukan:"
            },
            "criterion_page": {
                "driver_missing_ext": "Driver ini bergantung pada ekstensi yang saat ini belum diaktifkan.",
                "back": "Kembali ke Daftar Kriteria",
                "name_label": "Nama",
                "icon_label": "Ikon",
                "description_label": "Deskripsi",
                "new_criterion": "Membuat Kriteria",
                "negated": "Ditiadakan?",
                "loading": "=> core.ref.loading",
                "delete_button": "=> core.ref.delete",
                "metrics_and_requirements_label": "Metrik dan Persyaratan",
                "metrics_and_requirements_help": "Ini menentukan apakah pengguna memenuhi syarat untuk kriteria ini. Metrik mewakili rentang nilai, persyaratan adalah kondisi boolean.",
                "metrics_heading": "Metrik",
                "requirements_heading": "Persyaratan",
                "add_metric": "Tambah Metrik",
                "actions_label": "Tindakan",
                "actions_help": "Tindakan saat gain dieksekusi ketika pengguna memenuhi syarat untuk kriteria baru. Tindakan saat loss dijalankan ketika pengguna tidak lagi memenuhi syarat untuk suatu kriteria.",
                "actions_on_gain_heading": "Tindakan saat Gain",
                "actions_on_loss_heading": "Tindakan saat Loss",
                "add_action": "Tambah Tindakan"
            },
            "undefined_driver_item": {
                "text": "ERROR! Driver <strong>{driverName}</strong> tidak terdefinisi. Kemungkinan besar, driver ini ditambahkan oleh ekstensi yang saat ini tidak diinstal. Anda harus mengaktifkan kembali ekstensi tersebut atau menghapus driver ini agar kriteria menjadi valid kembali."
            },
            "automoderator_page": {
                "criterion_invalid": "Kriteria saat ini tidak valid. Silakan periksa pengaturannya untuk informasi lebih lanjut",
                "list_heading": "Kriteria",
                "create_criterion_button": "Buat Kriteria Baru"
            },
            "automoderator_instructions": {
                "header": "Petunjuk Ekstensi",
                "text": "<li>Tl; dr: Ketika pengguna memenuhi kriteria X, lakukan Y. Ketika pengguna tidak lagi memenuhi kriteria X, lakukan Z.</li>\n<li><strong>Kriteria:</strong> Kriteria adalah inti dari ekstensi ini. Kriteria adalah kumpulan metrik dan persyaratan yang dapat berubah-ubah. Ketika seorang pengguna memenuhi sebuah kriteria, setiap tindakan \"saat gain\" untuk kriteria tersebut akan dieksekusi. Ketika seorang pengguna kehilangan sebuah kriteria, setiap tindakan \"saat loss\" untuk kriteria tersebut akan dieksekusi.</li>\n<ul>\n  <li><strong>Metrik:</strong> Kondisi numerik. Misalnya, jumlah postingan atau jumlah \"Suka\" yang diterima. Sebuah kriteria dapat memerlukan rentang/minimum/maksimum metrik.</li>\n  <li><strong>Persyaratan:</strong> Kondisi boolean abstrak. Misalnya, tidak sedang ditangguhkan, atau memiliki email yang cocok dengan regex tertentu.</li>\n</ul>\n<li><strong>Tindakan:</strong> Sesuatu yang terjadi secara otomatis ketika sebuah kriteria terpenuhi atau gagal. Hal ini dapat mencakup apa saja, mulai dari menambah/menghapus grup hingga mengirim email hingga menangguhkan pengguna.</li>\n<li><strong>Pemicu:</strong> Serangkaian peristiwa yang akan menyebabkan kelompok kriteria pengguna dievaluasi ulang. Ini adalah bagian dari definisi metrik dan persyaratan. Semua kriteria akan dievaluasi pada saat login: itulah \"pemicu universal (universal trigger)\".</li>\n<li>Tindakan \"saat loss\" akan selalu dijalankan sebelum tindakan \"saat gain\". Dengan begitu, tindakan akan dilakukan selama pengguna memenuhi setidaknya satu kriteria yang melakukan tindakan saat gain.</li>\n<li>Perlu diingat bahwa tindakan hanya berjalan \"saat loss\" dan \"saat gain\". Pengeditan manual ketika pengguna memenuhi syarat untuk suatu kriteria tidak akan memicu tindakan \"saat gain\" dari kriteria tersebut untuk diterapkan kembali.</li>\n<li>Jika Anda menghapus sebuah kriteria, tindakan \"saat loss\" TIDAK akan dijalankan untuk pengguna yang saat ini memenuhi syarat untuk kriteria tersebut.</li>\n<li>Jika Anda menggunakan kriteria untuk mengelola grup, Kami sarankan untuk membuat satu set grup terpisah untuk dikelola berdasarkan kriteria. Anda tidak akan dapat menambah/menghapus pengguna ke/dari grup-grup ini secara manual.</li>\n"
            }
        },
        "lib": {
            "group_id": "ID Grup",
            "managed_groups": {
                "header": "Grup Yang Dikelola:",
                "group_item": "<badge></badge> {groupName}",
                "groups_not_editable": "Grup yang dikelola dengan kriteria automoderator tidak dapat ditambahkan/dihapus ke/dari pengguna secara manual untuk mencegah ketidakkonsistenan."
            }
        }
    }
}
