{
    "clarkwinkelmann-jwt-cookie-login": {
        "admin": {
            "settings": {
                "cookieName": "Nama Cookie",
                "actorId": "",
                "actorIdHelp": "Pengguna Flarum ini akan dijadikan aktor untuk permintaan REST API internal yang membuat pengguna baru. Pengguna tersebut haruslah seorang admin.\n",
                "audience": "",
                "audienceHelp": "",
                "publicKey": "Public Key",
                "publicKeyHelp": "Biarkan kosong untuk menggunakan Google Firebase key",
                "publicKeyAlgorithm": "Algoritma Public Key",
                "publicKeyAlgorithmHelp": "Hanya diperlukan dengan Public Key. Contoh: RS256",
                "expirationLeeway": "",
                "expirationLeewayHelp": "Berapa detik tambahan setelah berakhirnya JWT, sesi masih bisa dimulai. Nilai ini hanya dimaksudkan untuk beberapa menit paling buruk untuk memperhitungkan waktu pergeseran jam di antara server. Namun, nilai ini juga dapat diatur ke nilai yang lebih panjang jika ini adalah satu-satunya cara untuk mengatasi masa pakai JWT yang pendek dari external library.\n",
                "usernameTemplate": "Template Username",
                "usernameTemplateHelp": "",
                "emailTemplate": "Template Email",
                "emailTemplateHelp": "",
                "registrationHook": "",
                "registrationHookHelp": "URL yang memenuhi syarat yang akan menerima POST request ketika pengguna mengunjungi forum untuk pertama kalinya. Permintaan tersebut akan mengembalikan JSON:API payload yang akan digunakan untuk membuat pengguna baru di Flarum. Gunakan sintaks <code>{sub}</code> untuk menggunakan atribut dari JWT dalam URL. JWT yang lengkap akan diteruskan ke <code>Authorization</code> header. Username dan Email bersifat opsional jika value untuk template dikonfigurasikan.\n",
                "authorizationHeader": "",
                "authorizationHeaderHelp": "Jika kolom ini dibiarkan kosong, <code>Authorization</code> header akan berisi <code>Token <JWT token></code>.",
                "hiddenIframe": "",
                "hiddenIframeHelp": "",
                "autoLoginDelay": "",
                "autoLoginDelayHelp": "",
                "logoutRedirect": "",
                "logoutRedirectHelp": ""
            }
        },
        "forum": {
            "alert": {
                "refresh": "",
                "login": "",
                "logout": ""
            }
        }
    }
}
