{
    "fof-anti-spam": {
        "admin": {
            "permissions": {
                "spamblock_users_label": "Tandai pengguna sebagai pengirim spam"
            },
            "settings": {
                "button": "Pengaturan",
                "default-actions": {
                    "delete_user_label": "Hapus pengguna",
                    "delete_user_help": "Ini akan menghapus pengguna secara permanen. Meskipun dimatikan, pengguna tetap akan dihukum.",
                    "delete_discussions_label": "Hapus Diskusi",
                    "delete_discussions_help": "Ini akan menghapus seluruh diskusi yang dimulai sipengguna. Meskipun dimatikan, diskusi tetap akan secara halus terhapus.",
                    "delete_posts_label": "Hapus suntingan",
                    "delete_posts_help": "Ini akan menghapus semua suntingan yang dibuat dipengguna. Meskipun dimatikan, suntingan secara halus terhapus.",
                    "heading": "Tindakan moderasi bawaan",
                    "introduction": "Jika seorang pengguna ditandai sebagai pengirim spam, moderator dapat memilih beberapa tindakan untuk menghadapi kasus tertentu. Pengaturan ini membolehkan anda untuk mengatur kembali tindakan normal yang biasa diputuskan, untuk mempercepat proses, akan tetapi juga memperbolehkan sebagai variasi yang dibutuhkan.\n",
                    "move_discussions_to_tags_label": "Pindahkan diskusi ke penanda",
                    "move_discussions_to_tags_help": "Ini akan memindahkan seluruh diskusi yang dimulai oleh pengguna ke penanda yang ditentukan. Bersihkan penanda terseleksi untuk meninggalkan diskusi dalam penanda aseli. Tidak memiliki akibat jika opsi 'Hapus diskusi' diaktifkan."
                },
                "stopforumspam": {
                    "heading": "StopForumSpam",
                    "introduction": "Periksa pendaftaran pengguna baru yang melawan database <a>StopForumSpam</a>. Jika salah satu dari <code>confidence</code> atau <code>frequency</code>melampaui ambang batas, pengguna dicegah untuk melengkapi pendaftarannya kedalam forum anda.\n\nPendaftaran SSO melalui <code>fof/oauth</code> dan <code>fof/passport</code> juga akan didukung. Penyedia SSO lain seharusnya berjalan, namun belum teruji.\n",
                    "username_label": "Periksa Pengguna Spam",
                    "ip_label": "Periksa Alamat IP Spam",
                    "email_label": "Periksa Email Spam",
                    "frequency_label": "Batasan",
                    "frequency_help": "Jumlah laporan spam diantara semua pemeriksaan aktif yang akan menggagalkan filter spam.\nMisal: Jika email mendapat 1 hit, dan ip mendapat 2 hit, total akan berjumlah 3. Pencegahan pendaftaran akan dilakukan jika batasan ditentukan 3 atau kurang.\n",
                    "api_key_label": "Kunci API",
                    "api_key_text": "Anda memiliki opsi untuk melaporkan spammer ke StopForumSpam untuk mencapai terjaganya kebesaran komunitas forum bebas spam.",
                    "api_key_instructions_text": "<register>Daftar untuk StopForumSpam</register>. Anda akan membutuhkan <key>peroleh sebuah Kunci API</key>.",
                    "regional_endpoint_label": "Akses Geografis",
                    "regional_endpoint_help": "Bawaan kami akan menunjukan server wilayah terdekat untuk mendapatkan hasil balasan tercepat. Seharusnya anda berharap membatasi lalu lintas ke sebuah wilayah, seperti sebuah kepatuhan terhadap peraturan perusahaan atau perundang-undangan negara berdaulat, kemudian anda dapat memaksa koneksi ke sebuah wilayah tertentu.",
                    "region_closest_label": "Terdekat",
                    "region_europe_label": "Eropa",
                    "region_us_label": "Amerika Serikat",
                    "confidence_label": "Keyakinan",
                    "confidence_help": "Nilai keyakinan adalah sebuah alasan pertanda baik bahwa bidang dalam pengujian akan menghasilkan aktifitas yang tidak diharapkan. Atur tingkat keyakinan sebagai prosentase. Bila bidang adalah sama atau di atas gambar ini, pendaftaran akan diblokir, mengabaikan 'kerutinan' pengujian di atas.",
                    "email_hash_label": "Gunakan alamat email yang diacak",
                    "email_hash_help": "Lewati sebuah pengacakan MD5 terhadap alamat email seharusnya anda berharap tidak melewatkan alamat email itu sendiri. Metoda ini melewati semua daftar hitam, normalisasi dan pemeriksaan obfuskasi.",
                    "sfs_lookup_label": "Mencari pendaftaran",
                    "sfs_lookup_help": "Jika diaktifkan, kami akan memeriksa database StopForumSpam ketika pengguna baru mendaftar ke forum anda. Jika pengguna ditemukan (nama pengguna, alamat IP, email) dan data petunjuk tersebut diaktifkan bersama dengan tingkat keyakinan SFS mencapai tingkat yang anda tentukan, mereka akan dicegah untuk melengkapi pendaftarannya.",
                    "report_blocked_registrations_label": "laporan pendaftaran diblokir",
                    "report_blocked_registrations_help": "Jika pendaftaran diblokir dengan melihat fitur pendaftaran, kami akan melaporkan percobaan kembali ke HentikanForumSpam, sehingga aktivitas spammer dapat lebih terkonfirmasi dengan lebih baik. Kebutuhan pengaturan sebuah kunci API StopForumSpam (lihat di bawah)."
                }
            },
            "blocked_registrations": {
                "button": "Pendaftaran Yang Diblokir",
                "title": "Pendaftaran Yang Diblokir",
                "no-records": "Tidak ditemukan pendaftaran terblokir.",
                "help": "Halaman ini memperlihatkan semua pendaftaran yang telah diblokir oleh layanan StopForumSpam. Anda akan melihat rincian dari setiap pendaftaran, dan jika anda ingin, anda dapat menghapus catatan dari database.\n",
                "attempted-at": "Percobaan pada",
                "ip": "Alamat IP",
                "email": "Alamat Email",
                "username": "Nama Pengguna",
                "login-provider": "Penyedia Layanan Login",
                "login-provider-data": "Data Penyedia Layanan Login",
                "sfs-data": "Data StopForumSpam",
                "delete_entry": "Hapus masukan"
            }
        },
        "forum": {
            "message": {
                "stopforumspam": {
                    "blocked": "Rincian dari pendaftaran anda telah kami temukan dalam sebuah database pencegahan spam, sehingga pendaftaran anda telah diblokir."
                }
            },
            "spammer_modal": {
                "hard_delete_discussions_label": "Hapus diskusi",
                "hard_delete_discussions_help": "Ini akan secara permanen menghapus semua diskusi yang dimulai pengguna ini. Bila tidak aktif, diskusi tetap akan disembunyikan.",
                "hard_delete_posts_label": "Hapus suntingan",
                "hard_delete_posts_help": "Ini akan secara permanen menghapus seluruh suntingan (komentar, balasan, dan lainnya) yang dibuat oleh pengguna ini. Bila tidak diaktifkan, suntingan tetap akan disembunyikan.",
                "hard_delete_user_label": "Hapus pengguna",
                "hard_delete_user_help": "Ini akan secara permanen menghapus pengguna. Bila tidak diaktifkan, pengguna tetap akan dihukum.",
                "intro": "Ketika menandai pengguna sebagai spammer, beberapa tindakan akan dilakukan, berpedoman pada ekstensi yang ada pada forum anda.",
                "move_discussions_tag_label": "Pindahkan diskusi kedalam penanda karantina",
                "move_discussions_tag_help": "Ini akan memindahkan seluruh diskusi yang dimulai oleh pengguna ini kedalam penanda yang ditentukan dalam pengaturan forum. Bila tidak diaktifkan, diskusi tetap pada penanda sekarang.",
                "process_button": "Proses",
                "title": "Tandai {username} sebagai spammer",
                "report_to_sfs_label": "Laporkan ke StopForumSpam",
                "report_to_sfs_help": "Ini akan melaporkan rincian dasar pengguna (nama pengguna, email, alamat IP) untuk StopForumSpam. Ini akan menolong pencegahan pengguna dalam pendaftaran di forum lainnya yang menggunakan layanan StopForumSpam."
            },
            "user_controls": {
                "spammer_button": "Pengirim Spam"
            }
        }
    }
}
