{
    "fof-anti-spam": {
        "admin": {
            "permissions": {
                "spamblock_users_label": "Tandai pengguna sebagai pengirim spam"
            },
            "settings": {
                "button": "Pengaturan",
                "default-actions": {
                    "delete_user_label": "Hapus pengguna",
                    "delete_user_help": "Ini akan menghapus pengguna secara permanen. Ketika dinonaktifkan, pengguna akan ditangguhkan.",
                    "delete_discussions_label": "Hapus diskusi",
                    "delete_discussions_help": "Ini akan menghapus secara permanen semua diskusi yang dimulai oleh pengguna ini. Jika dinonaktifkan, diskusi akan dihapus sementara.",
                    "delete_posts_label": "Hapus post",
                    "delete_posts_help": "Ini akan menghapus secara permanen semua postingan yang dibuat oleh pengguna ini. Ketika dinonaktifkan, postingan akan dihapus sementara.",
                    "heading": "Tindakan moderasi bawaan",
                    "introduction": "Jika seorang pengguna ditandai sebagai pengirim spam, moderator dapat memilih beberapa tindakan untuk menghadapi kasus tertentu. Pengaturan ini membolehkan anda untuk mengatur kembali tindakan normal yang biasa diputuskan, untuk mempercepat proses, akan tetapi juga memperbolehkan sebagai variasi yang dibutuhkan.\n",
                    "move_discussions_to_tags_label": "Pindahkan diskusi ke penanda",
                    "move_discussions_to_tags_help": "Ini akan memindahkan seluruh diskusi yang dimulai oleh pengguna ke penanda yang ditentukan. Bersihkan penanda terseleksi untuk meninggalkan diskusi dalam penanda aseli. Tidak memiliki akibat jika opsi 'Hapus diskusi' diaktifkan."
                },
                "stopforumspam": {
                    "heading": "StopForumSpam",
                    "introduction": "Periksa pendaftaran pengguna baru yang melawan database <a>StopForumSpam</a>. Jika salah satu dari <code>confidence</code> atau <code>frequency</code>melampaui ambang batas, pengguna dicegah untuk melengkapi pendaftarannya kedalam forum anda.\n\nPendaftaran SSO melalui <code>fof/oauth</code> dan <code>fof/passport</code> juga akan didukung. Penyedia SSO lain seharusnya berjalan, namun belum teruji.\n",
                    "username_label": "Periksa Pengguna Spam",
                    "ip_label": "Periksa Alamat IP Spam",
                    "email_label": "Periksa Email Spam",
                    "frequency_label": "Batasan",
                    "frequency_help": "Jumlah laporan spam diantara semua pemeriksaan aktif yang akan menggagalkan filter spam.\nMisal: Jika email mendapatkan 1 hit, dan ip mendapatkan 2 hit, maka akan ada total 3 hit. Jika ambang batas diatur ke 3 atau kurang, kami akan mencegah pendaftaran.\n",
                    "api_key_label": "Kunci API",
                    "api_key_text": "Anda memiliki opsi untuk melaporkan spammer ke StopForumSpam untuk mencapai terjaganya kebesaran komunitas forum bebas spam.",
                    "api_key_instructions_text": "<register>Daftar untuk StopForumSpam</register>. Maka Anda membutuhkannya untuk <key>memperoleh sebuah Kunci API</key>.",
                    "regional_endpoint_label": "Akses Geografis",
                    "regional_endpoint_help": "Secara default, kami akan mengarahkan pencarian ke server regional terdekat untuk memberikan respons tercepat. Jika Anda ingin membatasi lalu lintas ke wilayah tertentu, misalnya untuk mematuhi peraturan privasi perusahaan atau negara, Anda dapat memaksa koneksi ke wilayah tertentu.",
                    "region_closest_label": "Terdekat",
                    "region_europe_label": "Eropa",
                    "region_us_label": "Amerika Serikat",
                    "confidence_label": "Keyakinan",
                    "confidence_help": "Nilai keyakinan adalah indikator yang cukup baik bahwa bidang yang diuji akan menghasilkan aktivitas yang tidak diinginkan. Tetapkan tingkat kepercayaan Anda sebagai persentase. Jika bidang tersebut sama atau di atas angka ini, pendaftaran akan diblokir, terlepas dari tes 'frekuensi' di atas.",
                    "email_hash_label": "Gunakan alamat email yang di-hash",
                    "email_hash_help": "Masukkan hash MD5 dari alamat email jika Anda tidak ingin melewati alamat email itu sendiri. Metode ini melewati semua daftar hitam, normalisasi, dan obfuscation check.",
                    "sfs_lookup_label": "Mencari pendaftaran",
                    "sfs_lookup_help": "Jika diaktifkan, kami akan memeriksa database StopForumSpam ketika pengguna baru mendaftar di forum Anda. Jika pengguna ditemukan ( username, alamat IP, email) dan titik data tersebut diaktifkan bersama dengan tingkat kepercayaan SFS yang mencapai tingkat yang Anda tentukan, mereka akan dicegah untuk menyelesaikan pendaftaran mereka.",
                    "report_blocked_registrations_label": "laporan pendaftaran diblokir",
                    "report_blocked_registrations_help": "Ketika sebuah pendaftaran diblokir oleh fitur Pencarian Pendaftaran, kami akan melaporkan upaya tersebut kembali ke StopForumSpam, sehingga aktivitas spammer dapat dikonfirmasi dengan lebih baik. Membutuhkan kunci API StopForumSpam yang telah diatur (lihat di bawah)."
                }
            },
            "blocked_registrations": {
                "button": "Pendaftaran Yang Diblokir",
                "title": "Pendaftaran Yang Diblokir",
                "no-records": "Tidak ditemukan pendaftaran terblokir.",
                "help": "Halaman ini memperlihatkan semua pendaftaran yang telah diblokir oleh layanan StopForumSpam. Anda akan melihat rincian dari setiap pendaftaran, dan jika anda ingin, anda dapat menghapus catatan dari database.\n",
                "attempted-at": "Percobaan pada",
                "ip": "Alamat IP",
                "email": "Alamat Email",
                "username": "Username",
                "login-provider": "Penyedia Layanan Login",
                "login-provider-data": "Data Penyedia Layanan Login",
                "sfs-data": "Data StopForumSpam",
                "delete_entry": "Hapus entri"
            }
        },
        "forum": {
            "message": {
                "stopforumspam": {
                    "blocked": "Detail pendaftaran Anda telah ditemukan dalam database pencegahan spam, oleh karena itu pendaftaran Anda telah diblokir."
                }
            },
            "spammer_modal": {
                "hard_delete_discussions_label": "Hapus diskusi",
                "hard_delete_discussions_help": "Ini akan secara permanen menghapus semua diskusi yang dimulai pengguna ini. Bila tidak aktif, diskusi tetap akan disembunyikan.",
                "hard_delete_posts_label": "Hapus post",
                "hard_delete_posts_help": "Ini akan menghapus secara permanen semua postingan (komentar, balasan, dll) yang dibuat oleh pengguna ini. Ketika dinonaktifkan, postingan akan disembunyikan.",
                "hard_delete_user_label": "Hapus pengguna",
                "hard_delete_user_help": "Ini akan menghapus pengguna secara permanen. Ketika dinonaktifkan, pengguna akan ditangguhkan.",
                "intro": "Ketika menandai pengguna sebagai spammer, beberapa tindakan akan dilakukan, berpedoman pada ekstensi yang ada pada forum anda.",
                "move_discussions_tag_label": "Pindahkan diskusi ke dalam tag karantina",
                "move_discussions_tag_help": "Ini akan memindahkan semua diskusi yang dimulai oleh pengguna ini ke tag yang Anda tentukan dalam pengaturan forum. Jika dinonaktifkan, diskusi akan tetap berada di tag mereka saat ini.",
                "process_button": "Proses",
                "title": "Tandai {username} sebagai spammer",
                "report_to_sfs_label": "Laporkan ke StopForumSpam",
                "report_to_sfs_help": "Ini akan melaporkan rincian dasar pengguna (username, email, alamat IP) ke StopForumSpam. Hal ini akan membantu mencegah pengguna untuk mendaftar di forum lain yang menggunakan layanan StopForumSpam."
            },
            "user_controls": {
                "spammer_button": "Pengirim Spam"
            }
        }
    }
}
