{
    "fof-sentry": {
        "admin": {
            "sentry_settings": "Pengaturan Sentry",
            "sections": {
                "general": "Pengaturan Umum",
                "general_help": "Konfigurasi DSN Sentry dan pengaturan environment Anda.",
                "user_context": "Konteks Pengguna",
                "user_context_help": "Kontrol informasi pengguna apa yang dikirim ke Sentry bersama laporan error.",
                "backend_performance": "Pemantauan Performa Backend",
                "backend_performance_help": "Lacak performa dan profiling backend PHP. Atur tingkat sampel untuk mengontrol overhead.",
                "database_monitoring": "Pemantauan Query Database",
                "database_monitoring_help": "Pantau performa query database, deteksi query lambat dan masalah N+1. Hanya aktif ketika pemantauan performa backend diaktifkan.",
                "frontend_monitoring": "Pemantauan Frontend (JavaScript)",
                "frontend_monitoring_help": "Lacak error JavaScript dan performa frontend. Catatan: Mengaktifkan fitur tertentu akan meningkatkan ukuran bundle."
            },
            "settings": {
                "dsn_label": "Sentry DSN",
                "dsn_help": "Nama Sumber Data Sentry Anda - URL koneksi utama untuk pelaporan error frontend dan backend. Dapatkan dari pengaturan proyek Sentry Anda. Penting: Jika menggunakan Relay DSN, nonaktifkan \"User Feedback\" karena memerlukan akses langsung ke Sentry.",
                "dsn_backend_label": "Sentry DSN (Hanya Backend)",
                "dsn_backend_help": "DSN terpisah opsional khusus untuk error backend (PHP). Berguna untuk menggunakan proyek Sentry berbeda untuk error backend, routing melalui Relay untuk performa lebih baik, atau memisahkan pelacakan error frontend dan backend. Jika tidak diatur, DSN utama di atas akan digunakan untuk keduanya.",
                "environment_label": "Sentry Environment",
                "environment_help": "Tag semua event dengan nama environment (misalnya, \"production\", \"staging\", \"development\"). Ini membantu menyaring error berdasarkan deployment environment dan mengatur aturan alert berbeda per environment.",
                "user_feedback_label": "Aktifkan Dialog Feedback Pengguna",
                "user_feedback_help": "Ketika diaktifkan, pengguna akan melihat form feedback setelah mengalami error, memungkinkan mereka mendeskripsikan apa yang terjadi. Form otomatis terisi dengan username, email (jika diaktifkan), dan keanggotaan grup. Membuat saluran komunikasi langsung dengan pengguna yang mengalami masalah. Memerlukan DSN Sentry langsung (bukan Relay DSN).",
                "send_user_emails_label": "Sertakan Alamat Email Pengguna dalam Laporan",
                "send_user_emails_help": "Ketika diaktifkan, alamat email pengguna disertakan dalam semua event Sentry untuk menghubungi pengguna dan menyaring error. Pertimbangan Privasi: Tinjau kebijakan privasi Anda sebelum mengaktifkan. ID pengguna, username, dan grup selalu disertakan terlepas dari pengaturan ini.",
                "monitor_performance_label": "Tingkat Sampel Pemantauan Performa Backend",
                "monitor_performance_help": "Persentase backend request yang dilacak (0 = dinonaktifkan, 100 = lacak semua). Jejak performa mencakup waktu request/respons, query database, dan waktu pemuatan ekstensi. Rekomendasi: Mulai dengan 10-25% di produksi, 100% di staging. Nilai lebih rendah mengurangi volume data dan biaya Sentry.",
                "profile_rate_label": "Tingkat Sampel Profiling Backend",
                "profile_rate_help": "Persentase transaksi yang dilacak untuk diprofil (relatif terhadap tingkat monitoring di atas). Contoh: Jika monitoring = 10% dan profiling = 50%, maka 5% dari semua request diprofil. Profiling memberikan data performa tingkat fungsi secara detail. Dampak performa: Profiling menambah overhead dan meningkatkan waktu respons. Lihat <a>panduan optimasi Sentry</a>. {icon} <bold>Memerlukan ekstensi Excimer (hanya Linux). Saat ini {icon}.</bold>",
                "javascript_label": "Aktifkan Pelaporan Error JavaScript",
                "javascript_help": "Tangkap dan laporkan error JavaScript dari frontend forum Anda ke Sentry. Melacak exception yang tidak tertangkap, promise rejection, error console, dan kegagalan jaringan. Nonaktifkan jika hanya ingin pelacakan error backend.",
                "javascript_console_label": "Tangkap Pesan Console sebagai Breadcrumbs",
                "javascript_console_help": "Rekam panggilan console.log, console.info, console.warn, dan console.error sebagai breadcrumbs. Lihat urutan event yang mengarah ke error dan debug interaksi pengguna yang kompleks. Catatan: Meningkatkan volume data. Gunakan secara selektif di produksi.",
                "javascript_trace_sample_rate": "Tingkat Sampel Pemantauan Performa Frontend",
                "javascript_trace_sample_rate_help": "Persentase pemuatan halaman yang dilacak (0 = dinonaktifkan, 100 = lacak semua). Melacak waktu pemuatan halaman, pemuatan sumber daya, permintaan API, dan waktu navigasi. Ukuran bundle: Bertambah ~30 KB. Rekomendasi: Gunakan 10-25% di produksi.",
                "javascript_replays_session_sample_rate": "Tingkat Sampel Session Replay",
                "javascript_replays_session_sample_rate_help": "Persentase sesi pengguna yang direkam dari awal. Menangkap gerakan mouse, klik, scrolling, navigasi, dan interaksi form (dengan masking PII). Lihat persis apa yang dilakukan pengguna untuk mereproduksi bug. Ukuran bundle: Bertambah ~150 KB. Rekomendasi: Gunakan 1-5% di produksi karena faktor penyimpanan.",
                "javascript_replays_error_sample_rate": "Tingkat Sampel Rekaman yang Dipicu Error",
                "javascript_replays_error_sample_rate_help": "Persentase sesi yang direkam hanya ketika terjadi error . Lebih efisien daripada rekaman sesi penuh - merekam hingga 1 menit sebelum error dan berlanjut hingga sesi berakhir. Sangat baik untuk debugging saat produksi. Ukuran bundle: Bertambah ~150 KB. Rekomendasi: Gunakan 10-25% di produksi.",
                "db_slow_query_threshold_label": "Ambang Batas Query Lambat (milidetik)",
                "db_slow_query_threshold_help": "Query yang memakan waktu lebih lama dari ambang batas ini (dalam milidetik) akan ditandai sebagai lambat dan otomatis dilacak terlepas dari tingkat sampel. Tingkat: Sedang (1-2× ambang), Tinggi (2-5× ambang), Kritis (5×+ ambang). Default: 1000ms (1 detik). Turunkan ke 500ms untuk deteksi yang lebih agresif.",
                "db_n_plus_one_detection_label": "Aktifkan Deteksi N+1 Query",
                "db_n_plus_one_detection_help": "Otomatis mendeteksi masalah query N+1 dengan melacak pola query yang berulang. Query N+1 terjadi ketika kode mengeksekusi query yang sama berkali-kali dalam loop alih-alih menggunakan join atau eager loading yang tepat. Membantu mengidentifikasi bottleneck performa yang signifikan.",
                "db_n_plus_one_threshold_label": "Ambang Batas Deteksi N+1",
                "db_n_plus_one_threshold_help": "Jumlah pengulangan pola query untuk ditandai sebagai potensi masalah N+1. Tingkat sensitivitas: 5-10 (agresif, mungkin ada false positive), 10-20 (seimbang, direkomendasikan), 20+ (konservatif, hanya menandai masalah yang parah). Default: 10.",
                "db_track_bindings_label": "Lacak Nilai Parameter Query",
                "db_track_bindings_help": "Sertakan nilai parameter aktual dalam pelacakan query (misalnya, \"SELECT * FROM users WHERE id = 123\" alih-alih \"SELECT * FROM users WHERE id = ?\"). Manfaat: Lihat nilai eksak yang menyebabkan query lambat dan identifikasi pola data bermasalah. Peringatan Keamanan & Privasi: Dapat mengekspos data pengguna sensitif di Sentry. Kata sandi dan hash (32+ karakter hex) otomatis dimasking. String panjang (100+ karakter) dipotong. Tinjau kebijakan privasi Anda sebelum mengaktifkan. Rekomendasi: Aktifkan hanya di staging/development, nonaktifkan di produksi.",
                "db_query_sample_rate_label": "Tingkat Sampel Query",
                "db_query_sample_rate_help": "Persentase query database yang dilacak dalam pemantauan performa (0-100%). Dampak: 100% (lacak semua, visibilitas maksimal, overhead lebih tinggi), 50% (lacak setengah, seimbang), 10-25% (lacak subset, overhead rendah, masih menangkap masalah), 0% (hanya lacak query lambat, overhead minimal). Catatan: Query lambat (di atas ambang) SELALU dilacak terlepas dari pengaturan ini. Rekomendasi: Gunakan 10-25% pada situs dengan traffic tinggi untuk mengurangi dampak performa dan biaya data Sentry."
            }
        }
    }
}
