{
    "kilowhat-wordpress": {
        "admin": {
            "settings": {
                "section_general_intro": "Pengaturan dasar yang dibutuhkan agar ekstensi dapat berfungsi.",
                "api_key": "API Key Bersama",
                "api_key_reset": "Hasilkan API Key baru",
                "api_key_reset_confirm": "Apakah Anda benar-benar ingin membuat API Key Bersama yang baru? Yang lama akan berhenti berfungsi dan harus diperbarui secara manual di pengaturan plugin WordPress.\n",
                "wordpress_url": "URL WordPress",
                "default_actor": "Pelaksana Default",
                "default_actor_placeholder_invalid": "Kemungkinan value yang tidak valid: {value} - Ketik untuk mencari pengguna...",
                "default_actor_placeholder_search": "Ketik untuk mencari pengguna...",
                "default_actor_help": "Pengguna Flarum ini akan ditugaskan sebagai pelaksana dari semua tindakan penangguhan, penguncian, dan penghapusan. Pengguna ini juga akan digunakan sebagai pemilik diskusi dan post kecuali jika \"Tetapkan penulis diskusi dari SSO\" diaktifkan.\n",
                "report_http_errors": "Kirim error HTTP REST API WordPress ke Flarum reporter yang telah dikonfigurasi",
                "report_http_errors_help": "Apa pun value dari pengaturan ini, request akan selalu dicatat sebagai teks ke logger default. Opsi ini berguna jika Anda ingin error API dikirimkan ke Sentry atau alat pemantauan lainnya sebagai exception dengan stack traces.\n",
                "section_sso_intro": "Fitur ini akan menghubungkan pengguna WordPress dengan Flarum secara mulus. Sebuah akun akan secara otomatis dibuat untuk mereka dan disinkronkan dengan WordPress. Jika Anda memiliki akun yang sudah ada di Flarum, akun tersebut akan secara otomatis dicocokkan dengan email mereka. Jika Anda menghapus pengguna di Flarum, pengguna tersebut akan dibuat lagi saat akun WordPress melakukan login. Untuk memblokir pengguna Flarum, tangguhkan akun di Flarum.\n",
                "enable_sso": "Aktifkan integrasi SSO",
                "login_method": "Mekanisme Login Global",
                "login_method_help": "\"Cookie\" hanya berfungsi jika WordPress dan Flarum berbagi top level domain. \"Pengalihan\" akan menyebabkan pengalihan setelah setiap login dari WordPress meskipun pengguna tidak berniat mengunjungi forum. \"Iframe Tersembunyi\" hanya akan terhubung ketika mengunjungi Flarum, menyebabkan refresh halaman pada loading halaman pertama. Dikombinasikan dengan \"Penundaan Iframe\" di bawah ini, ini dapat digunakan untuk hanya login sesuai permintaan.\n",
                "login_method_options": {
                    "cookie": "Cookie",
                    "redirect": "Pengalihan",
                    "iframe": "Iframe Tersembunyi"
                },
                "cookie_domain": "Domain Cookie",
                "cookie_domain_help": "Pengaturan ini hanya digunakan ketika menggunakan mekanisme login \"Cookie\". Anda hanya perlu mengatur value ini jika kedua situs web berada di subdomain yang berbeda.\n",
                "iframe_redirect_delay": "Penundaan Pengalihan Iframe (milidetik)",
                "iframe_redirect_delay_help": "Pengaturan ini hanya digunakan ketika menggunakan mekanisme login \"Iframe Tersembunyi\". Berapa lama setelah halaman Flarum dimuat, ekstensi masih akan mencoba login dan refresh halaman tanpa interaksi pengguna. Jika diperlukan waktu lebih lama dari nilai ini untuk mendapatkan jawaban dari WordPress, pengguna hanya akan mendapatkan saran untuk login dan refresh. Atur ke nol untuk selalu menyarankan login kepada pengguna alih-alih refresh secara otomatis.\n",
                "wordpress_login_path": "Path login WordPress",
                "wordpress_login_path_help": "Hanya diperlukan jika Anda mengganti nama login endpoint secara manual atau melalui plugin",
                "wordpress_login_full_page": "Buka login WordPress sebagai halaman, bukan popup",
                "wordpress_login_full_page_help": "Secara default, mengklik link login dari Flarum akan membuka halaman login WordPress dalam bentuk popup, seperti metode OAuth lainnya. Ketika pengaturan ini diaktifkan, tab browser saat ini akan menavigasi ke halaman login WordPress dan mengarahkan ke Flarum sesudahnya.\n",
                "username_strategy": "Username untuk pengguna baru",
                "username_strategy_options": {
                    "user_login": "Username dari WordPress",
                    "first_name": "Nama depan dari WordPress",
                    "random": "Username acak"
                },
                "username_strategy_help": "Nomor akan ditambahkan ke username jika sudah ada di Flarum",
                "force_username_choice": "Buat pengguna memilih username mereka pada kunjungan pertama",
                "force_username_choice_help": "Nilai default akan diberikan dengan aturan yang dipilih di atas.",
                "welcome_message": "Pesan pengantar",
                "welcome_message_help": "Pesan ini akan ditampilkan saat pertama kali pengguna mengunjungi forum, bersama dengan pilihan username jika diaktifkan.",
                "wordpress_login_only": "Hanya izinkan login dengan WordPress",
                "wordpress_login_only_help": "Menonaktifkan login Flarum dan langsung membuka jendela modal/halaman login WordPress ketika login diminta. Saat mengubah pengaturan ini, ekstensi akan mencoba mengatur izin \"Daftar\" menjadi \"Tertutup\". Pastikan tetap \"Tertutup\" atau pengunjung akan dapat membuat akun Flarum secara mandiri.\n",
                "user_delete": "Tindakan ketika pengguna dihapus di WordPress",
                "user_delete_options": {
                    "ignore": "Abaikan (pertahankan pengguna Flarum)",
                    "delete": "Hapus pengguna Flarum",
                    "suspend": "Tangguhkan pengguna Flarum tanpa batas waktu (Ekstensi Suspend harus diaktifkan)"
                },
                "user_delete_desc": "Jika Anda memilih \"hapus\", hanya pengguna yang akan dihapus, bukan konten mereka di Flarum.",
                "role_group_sync": "Role untuk Sinkronisasi Grup",
                "role_group_sync_help": "Grup yang dipilih di sini akan secara otomatis ditambahkan ke dan dihapus dari pengguna oleh ekstensi, jadi sebaiknya gunakan grup Flarum khusus yang tidak pernah Anda tetapkan secara manual dan tidak dikelola oleh ekstensi lain. Anda mungkin sebaiknya tidak menetapkan grup admin dengan cara ini, baik untuk alasan keamanan maupun untuk memastikan Anda tidak terkunci secara tidak sengaja. Anda bisa menetapkan beberapa grup ke sebuah role dan sebuah grup bisa dipetakan ke lebih dari satu role. Anda dapat membuat grup Flarum tambahan di halaman <a>Perizinan Flarum</a>.\n",
                "section_comments_intro": "Fitur ini menggantikan komentar WordPress dengan iframe Flarum. Postingan dari tamu tidak lagi dapat dilakukan. Diskusi hanya dibuat untuk post dengan komentar yang diaktifkan di WordPress. Mengaktifkan atau menonaktifkan komentar disinkronkan dengan Flarum's discussion lock. Jika blog Anda sudah berisi postingan ketika Anda mengaktifkan fitur ini, Anda perlu mengaktifkan dan menonaktifkan komentar lagi pada setiap artikel agar diskusi Flarum dapat dibuat.\n",
                "enable_comments": "Aktifkan integrasi komentar",
                "excerpt_html_whitelist": "Daftar putih tag HTML yang akan disimpan di dalam kutipan (dipisahkan dengan koma)",
                "excerpt_html_nodes": "Panjang kutipan konten (dalam jumlah node HTML)",
                "excerpt_length": "Panjang kutipan konten (dalam karakter)",
                "post_thumbnail_summary": "Tampilkan thumbnail postingan WordPress di atas kutipan",
                "post_thumbnail_list": "Tampilkan thumbnail postingan WordPress di daftar diskusi Flarum",
                "comment_author_sync": "Menetapkan penulis diskusi dari SSO",
                "comment_author_sync_help": "Jika penulis Wordpress telah membuat akun Flarum melalui SSO, akun Flarum tersebut akan ditetapkan sebagai pemilik diskusi komentar.",
                "comment_tag": "Tag untuk thread komentar baru",
                "comment_tag_none": "Jangan berikan tag",
                "comment_tag_custom": "Nilai khusus",
                "comment_tag_custom_help": "Daftar ID tag yang dipisahkan dengan koma",
                "summary_as_last_post": "Atur ringkasan postingan sebagai postingan terakhir dari diskusi baru",
                "summary_as_last_post_help": "Hal ini membuat diskusi komentar baru naik ke bagian atas daftar diskusi di Flarum segera setelah postingan WordPress diterbitkan. Secara default, diskusi hanya akan naik ke atas setelah pengguna pertama menulis komentar.\n",
                "use_post_date": "Gunakan tanggal postingan WordPress sebagai tanggal pembuatan diskusi",
                "use_post_date_help": "Secara default, diskusi Flarum akan menggunakan waktu saat ini sebagai tanggal pembuatannya. Opsi ini memungkinkan pembuatan diskusi dengan tanggal lampau jika postingan WordPress juga memiliki tanggal lampau.\n",
                "post_hide": "Tindakan saat postingan WordPress disembunyikan (dibuang atau dipindahkan ke draft)",
                "post_hide_options": {
                    "ignore": "Abaikan (mengunci diskusi sesuai dengan Izinkan Komentar)",
                    "lock": "Kunci diskusi di Flarum",
                    "hide": "Sembunyikan diskusi di Flarum",
                    "delete": "Menghapus secara permanen diskusi dari Flarum"
                },
                "post_delete": "Tindakan saat postingan WordPress dihapus secara permanen",
                "post_delete_options": {
                    "ignore": "Abaikan (pertahankan diskusi Flarum dalam kondisi saat ini)",
                    "lock": "Pertahankan dan kunci diskusi Flarum",
                    "hide": "Sembunyikan diskusi di Flarum",
                    "delete": "Menghapus secara permanen diskusi dari Flarum"
                },
                "wordpress_username": "Username admin WordPress"
            },
            "tabs": {
                "wizard": "Install wizard",
                "general": "Pengaturan Umum",
                "sso": "Integrasi SSO",
                "comments": "Integrasi Komentar",
                "enabled": "Aktif",
                "disabled": "Tidak Aktif"
            },
            "appearance": {
                "edit_css_button": "Mengedit CSS Khusus untuk Sematan WordPress saja"
            },
            "edit_css": {
                "title": "Edit CSS Sematan Khusus",
                "customize_text": "LESS/CSS Anda sendiri untuk diterapkan di atas <a>default styles</a> Flarum di dalam iframe WordPress saja."
            },
            "permissions": {
                "gambits": "Gambit pihak ketiga WordPress (lihat dokumentasi)"
            },
            "save-controls": {
                "validation-errors": "Kami menemukan beberapa kesalahan dalam pengajuan Anda",
                "unsaved-changes": "Anda memiliki perubahan yang belum tersimpan",
                "saved-at": "Disimpan {ago}",
                "no-unsaved-changes": "Semuanya disimpan",
                "save": "Simpan"
            },
            "health": {
                "title": "Pemeriksaan kesehatan",
                "check": "Periksa sekarang",
                "errors": "Kami menemukan beberapa masalah.",
                "healthy": "Semuanya terlihat baik!",
                "not-run": "Pemeriksaan kesehatan akan tersedia setelah Anda menghubungkan WordPress dan Flarum.",
                "request-error": "Kami gagal melakukan pemeriksaan kesehatan."
            },
            "wizard": {
                "intro": "Terima kasih telah membeli ekstensi WordPress premium saya! Isi kredensial Anda di bawah ini untuk menghubungkan Flarum dan WordPress secara otomatis.\n",
                "wordpress_url": "URL WordPress",
                "wordpress_url_help": "Sebuah link ke halaman beranda WordPress Anda",
                "wordpress_username": "Username admin WordPress",
                "wordpress_password": "Password admin WordPress",
                "wordpress_password_help": "Password hanya digunakan untuk konfigurasi awal dan tidak akan disimpan.",
                "install": "Install"
            },
            "role-group-sync": {
                "head": {
                    "role": "Role WordPress",
                    "group": "Grup Flarum"
                },
                "choose": {
                    "role": "Pilih Role WordPress...",
                    "group": "Pilih grup"
                },
                "custom": {
                    "role": "Khusus...",
                    "group": "Khusus..."
                },
                "selected-custom-group": "Khusus",
                "delete": "Hapus aturan",
                "role-loader": {
                    "loading": "Memuat role dari WordPress...",
                    "error": "Ada masalah saat memuat daftar role dari WordPress. Anda masih dapat memasukkan nama role secara manual."
                }
            }
        },
        "forum": {
            "welcome-modal": {
                "title": "Selamat datang!",
                "default_message": "Selamat datang di forum. Pilih username dan Anda siap untuk memulai!",
                "username": "Pilih username",
                "submit": "Aktifkan akun forum",
                "not_now": "Lewati dan baca sebagai tamu untuk saat ini"
            },
            "instant-login": {
                "welcome_known_user": "Selamat datang kembali, {avatar} <strong>{name}</strong>!",
                "welcome_unknown_user": "Selamat datang kembali!",
                "avatar_alt_text": "Avatar WordPress",
                "message": "Anda dapat menggunakan forum dengan akun situs web utama Anda",
                "button": "Login sekarang & refresh"
            },
            "edit-user-modal": {
                "warning": "Pengguna ini akan tetap tersinkronisasi dengan WordPress. Anda harus mengedit email dan password dari WordPress.\n",
                "edit_in_wordpress": "Edit di WordPress",
                "should_not_edit_email": "Anda harus mengedit email di WordPress. <a>Edit</a>",
                "unlink": "Putuskan pengguna ini dari pengguna WordPress",
                "unlink_help": "Jika email tersebut cocok dengan pengguna WordPress, maka email tersebut akan dihubungkan lagi pada saat pengguna tersebut terhubung di WordPress."
            },
            "settings": {
                "edit_on_wordpress": "Ganti email dan password di situs web utama"
            },
            "log_in": {
                "with_wordpress_button": "Login dengan WordPress"
            },
            "summary-post": {
                "head_label": "Post WordPress",
                "blog_link": "Baca di blog",
                "read_more": "Baca selengkapnya"
            },
            "embed": {
                "title": "Komentar"
            },
            "embed-link-modal": {
                "title": "Keluar dari thread komentar",
                "message": "Halaman ini mencoba mengalihkan Anda ke {href}",
                "open": "Buka link"
            },
            "thumbnail_alt_fallback": "Thumbnail postingan WordPress"
        },
        "api": {
            "blocked_actions": {
                "login": "Akun ini terhubung dengan WordPress. Gunakan formulir login situs web utama untuk terhubung.",
                "password_reset": "Akun ini terhubung dengan WordPress. Gunakan formulir masuk situs web utama untuk mereset password Anda.",
                "email_change": "Akun ini terhubung dengan WordPress. Gunakan halaman profil situs web utama untuk mengubah email Anda."
            },
            "health": {
                "suspend-extension-required": "Ekstensi Suspend harus diaktifkan untuk menggunakan opsi \"Tangguhkan\" dari \"Tindakan pada penghapusan pengguna\"",
                "cookie-domain-format": "Domain cookie tampaknya bukan domain yang valid. Periksa apakah itu hanya sebuah domain tanpa protokol atau path",
                "login-only-signup-open": "Anda perlu menonaktifkan Pendaftaran di bawah izin Flarum agar pengaturan \"Hanya izinkan login dengan WordPress\" dapat sepenuhnya diterapkan",
                "role-group-sync-syntax": "Pengaturan sinkronisasi role ke grup memiliki masalah encoding",
                "role-group-sync-incomplete": "Pengaturan sinkronisasi role ke grup tidak terisi penuh",
                "role-group-sync-invalid-group": "ID grup Flarum yang dipilih tidak valid untuk sinkronisasi role ke grup: {id}",
                "role-group-sync-invalid-role": "Role WordPress yang dipilih untuk sinkronisasi role ke grup tidak valid: {role}",
                "lock-extension-required": "Ekstensi Lock harus diaktifkan untuk menggunakan integrasi Komentar",
                "tags-extension-required": "Ekstensi Tag harus diaktifkan untuk menggunakan opsi \"Tag untuk thread komentar baru\"",
                "tag-not-exist": "ID Tag {id} yang dipilih untuk opsi \"ID Tag untuk thread komentar baru\" tidak ada",
                "debug-mode": "Mode debug Flarum diaktifkan. Nonaktifkan setelah Anda selesai melakukan debug",
                "config-url-trailing-slash": "URL Flarum yang didefinisikan di config.php tidak boleh memiliki garis miring (nilai saat ini: \"{url}\")",
                "config-url-https": "URL Flarum yang didefinisikan di config.php haruslah HTTPS (nilai saat ini: \"{url}\")",
                "default-actor-not-set": "Pengaturan \"Pelaksa Default\" harus diisi",
                "default-actor-not-found": "Pengaturan \"Pelaksa Default\" tidak merujuk pada pengguna yang valid",
                "api-key-missing": "\"API Key Flarum\" tidak ada. Coba refresh panel admin dan periksa file log untuk kemungkinan adanya error",
                "wordpress-url-missing": "Pengaturan \"URL WordPress\" harus diisi",
                "wordpress-url-invalid": "Pengaturan \"URL WordPress\" tampaknya bukan merupakan URL yang valid (nilai saat ini: \"{url}\")",
                "wordpress-url-index-php": "Pengaturan \"URL WordPress\" tidak boleh menyertakan \"/index.php\" (nilai saat ini: \"{url}\")",
                "wordpress-url-trailing-slash": "Pengaturan \"URL WordPress\" tidak boleh menyertakan garis miring (nilai saat ini: \"{url}\")",
                "wordpress-url-https": "Pengaturan \"URL WordPress\" haruslah HTTPS (nilai saat ini: \"{url}\")",
                "wordpress-url-mismatch": "Pengaturan \"URL WordPress\" di Flarum tidak sesuai dengan pengaturan \"Alamat WordPress (URL)\" dari WordPress (diharapkan: \"{expected}\", yang sebenarnya: \"{actual}\")",
                "flarum-url-mismatch": "Pengaturan \"URL Flarum\" di WordPress tidak sesuai dengan URL yang dikonfigurasi di Flarum config.php (diharapkan: \"{expected}\", aktual: \"{actual}\")",
                "api-key-mismatch": "Pengaturan \"API Key Bersama\" di WordPress tidak sesuai dengan pengaturan \"API Key Bersama\" di Flarum (diharapkan: \"{expected}\", aktual: \"{actual}\")",
                "user-id-not-found": "Pengaturan \"ID Pengguna Flarum\" di WordPress tidak cocok dengan pengguna Flarum yang diketahui (nilai saat ini: \"{actual}\"). Untuk menggunakan pengguna yang saat ini masuk, Anda dapat menggunakan ID \"{suggested}\"\n",
                "user-id-not-admin": "Pengaturan \"ID Pengguna Flarum\" di WordPress tidak cocok dengan administrator Flarum (nilai saat ini: \"{actual}\"). Untuk menggunakan pengguna yang saat ini masuk, Anda dapat menggunakan ID \"{suggested}\"\n",
                "sso-mismatch-flarum": "Integrasi SSO diaktifkan di Flarum, tetapi tidak di WordPress",
                "sso-mismatch-wordpress": "Integrasi SSO diaktifkan di WordPress, tetapi tidak di Flarum",
                "comments-mismatch-flarum": "Integrasi Komentar diaktifkan di Flarum, tetapi tidak di WordPress",
                "comments-mismatch-wordpress": "Integrasi Komentar diaktifkan di WordPress, tetapi tidak di Flarum",
                "api-error-json": "Mencoba mengakses API WordPress mengakibatkan error: {message} - Body: {body}",
                "api-error-401": "Mencoba mengakses API WordPress menghasilkan error 401. Verifikasi kecocokan \"API Key Bersama\" antara pengaturan Flarum dan WordPress",
                "api-error-other": "Mencoba mengakses API WordPress mengakibatkan error: {message}",
                "wordpress-username-missing": "Pengaturan \"Username admin WordPress\" harus diisi",
                "cookie-domain-mismatch": "Pengaturan \"Domain cookie\" di WordPress tidak sesuai dengan pengaturan \"Domain Cookie\" di Flarum (nilai WordPress adalah \"{wordpress}\", nilai Flarum adalah \"{flarum}\")"
            },
            "wizard": {
                "already_installed": "Flarum sudah terhubung dengan WordPress. Untuk menjalankan wizard lagi, hapus pengaturan \"URL WordPress\" di Flarum dan pengaturan \"API Key Bersama\" Flarum di WordPress.\n",
                "api_unauthorized": "Kami tidak dapat mengautentikasi dengan kredensial yang diberikan. Periksa ulang URL, username, dan password. Periksa dokumentasi untuk mengetahui langkah-langkah pemecahan masalah lebih lanjut.\n",
                "api_error_generic": "Error saat melakukan POST request ke endpoint pengaturan plugin WordPress ({exception}). Pastikan plugin Flarum Integration WordPress telah diinstal dan diaktifkan.\n",
                "invalid_wordpress_url": "Pengaturan \"Alamat WordPress (URL)\" pada WordPress tampaknya bukan merupakan URL yang valid ({actual}).",
                "api_error_get": "Terjadi kesalahan saat melakukan GET request ke pengaturan WordPress ({exception}).",
                "api_error_post": "Terjadi kesalahan saat melakukan POST request ke pengaturan WordPress ({exception}).",
                "plugin_not_installed": "Plugin WordPress tampaknya tidak diinstal atau diaktifkan pada situs WordPress tersebut. Pastikan Anda telah menginstal setidaknya versi 1.2.0.\n"
            },
            "sync_setting_error": "Terjadi error saat melakukan sinkronisasi pengaturan ke WordPress. Periksa secara manual apakah kotak centang di sisi WordPress diatur ke nilai yang sama seperti di Flarum. Error: {exception}.\n"
        },
        "views": {
            "error": {
                "missing_wordpress_embed": "Postingan ini belum memiliki thread komentar. Jika Anda adalah administrator blog, terbitkan postingan, atau nonaktifkan dan aktifkan kembali komentar untuk memulai sebuah thread.\n"
            }
        }
    }
}
