{
    "ordinaryjellyfish-sentra": {
        "admin": {
            "view_documentation": "Lihat Dokumentasi",
            "api_key": "Kunci API",
            "endpoint": "Endpoint",
            "enable": "Aktifkan",
            "permissions": {
                "bypass": ""
            },
            "services": {
                "heading": "Layanan",
                "content_safety": "Azure AI Content Safety",
                "content_safety_help": "Azure AI Content Safety adalah layanan yang mendeteksi potensi konten yang menyinggung atau tidak diinginkan dalam teks dan gambar.",
                "content_safety_settings": {
                    "analyze_images": "Menganalisa Gambar"
                }
            },
            "modules": {
                "heading": "Modul",
                "requires": "Membutuhkan <b>{services}</b>",
                "requires_error": "Aktifkan dan konfigurasikan semua layanan yang diperlukan untuk menggunakan modul ini.",
                "post_shield": "Post Shield",
                "post_shield_help": "Post Shield adalah modul untuk mendeteksi potensi konten yang menyinggung atau tidak diinginkan di dalam postingan. Menganalisis konten postingan secara menyeluruh, termasuk gambar jika diaktifkan di pengaturan Azure AI Content Safety.",
                "post_shield_settings": {
                    "harm_categories": "Kategori Gangguan",
                    "severity_level": "Level Pemicu",
                    "severity_level_low": "Rendah",
                    "severity_level_medium": "Sedang",
                    "severity_level_high": "Tinggi",
                    "severity_level_unknown": "Tidak diketahui"
                }
            }
        },
        "lib": {
            "post_shield": {
                "Hate": "Hate and Fairness",
                "Hate_help": "Konten yang menyerang atau menggunakan bahasa diskriminatif yang mengacu pada seseorang atau kelompok identitas berdasarkan atribut pembeda tertentu dari kelompok-kelompok tersebut.",
                "Sexual": "Sexual",
                "Sexual_help": "Bahasa yang berhubungan dengan organ anatomi dan alat kelamin, hubungan romantis dan tindakan seksual, tindakan yang digambarkan dengan istilah erotis atau penuh kasih sayang, termasuk yang digambarkan sebagai penyerangan atau tindakan kekerasan seksual yang dipaksakan di luar kehendak seseorang.",
                "Violence": "Violence",
                "Violence_help": "Bahasa yang terkait dengan tindakan fisik yang dimaksudkan untuk menyakiti, melukai, merusak, atau membunuh seseorang atau sesuatu; menggambarkan persenjataan, dan entitas terkait.",
                "SelfHarm": "Self-harm",
                "SelfHarm_help": "Bahasa yang berhubungan dengan tindakan fisik yang dimaksudkan untuk secara sengaja menyakiti, melukai, merusak tubuh seseorang atau membunuh."
            }
        },
        "forum": {
            "flag_reason": "Sentra menandai postingan ini karena {reason}",
            "flag_detail": "Postingan memenuhi kriteria {categories} dengan tingkat keparahan masing-masing {severities}"
        }
    }
}
