{
    "acpl-lscache": {
        "admin": {
            "cache_enabled_label": "LSCache'yi etkinleştir",
            "cache_enabled_help": "Önbelleğin nasıl test edileceğine ilişkin <a>Bilgi sayfasına</a> bakın. NOT: Önbelleği devre dışı bırakırken, bu site için önbelleğe alınmış tüm girişler temizlenecektir.",
            "public_cache_ttl_label": "Varsayılan Genel Önbellek TTL",
            "public_cache_ttl_help": "Genel sayfaların saniye cinsinden ne kadar süreyle önbelleğe alınması gerektiğini tanımlayın. Varsayılan değer 604800 saniyedir (bir hafta).",
            "clearing_cache_listener_label": "Flarum Önbelleği Temizlendiğinde LSCache'yi Temizle",
            "serve_stale_label": "Eski İçeriği Sunun",
            "serve_stale_help": "Etkinleştirilirse, yeni bir önbellek kopyası oluşturulana kadar ziyaretçilere önbelleğe alınmış bir sayfanın eski bir sürümü sunulur. Bu, sunucu yükünü azaltır. Devre dışı bırakılırsa sayfa, önbellek güncellemesi sırasında dinamik olarak oluşturulur ve bu da bekleme sürelerini artırabilir. Tasarım gereği, bu seçenek güncel olmayan içerik sunabilir. Bunu kabul edilemez bulursanız lütfen bunu etkinleştirmeyin.",
            "purge_on_discussion_update_label": "Tartışma veya Güncelleme Gönderimindeki URL'leri veya Etiketleri Temizle",
            "purge_on_discussion_update_help": "Bir tartışma veya gönderi güncellendiğinde temizlemek istediğiniz URL'leri veya Etiketleri her satıra bir tane gelecek şekilde girin. URL <code>/</code> ile başlamalıdır, ör. <code>/rankings</code> ve önbellek Etiketi <code>tag=</code> ile başlamalıdır, ör. <code>tag=rankings</code>. Birden fazla rota için, .htaccess'te rotaları etiketleyen bir normal ifade ile bir kural eklemek ve buraya sadece bu etiketi girmek daha hızlıdır. <a>Daha fazla bilgi edinin</a>. Ana sayfa ve güncellenen tartışmalar için önbellek varsayılan olarak temizlenir.",
            "cache_exclude_label": "Dizinleri Önbelleğe Almadan Hariç Tut",
            "cache_exclude_help": "Bu dizeleri içeren yollar önbelleğe alınmaz. <code>/mypath/mypage?aa=bb</code> için <code>mypage?aa=</code> kullanabilirsiniz. Başlangıcı eşleştirmek için başlangıca <code>^</code> ekleyin. Tam eşleşme için URL'nin sonuna <code>$</code> ekleyin. Her satıra bir tane.",
            "drop_qs_label": "Sorgu Dizelerini Bırak",
            "drop_qs_help": "Önbelleğe alırken <code>fbclid</code> veya <code>utm*</code> gibi belirli sorgu dizelerini bırakmak için bu özelliği kullanın. Bu, izleme için kullanılan ancak sayfa içeriğini etkilemeyen UTM kodları gibi \"önemsiz\" sorgu dizelerine sahip sayfaların gereksiz önbelleğe alınmasını önler. Bu, LSWS v5.2.3 veya daha yenisini gerektirir. Her satıra bir tane düşecek sorgu dizelerini listeleyin. <a>Sorgu dizelerini bırakma hakkında daha fazla bilgi edinin</a>.<br></br> \n⚠️ Bu ayar, .htaccess dosyasını değiştirir.\n",
            "purge_all": "Tüm LSCache'i Temizle",
            "purge_all_success": "LiteSpeed Web Sunucusuna tüm LSCache girişlerini temizlemesi bildirildi"
        }
    }
}
