{
    "askvortsov-pwa": {
        "admin": {
            "nav": {
                "pwa_button": "İleri Web Uygulaması",
                "pwa_text": "Flarum'u mobil cihazlara yüklenebilen İleri Web Uygulaması olarak yapılandırın."
            },
            "pwa": {
                "about": {
                    "description_text": "Açıklamayı Yönetim sayfasında yer alan 'Temel Öğeler' sekmesinden ayarlayabilirsniz.",
                    "name_text": "PWA'de kullanılacak daha uzun bir ad girin",
                    "heading": "Hakkında",
                    "short_name_text": "Kısa adı Yönetim sayfasında yer alan 'Temel Öğeler' sekmesinden ayarlayabilirsiniz."
                },
                "colors": {
                    "heading": "Renkler",
                    "background_color_text": "Bu renk PWA uygulamanız açılırken açılış ekranı için arkaplan rengi olakcaktır. Uygulama açıldığında herhangi bir fonksiyonu olmaz.",
                    "theme_color_text": "Bu renk uygulamanızın Görev Yöneticindeki rengini belirler. Bu alanı Yönetim sayfasında yer alan 'Görünüm' sekmesinden ayarlayabilirsiniz."
                },
                "maintenance": {
                    "heading": "",
                    "debug_label": ""
                },
                "heading": "İleri Web Uygulaması Ayarları",
                "text": "Flarum web sitenizi İleri Web Uygulamasına dönüştürün! Bu sitenizi otomatik olarak uygulama mağazasında listelendirmez, kullanıcılar sitenizi ziyaret ettiğinde 'Ana ekrana ekle' hatırlatmasında bulunur.",
                "status_check_heading": "Durum Kontrolü",
                "logo_heading": "Logolar ve Simgeler",
                "logo_text": "You must upload at least one logo for your progressive web app to be installable. Please note that all logos must be square; if they are not, they will be resized and possibly stretched.\nThere are a number of size options available below. I would recommend trying to upload a logo to as many as you can: this supports more devices.\nPlease note that you can upload 1 large logo to inputs for smaller logos. For instance, you can upload a 1000px x 1000px logo to ALL the file inputs below. However, if you try to upload a 50px x 50px logo to the 512x512 input, it will be stretched a lot.\n",
                "logo_size_text": "Upload a logo which will be scaled to {size} pixels by {size} pixels size.",
                "submit_button": "Ayarları Kaydet",
                "refreshed_message": "PWA config refreshed successfully.",
                "enable_label": "Etkinleştir"
            },
            "status": {
                "config_no_https": "Config.php dosyanızdaki bağlantı HTTPS kullanmıyor. Progressive Web Uygulamalarının çalışması için HTTPS gereklidir.",
                "possible_https_disabled": "Your site might not be running on HTTPS. If it is, ignore this. If it isn't keep in mind that HTTPS is required for Progressive Web Apps to work.",
                "no_logo": "You must upload at least one logo for your app to work.",
                "no_name": "You must provide a full name for your app to work.",
                "push_needs_gmp_and_web_push": "Gmp PHP uzantısı ve minishlink/web-push kitaplığı (oluşturucu minishlink/web-push gerektirir) push bildirimlerinin çalışması için etkinleştirilmesi ZORUNLUDUR.",
                "success": "Potansiyel hata mevcut değil!",
                "disabled": "İleri Web Uygulamasını aktifleştirmelisiniz.",
                "manifest_does_not_exist": "The Web Manifest file does not exist. Try saving settings to refresh configuration.",
                "manifest_not_accessible": "The Web Manifest file is not accessible. It should be at https://YOUR_FLARUM_SITE_URL/webmanifest.json. If it not there, please review your web server's configuration. If not, you can ignore this message.",
                "sw_does_not_exist": "The Service Worker file does not exist. Try saving settings to refresh configuration.",
                "sw_not_accessible": "The service worker file is not accessible. It should be at https://YOUR_FLARUM_SITE_URL/sw.js. If it not there, please review your web server's configuration. If not, you can ignore this message."
            }
        },
        "forum": {
            "alerts": {
                "optin": "Tarayıcı bildirimlerini etkinleştirdiniz ancak bu cihaz için ayarlamadınız.",
                "optin_button": "Yapılandır"
            },
            "discussion_controls": {
                "share_button": "Paylaş"
            },
            "post_controls": {
                "share_button": "Paylaş",
                "share_api": {
                    "title": "{username} kullanıcısının {title} tartışmasına yanıtı'"
                }
            },
            "user_controls": {
                "share_button": "Paylaş"
            },
            "settings": {
                "push_header": "Tarayıcı",
                "pwa_notifications": {
                    "access_default": "Tarayıcı kısıtlamaları nedeniyle, bu cihazda push bildirimlerini almayı seçmelisiniz.",
                    "access_default_button": "Kaydol",
                    "access_denied": "Bu cihazda push bildirimlerini almak için tarayıcı ayarlarınızı yapmanız gerekir.",
                    "access_denied_button": "Nasıl Olur",
                    "no_browser_support": "Bu tarayıcı, progresif web uygulamaları için push bildirimlerini desteklemez.",
                    "no_browser_support_button": "Nasıl Olur"
                }
            }
        }
    }
}
