{
    "fof-stopforumspam": {
        "admin": {
            "settings": {
                "introduction": "Yeni kullanıcı kayıtları <a>StopForumSpam</a> veritabanında kontrol edilir. <code>Güven</code> veya <code>sıklık</code> eşiklerine ulaşılırsa, kullanıcının forumunuzda kaydını tamamlaması engellenir.\n\n<code>fof/oauth</code> ve <code>fof/passport</code> aracılığıyla SSO kaydı da desteklenir. Diğer SSO sağlayıcıları da çalışabilir, ancak denenmemiştir.\n",
                "username_label": "Kullanıcı Adı Spam Kontrolü",
                "ip_label": "IP Adresi Spam Kontrolü",
                "email_label": "E-Posta Spam Kontrolü",
                "frequency_label": "Threshold",
                "frequency_help": "Tüm etkin kontroller arasında spam filtresini tetikleyecek spam raporlarının sayısı.\nÖrn: E-postanın 1 raporu ve IP'nin 2 raporu varsa toplamda 3 raporu olacaktır. Eşik 3 veya daha az olarak ayarlanırsa kaydı önleyeceğiz.\n",
                "api_key_label": "API Key",
                "api_key_text": "fof/spamblock uzantısını etkinleştirdiniz, you now have the option to report spammers to StopForumSpam in order to keep the greater forum community spam free.",
                "api_key_instructions_text": "<register>Sign up for StopForumSpam</register>. Then you will need to <key>obtain an API key</key>.",
                "regional_endpoint_label": "Coğrafi Erişim",
                "regional_endpoint_help": "Varsayılan olarak, en hızlı yanıtı sağlamak için aramayı en yakın bölgesel sunucuya yönlendirilir. Trafiği şirket veya ülke gizlilik yönetmeliklerine uygunluk gibi belirli bir bölgeyle kısıtlamak isterseniz, belirli bir bölgeye bağlantı kurmaya zorlayabilirsiniz.",
                "region_closest_label": "En yakın",
                "region_europe_label": "Avrupa",
                "region_us_label": "Birleşik Devletler",
                "confidence_label": "Güven",
                "confidence_help": "Güven puanı, test edilen alanın istenmeyen faaliyetlerle sonuçlanacağının oldukça iyi bir göstergesidir. Güven düzeyinizi yüzde olarak ayarlayın. Alan bu rakama eşit veya üzerindeyse, yukarıdaki 'frekans' testine bakılmaksızın kayıt engellenecektir.",
                "email_hash_label": "Karma e-posta adresini kullan",
                "email_hash_help": "E-posta adresinin kendisini iletmek istemiyorsanız, e-posta adresinin bir MD5 karmasını iletin. Bu yöntem, tüm kara listeleri, normalleştirme ve şaşırtma atlama kontrollerini atlar.",
                "title": "FriendsOfFlarum Stop Forum Spam",
                "frequency_text": "The number of spam reports between all enabled checks that will trip the spam filter.",
                "frequency_example_text": "Ex: If the email has 1 hit, and the ip has 2 hits, there will be 3 hits in total. If the threshold is set to 3 or less it will prevent the registration."
            }
        },
        "forum": {
            "message": {
                "spam": "Bilgileriniz istenmeyen olarak işaretlendi."
            }
        },
        "api": {
            "error": {
                "unknown": "Kullanıcı StopForumSpam sistemine bildirilemedi."
            }
        }
    }
}
