{
    "fof-sentry": {
        "admin": {
            "sentry_settings": "Sentry Ayarları",
            "sections": {
                "general": "Genel Ayarlar",
                "general_help": "Sentry DSN ve ortam ayarlarınızı yapılandırın.",
                "user_context": "Kullanıcı Bağlamı",
                "user_context_help": "Hata raporlarıyla birlikte Sentry'ye hangi kullanıcı bilgilerinin gönderileceğini kontrol edin.",
                "backend_performance": "Arka Uç Performans İzleme",
                "backend_performance_help": "PHP arka uç performansını ve profil oluşturmayı izleyin. Ek yükü kontrol etmek için örnekleme oranlarını ayarlayın.",
                "database_monitoring": "Veritabanı Sorgu İzleme",
                "database_monitoring_help": "Veritabanı sorgu performansını izleyin, yavaş sorguları ve N+1 sorunlarını tespit edin. Yalnızca arka uç performans izleme etkin olduğunda aktiftir.",
                "frontend_monitoring": "Ön Uç (JavaScript) İzleme",
                "frontend_monitoring_help": "JavaScript hatalarını ve ön uç performansını izleyin. Belirli özelliklerin etkinleştirilmesinin paket boyutunu artırdığını unutmayın."
            },
            "settings": {
                "dsn_label": "Sentry DSN",
                "dsn_help": "Sentry Veri Kaynağı Adınız - hem ön uç hem de arka uç hata raporlaması için birincil bağlantı URL'si. Bunu Sentry proje ayarlarınızdan alın. Önemli: Eğer bir Relay DSN kullanıyorsanız, doğrudan Sentry erişimi gerektirdiği için \"Kullanıcı Geri Bildirimi\" özelliğini devre dışı bırakın.",
                "dsn_backend_label": "Sentry DSN (Sadece arka uç)",
                "dsn_backend_help": "Yalnızca arka uç (PHP) hataları için isteğe bağlı ayrı DSN. Arka uç hataları için farklı bir Sentry projesi kullanmak, iyileştirilmiş performans için bir Relay üzerinden yönlendirmek veya ön uç ile arka uç hata takibini ayırmak için kullanışlıdır. Ayarlanmazsa, yukarıdaki birincil DSN her ikisi için de kullanılacaktır.",
                "environment_label": "Sentry Çevresi",
                "environment_help": "Tüm olayları bir ortam adıyla etiketleyin (örneğin, \"production\", \"staging\", \"development\"). Bu, hataları dağıtım ortamına göre filtrelemenize ve her ortam için farklı uyarı kuralları belirlemenize yardımcı olur.",
                "user_feedback_label": "Kullanıcı Geri Bildirim İletişim Kutusunu Etkinleştir",
                "user_feedback_help": "Etkinleştirildiğinde, kullanıcılar bir hatayla karşılaştıktan sonra ne olduğunu açıklayabilecekleri bir geri bildirim formu görürler. Form kullanıcının adı, e-postası (etkinse) ve grup üyeliğiyle önceden doldurulur. Sorun yaşayan kullanıcılarla doğrudan bir iletişim kanalı oluşturur. Doğrudan bir Sentry DSN gerektirir (Relay DSN değil).",
                "send_user_emails_label": "Kullanıcı E-posta Adreslerini Raporlara Dahil Et",
                "send_user_emails_help": "Etkinleştirildiğinde, kullanıcılarla iletişim kurmak ve hataları filtrelemek için tüm Sentry olaylarına kullanıcı e-posta adresleri dahil edilir. Gizlilik uyarısı: Etkinleştirmeden önce gizlilik politikanızı gözden geçirin. Kullanıcı kimliği, kullanıcı adı ve gruplar bu ayardan bağımsız olarak her zaman dahil edilir.",
                "monitor_performance_label": "Arka Uç Performans İzleme Örnekleme Oranı",
                "monitor_performance_help": "İzlenecek arka uç isteklerinin yüzdesi (0 = devre dışı, 100 = tümünü izle). Performans izlemeleri; istek/yanıt süresini, veritabanı sorgularını ve uzantı yükleme sürelerini içerir. Öneri: Üretim ortamında %10-25, hazırlık (staging) ortamında %100 ile başlayın. Düşük değerler veri hacmini ve Sentry maliyetlerini azaltır.",
                "profile_rate_label": "Arka Uç Profil Oluşturma Örnekleme Oranı",
                "profile_rate_help": "Profillenecek izlenen işlemlerin yüzdesi (yukarıdaki izleme oranına göre). Örnek: İzleme %10 ve profil oluşturma %50 ise, tüm isteklerin %5'i profillenir. Profil oluşturma, ayrıntılı işlev düzeyi performans verileri sağlar. Performans etkisi: Profil oluşturma ek yük getirir ve yanıt süresini artırır. <a>Sentry'nin optimizasyon kılavuzuna</a> bakın. {icon} <bold>Excimer uzantısı gerektirir (Yalnızca Linux). Şu anda {icon}.</bold>",
                "javascript_label": "JavaScript Hata Raporlamasını Etkinleştir",
                "javascript_help": "Forumunuzun ön ucundaki JavaScript hatalarını yakalayıp Sentry'ye bildirin. Yakalanmamış istisnaları, reddedilen promise'leri, konsol hatalarını ve ağ hatalarını izler. Yalnızca arka uç hata takibi istiyorsanız bunu devre dışı bırakın.",
                "javascript_console_label": "Konsol Mesajlarını İçerik İzleri Olarak Yakala",
                "javascript_console_help": "console.log, console.info, console.warn ve console.error çağrılarını içerik izi (breadcrumb) olarak kaydedin. Bir hataya yol açan olaylar dizisini görün ve karmaşık kullanıcı etkileşimlerinde hata ayıklayın. Not: Veri hacmini artırır. Üretim ortamında seçici olarak kullanın.",
                "javascript_trace_sample_rate": "Ön Uç Performans İzleme Örnekleme Oranı",
                "javascript_trace_sample_rate_help": "İzlenecek sayfa yüklemelerinin yüzdesi (0 = devre dışı, 100 = tümünü izle). Sayfa yükleme sürelerini, kaynak yüklemelerini, API isteklerini ve navigasyon zamanlamasını izler. Paket boyutu: Yaklaşık 30 KB ekler. Öneri: Üretim ortamında %10-25 kullanın.",
                "javascript_replays_session_sample_rate": "Oturum Yeniden Oynatma Örnekleme Oranı",
                "javascript_replays_session_sample_rate_help": "Başlangıçtan itibaren kaydedilecek kullanıcı oturumlarının yüzdesi. Fare hareketlerini, tıklamaları, kaydırmayı, gezinmeyi ve form etkileşimlerini (PII maskeleme ile) yakalar. Hataları yeniden oluşturmak için kullanıcıların tam olarak ne yaptığını izleyin. Paket boyutu: Yaklaşık 150 KB ekler. Öneri: Depolama maliyetleri nedeniyle üretim ortamında %1-5 kullanın.",
                "javascript_replays_error_sample_rate": "Hata Tetiklemeli Yeniden Oynatma Örnekleme Oranı",
                "javascript_replays_error_sample_rate_help": "Yalnızca bir hata oluştuğunda kaydedilecek oturumların yüzdesi. Tam oturum kayıtlarından daha verimlidir; hatadan önceki 1 dakikaya kadar olan kısmı kaydeder ve oturum sona erene kadar devam eder. Üretim sorunlarını gidermek için mükemmeldir. Paket boyutu: Yaklaşık 150 KB ekler. Öneri: Üretim ortamında %10-25 kullanın.",
                "db_slow_query_threshold_label": "Yavaş Sorgu Eşiği (milisaniye)",
                "db_slow_query_threshold_help": "Bu eşikten (milisaniye cinsinden) daha uzun süren sorgular yavaş olarak işaretlenir ve örnekleme oranından bağımsız olarak otomatik olarak izlenir. Önem seviyeleri: Orta (eşiğin 1-2 katı), Yüksek (eşiğin 2-5 katı), Kritik (eşiğin 5 katından fazla). Varsayılan: 1000ms (1 saniye). Daha agresif tespit için 500ms'ye düşürün.",
                "db_n_plus_one_detection_label": "N+1 Sorgu Tespitini Etkinleştir",
                "db_n_plus_one_detection_help": "Yinelenen sorgu modellerini izleyerek N+1 sorgu sorunlarını otomatik olarak tespit edin. N+1 sorguları, kodun uygun birleşimler veya ön yükleme kullanmak yerine bir döngü içinde aynı sorguyu birden çok kez yürütmesiyle oluşur. Önemli performans dar boğazlarını belirlemeye yardımcı olur.",
                "db_n_plus_one_threshold_label": "N+1 Tespit Eşiği",
                "db_n_plus_one_threshold_help": "Bir sorgu modelinin potansiyel bir N+1 sorunu olarak işaretlenmesi için kaç kez tekrarlanması gerektiği. Hassasiyet seviyeleri: 5-10 (agresif, yanlış pozitifler olabilir), 10-20 (dengeli, önerilen), 20+ (muhafazakar, sadece ciddi sorunları işaretler). Varsayılan: 10.",
                "db_track_bindings_label": "Sorgu Parametre Değerlerini İzle",
                "db_track_bindings_help": "Sorgu takibine gerçek parametre değerlerini dahil edin (örneğin \"SELECT * FROM users WHERE id = ?\" yerine \"SELECT * FROM users WHERE id = 123\"). Faydaları: Yavaş sorgulara neden olan tam değerleri görün ve sorunlu veri modellerini tanımlayın. Güvenlik ve Gizlilik Uyarısı: Sentry'de hassas kullanıcı verilerini açığa çıkarabilir. Parolalar ve karmalar (32+ hex karakter) otomatik olarak maskelenir. Uzun dizeler (100+ karakter) kesilir. Etkinleştirmeden önce gizlilik politikanızı gözden geçirin. Öneri: Yalnızca hazırlık/geliştirme ortamında etkinleştirin, üretim ortamında devre dışı bırakın.",
                "db_query_sample_rate_label": "Sorgu Örnekleme Oranı",
                "db_query_sample_rate_help": "Performans izlemede takip edilecek veritabanı sorgularının yüzdesi (%0-100). Etki seviyeleri: %100 (tüm sorguları izle, maksimum görünürlük, daha yüksek ek yük), %50 (yarısını izle, dengeli), %10-25 (bir kısmını izle, daha düşük ek yük, hala sorunları yakalar), %0 (yalnızca yavaş sorguları izle, minimum ek yük). Not: Yavaş sorgular (eşik üzerindekiler) bu ayardan bağımsız olarak HER ZAMAN izlenir. Öneri: Performans etkisini ve Sentry veri maliyetlerini azaltmak için yoğun trafikli sitelerde %10-25 kullanın."
            }
        }
    }
}
