{
    "first-visit-indexpage": {
        "forum": {
            "title": "Forum Kuralları",
            "alert-message": "Devam etmek için kuralları kabul edin",
            "accept-rules": "Kuralları okudum ve kabul ediyorum",
            "app-title": "Forum Kuralları",
            "warning-title": "Uyarı - Foruma devam etmek için forum kurallarını kabul etmek zorundasınız!",
            "warning-text": "Bu kurallar, burada tüm topluluk üyelerinin çeşitli sorumluluklarını netleştirmek için açıklanmıştır. İşleyişin sorunsuz ilerlemesini ve tüm topluluk üyelerimiz ile ziyaretçilerimiz için eğlenceli ve üretken bir deneyim sağlamasını sağlamak amacıyla herkes tarafından bunlara uyulacaktır.",
            "agree-button": "Kabul Ediyorum",
            "general-rules": "Genel kurallar",
            "general-rules-text": "<p>Diğer üyelere karşı her zaman saygılı olun</p>\n<p>Tüm gönderiler profesyonel ve saygılı olmalıdır. Topluluk üyeleriyle  \naynı fikirde olmama ve bakış açınızı açıklama hakkına sahipsiniz.</p>\n<p>Ancak, onlara veya bu topluluğun kalitesine saldırmakta, onları küçük düşürmekte, \naşağılamakta veya başka bir şekilde küçümsemekte özgür değilsiniz. Bu forumlarda \nhangi unvana veya güce sahip olursanız olun, bu kurala uymanız beklenir.</p>\n",
            "posting-rules": "Gönderi ve Tartışmalar",
            "posting-rules-text": "<p><strong>TANIMLAYICI</strong> olun ve \"genel\" tartışma başlığı kullanmayın.</p>\n<p><strong>LÜTFEN</strong> açıklayıcı bir tartışma başlığı girin! Konuyla ilgili probleminizin kısa bir özetini verin.\n(Dikkat çeken başlıklar kullanmayın, bu başlıklar dikkat çekmezler ve sadece insanları rahatsız ederler).</p>\n<p>İşte  <strong>HATALI</strong> başlıkların harika bir listesi:\nYardım edin, Merhaba, Çok acil, Bir sorum var, bir sorunum var ve benzeri.</p>\n",
            "spam": "İstenmeyen ve tanıtıcı içerik",
            "spam-text": "<p>Forumda istenmeyen ve reklam içerikler yayınlamayın.</p>\n<p>Bu forumlar istenmeyen içerikler; mallar, hizmetler ve/veya diğer web siteleri için istenmeyen reklamlar veya \nçok az veya tamamen alakasız içeriğe sahip gönderiler olarak tanımlar. Sitenize veya ürününüze bağlantılar içeren\nistenmeyen gönderiler göndermeyin veya web sitenizi, işletmenizi veya forumlarınızı vb. tanıtmaya çalışmayın.\nİstenmeyen, çok sayıda farklı kullanıcıya özel mesaj göndermeyi de içerir.</p>\n<p>Web sitenizin bağlantılarına yalnızca profilinizdeki biyografide izin verilir.</p>\n",
            "copyright": "Telif hakkı ve \"rahatsız edici\" gönderiler, bağlantılar veya resimler",
            "copyright-text": "<p>Telif hakkıyla korunan materyallerin yasa dışı olarak nasıl elde edileceğine ilişkin bilgi sağlamak veya bilgi istemek yasaktır.</p>\n<p>Hakaret, taciz veya suistimal teşkil eden herhangi bir materyal kesinlikle yasaktır.\nBu forumlarda cinsel veya başka türlü müstehcen, ırkçı veya aşırı ayrımcı materyallere izin verilmez.\nBuna kullanıcı resimleri de dahildir. Gönderirken sağduyunuzu kullanın.</p>\n",
            "rule-break": "Bir kuralı çiğnersem ne olur?",
            "rule-break-text": "<p>Bir kuralı çiğnerseniz, uyarılırsınız veya yasaklanırsınız.\nKullanıcı hesabınızın yasaklanması geçici veya kalıcı olabilir.\nYöneticiler ve moderatörler ayrıca önceden uyarıda bulunmadan gerekli\ngördükleri herhangi bir ileti dizisini veya gönderiyi düzenleme, silme, taşıma veya kapatma hakkına sahiptir.</p>\n"
        }
    }
}
