{
    "kilowhat-wordpress": {
        "admin": {
            "settings": {
                "section_general_intro": "Uzantının çalışmasını için gereken temel ayarlar.",
                "api_key": "Flarum API Anahtarı",
                "wordpress_url": "WordPress Bağlantısı",
                "wordpress_username": "WordPress Yönetici Kullanıcı Adı",
                "section_sso_intro": "Bu özellik, WordPress kullanıcılarını Flarum ile sorunsuz bir şekilde bağlayacaktır. Onlar için otomatik olarak bir hesap oluşturacak ve WordPress ile senkronize edecektir. Flarum'da mevcut bir hesap varsa e-posta üzerinden otomatik eşleştirir. Flarum'da bir kullanıcıyı silerseniz, WordPress üzerinden oturum açarsa tekrar hesap oluşturur. Bu nedenle hesap silmek yerine askıya almayı deneyebilirsiniz.\n",
                "enable_sso": "SSO Entegrasyonunu Etkinleştir",
                "cookie_domain": "Çerez Alan Adı",
                "cookie_domain_help": "Yalnızca Flarum alan adından farklıysa gereklidir",
                "wordpress_login_path": "WordPress Giriş Yolu",
                "wordpress_login_path_help": "Yalnızca giriş bağlantısını bir eklenti ile yeniden tanımladıysanız gereklidir",
                "username_strategy": "Yeni Kullanıcılar için Kullanıcı Adı",
                "username_strategy_options": {
                    "user_login": "WordPress'den Gelenler için Kullanıcı Adı",
                    "first_name": "WordPress'ten İlk İsim",
                    "random": "Rastgele Kullanıcı Adı"
                },
                "username_strategy_help": "Flarum'da zaten varsa, kullanıcı adına bir sayı eklenecektir",
                "force_username_choice": "Kullanıcıların ilk ziyaretlerinde kullanıcı adlarını seçmelerini sağlayın",
                "force_username_choice_help": "Yukarıda seçilen kuralla varsayılan bir değer sağlanacaktır.",
                "welcome_message": "Tanıtım mesajı",
                "welcome_message_help": "Bu mesaj, kullanıcı forumu ilk ziyaret ettiğinde, etkinleştirilmişse kullanıcı adı seçimiyle birlikte gösterilecektir.",
                "wordpress_login_only": "Yalnızca WordPress ile girişe izin ver",
                "wordpress_login_only_help": "Flarum girişini devre dışı bırakır ve giriş gerektiğinde doğrudan WordPress giriş penceresini açar. Bu, \"Kayıt Olma\" iznini otomatik olarak Kapalı olarak ayarlayacaktır.\n",
                "user_delete": "WordPress'te bir kullanıcı silindiğinde eylem",
                "user_delete_options": {
                    "ignore": "Yoksay (Flarum kullanıcısını koru)",
                    "delete": "Flarum kullanıcısını sil",
                    "suspend": "Flarum kullanıcısını süresiz olarak askıya al (Askıya alma uzantısı etkinleştirilmelidir)"
                },
                "user_delete_desc": "\"Sil\"i seçerseniz, Flarum'daki içeriği değil, yalnızca kullanıcı silinir.",
                "section_comments_intro": "Bu özellik, WordPress yorumlarını bir Flarum iframe ile değiştirir. Ziyaretçiler artık yorum yapamaz. Tartışmalar yalnızca WordPress'te yorumların etkinleştirildiği gönderiler için oluşturulur. Yorumları etkinleştirmek veya devre dışı bırakmak, Flarum'un tartışma kilidi ile senkronize edilir. Bu özelliği etkinleştirdiğinizde blogunuz zaten gönderiler içeriyorsa, Flarum tartışmasının oluşturulabilmesi için her makale için yorumları yeniden etkinleştirmeniz ve devre dışı bırakmanız gerekir.\n",
                "enable_comments": "Yorum entegrasyonunu etkinleştir",
                "excerpt_html_whitelist": "Alıntıda kullanılacak HTML etiketlerinin beyaz listesi (virgülle ayrılmış)",
                "excerpt_html_nodes": "İçerik alıntısının uzunluğu (HTML etiketleri sayısı olarak)",
                "excerpt_length": "İçerik alıntısının uzunluğu (karakter olarak)",
                "comment_tag": "Yeni yorum konuları için etiketleyin",
                "comment_tag_none": "Etiket atama",
                "comment_tag_custom": "Özel değerler",
                "comment_tag_custom_help": "Etiket kimliklerinin virgülle ayrılmış listesi",
                "summary_as_last_post": "Özet gönderisini yeni tartışmaların son gönderisi olarak ayarlayın",
                "summary_as_last_post_help": "Bu, Wordpress gönderisi yayınlanır yayınlanmaz yeni yorum tartışmalarının Flarum'daki tartışma listesinin en üstüne çıkmasını sağlar. Varsayılan olarak, tartışma yalnızca ilk kullanıcı bir yorum yazdığında en üste çıkar.\n",
                "use_post_date": "Tartışma oluşturma tarihi olarak Wordpress gönderi tarihini kullanın",
                "use_post_date_help": "Varsayılan olarak Flarum tartışmaları, oluşturulma tarihi olarak geçerli saati kullanır. Bu seçenek, Wordpress gönderisinin de geçmiş bir tarihi varsa, geçmiş bir tarihle tartışmalar oluşturmaya izin verir.\n",
                "post_hide": "Bir Wordpress gönderisi gizlendiğinde (çöp kutusuna atıldığında veya taslağa taşındığında) eylem",
                "post_hide_options": {
                    "ignore": "Yoksay (tartışmayı Yorumlara İzin Ver'e göre kilitle)",
                    "lock": "Flarum'da tartışmayı kilitle",
                    "hide": "Flarum'da tartışmayı gizle",
                    "delete": "Flarum'da tartışmayı kalıcı olarak sil"
                },
                "post_delete": "Bir Wordpress gönderisi kalıcı olarak silindiğinde eylem",
                "post_delete_options": {
                    "ignore": "Yoksay (Flarum tartışmasını mevcut durumda tut)",
                    "lock": "Flarum tartışmasını tut ve kilitle",
                    "hide": "Flarum'da tartışmayı gizle",
                    "delete": "Flarum'da tartışmayı kalıcı olarak sil"
                }
            },
            "tabs": {
                "wizard": "Kurulum sihirbazı",
                "general": "Genel Ayarlar",
                "sso": "SSO Entegrasyonu",
                "comments": "Yorum Entegrasyonu",
                "enabled": "Etkinleştirildi",
                "disabled": "Etkisizleştirildi"
            },
            "appearance": {
                "edit_css_button": "Yalnızca Wordpress Embed için Özel CSS'yi düzenleyin"
            },
            "edit_css": {
                "title": "Özel Embed CSS'sini Düzenle",
                "customize_text": "Yalnızca Wordpress iframe içinde Flarum'un <a>varsayılan stillerinin</a> üzerine uygulanacak kendi LESS/CSS'niz."
            },
            "permissions": {
                "gambits": "Wordpress Üçüncü-taraf hileleri (belgelere bakın)"
            },
            "save-controls": {
                "validation-errors": "Gönderinizde bazı hatalar bulduk",
                "unsaved-changes": "Kaydedilmeyen değişiklikler var",
                "saved-at": "{ago} kaydedildi",
                "no-unsaved-changes": "Her şey kaydedildi",
                "save": "Kaydet"
            },
            "health": {
                "title": "Sağlık kontrolü",
                "check": "Şimdi kontrol et",
                "errors": "Bazı sorumlar bulduk.",
                "healthy": "Her şey harika görünüyor!",
                "not-run": "Wordpress ve Flarum'u bağladığınızda Sağlık kontrolü kullanılabilir hale gelecektir.",
                "request-error": "Sağlık kontrolünü gerçekleştiremedik."
            },
            "wizard": {
                "intro": "Premium Wordpress uzantımı satın aldığınız için teşekkürler! Flarum ve Wordpress'inizi otomatik olarak birbirine bağlamak için aşağıdaki kimlik bilgilerinizi doldurun.\n",
                "wordpress_url": "Wordpress Bağlantısı",
                "wordpress_url_help": "Wordpress ana sayfanıza bir bağlantı",
                "wordpress_username": "Wordpress yönetici kullanıcı adı",
                "wordpress_password": "Wordpress yönetici şifresi",
                "wordpress_password_help": "Parola yalnızca ilk yapılandırma için kullanılır ve saklanmaz.",
                "install": "Kur"
            }
        },
        "forum": {
            "welcome-modal": {
                "title": "Hoşgeldin!",
                "default_message": "Forum'a hoşgeldin. Bir kullanıcı adı belirle ve kullanmaya başla!",
                "username": "Kullanıcı adı seç",
                "submit": "Forum hesabını etkinleştir",
                "not_now": "Atla ve ziyareti olarak okumaya devam et"
            },
            "edit-user-modal": {
                "warning": "Bu kullanıcı Wordpress ile senkronize tutulur. E-posta ve şifreyi Wordpress'ten düzenlemelisiniz.\n",
                "edit_in_wordpress": "Wordpress'te düzenleyin",
                "should_not_edit_email": "E-postayı Wordpress'te düzenlemelisiniz. <a>Yine de düzenleyin</a>",
                "unlink": "Bu kullanıcının wordpress kullanıcısından bağlantısını kaldırın",
                "unlink_help": "E-posta bir Wordpress kullanıcısıyla eşleşirse, bu kullanıcı Wordpress'e bir sonraki bağlandığında yeniden bağlanır."
            },
            "settings": {
                "edit_on_wordpress": "Ana web sitesinde e-posta ve şifreyi değiştirin"
            },
            "log_in": {
                "with_wordpress_button": "WordPress ile Giriş Yap"
            },
            "summary-post": {
                "head_label": "WordPress Gönderisi",
                "blog_link": "Blog'da oku",
                "read_more": "Devamını oku"
            },
            "embed": {
                "title": "Yorumlar"
            },
            "embed-link-modal": {
                "title": "Yorum dizisinden çık",
                "message": "Sayfa sizi {href} sayfasına yönlendirmeye çalışıyor",
                "open": "Bağlantıyı açın"
            }
        },
        "api": {
            "blocked_actions": {
                "login": "Bu hesap WordPress ile ilişkikendirildi. Bağlanmak için ana siteden giriş yap.",
                "password_reset": "Bu hesap WordPress ile ilişkilendirildi. Şifreyi sıfırlamak için ana siteyi kullan.",
                "email_change": "Bu hesap WordPress ile ilişkilendirildi. Elektronik postanı değiştirmek için ana siteyi kullan."
            },
            "health": {
                "suspend-extension-required": "\"Kullanıcı silme\" işleminde eylemin \"Askıya al\" seçeneğini kullanmak için Askıya alma uzantısı etkinleştirilmelidir",
                "cookie-domain-format": "Çerez etki alanı, geçerli bir etki alanı gibi görünmüyor. Bunun herhangi bir protokol veya yol içermeyen bir etki alanı olduğunu kontrol edin",
                "login-only-signup-open": "\"Yalnızca Wordpress ile oturum açmaya izin ver\" ayarının tam olarak etkili olması için Flarum izinleri altında Kaydolma özelliğini devre dışı bırakmanız gerekir",
                "lock-extension-required": "Yorumlar entegrasyonunu kullanmak için Kilit uzantısı etkinleştirilmelidir",
                "tags-extension-required": "\"Yeni yorum dizileri için etiketle\" seçeneğini kullanmak için Etiketler uzantısı etkinleştirilmelidir",
                "tag-not-exist": "\"Yeni yorum dizileri için etiket kimlikleri\" seçeneği için seçilen etiket kimliği {id} mevcut değil",
                "debug-mode": "Flarum hata ayıklama modu etkinleştirildi. Hata ayıklamayı bitirdikten sonra devre dışı bırakın",
                "config-url-trailing-slash": "config.php içinde tanımlanan Flarum URL'sinin sonunda eğik çizgi olmamalıdır (geçerli değer: \"{url}\")",
                "config-url-https": "config.php içinde tanımlanan Flarum URL'si HTTPS olmalıdır (geçerli değer: \"{url}\")",
                "wordpress-username-missing": "\"Wordpress yönetici kullanıcı adı\" ayarı doldurulmalıdır",
                "api-key-missing": "\"Flarum API Anahtarı\" eksik. Yönetici panelini yenilemeyi deneyin ve olası hatalar için günlük dosyasını kontrol edin",
                "wordpress-url-missing": "\"Wordpress URL\" ayarı doldurulmalıdır",
                "wordpress-url-invalid": "\"Wordpress URL\" ayarı geçerli bir URL gibi görünmüyor (geçerli değer: \"{url}\")",
                "wordpress-url-index-php": "\"Wordpress URL\" ayarı \"/index.php\" içermemelidir (geçerli değer: \"{url}\")",
                "wordpress-url-trailing-slash": "\"Wordpress URL\" ayarı sonunda eğik çizgi içermemelidir (geçerli değer: \"{url}\")",
                "wordpress-url-https": "\"Wordpress URL\" ayarı HTTPS olmalıdır (geçerli değer: \"{url}\")",
                "wordpress-url-mismatch": "Flarum'daki \"Wordpress URL\" ayarı, Wordpress'teki \"WordPress Adresi (URL)\" ayarıyla eşleşmiyor (beklenen: \"{expected}\", gerçek: \"{actual}\")",
                "flarum-url-mismatch": "Wordpress'teki \"Flarum URL\" ayarı, Flarum config.php'de yapılandırılan URL ile eşleşmiyor (beklenen: \"{expected}\", gerçek: \"{actual}\")",
                "api-key-mismatch": "Wordpress'teki \"Flarum API Anahtarı\" ayarı, Flarum'daki \"Flarum API Anahtarı\" ayarıyla eşleşmiyor (beklenen: \"{expected}\", gerçek: \"{actual}\")",
                "user-id-not-found": "Wordpress'teki \"Flarum Kullanıcı Kimliği\" ayarı, bilinen herhangi bir Flarum kullanıcısıyla eşleşmiyor (geçerli değer: \"{actual}\"). Şu anda oturum açmış olan kullanıcıyı kullanmak için \"{suggested}\" kimliğini kullanabilirsiniz.\n",
                "user-id-not-admin": "Wordpress'teki \"Flarum Kullanıcı Kimliği\" ayarı bir Flarum yöneticisiyle eşleşmiyor (geçerli değer: \"{actual}\"). Şu anda oturum açmış olan kullanıcıyı kullanmak için \"{suggested}\" kimliğini kullanabilirsiniz.\n",
                "sso-mismatch-flarum": "SSO entegrasyonu Flarum'da etkinleştirildi, ancak Wordpress'te değil",
                "sso-mismatch-wordpress": "SSO entegrasyonu Wordpress'te etkinleştirildi, ancak Flarum'da değil",
                "cookie-domain-mismatch": "Wordpress'teki \"Çerez alanı\" ayarı, Flarum'daki \"Çerez Alanı\" ayarıyla eşleşmiyor (Wordpress değeri \"{wordpress}\", Flarum değeri \"{flarum}\")",
                "comments-mismatch-flarum": "Yorumlar entegrasyonu Flarum'da etkin, ancak Wordpress'te değil",
                "comments-mismatch-wordpress": "Yorumlar entegrasyonu Wordpress'te etkin, ancak Flarum'da değil",
                "api-error-json": "Wordpress API'sine erişmeye çalışmak bir hatayla sonuçlandı: {message} - Body: {body}",
                "api-error-401": "Wordpress API'sine erişmeye çalışmak 401 hatasıyla sonuçlandı. Flarum'daki \"Wordpress admin kullanıcı adını\" ve Wordpress'teki \"Flarum API Anahtarını\" iki kez kontrol edin",
                "api-error-other": "Wordpress API'sine erişmeye çalışmak bir hatayla sonuçlandı: {message}"
            },
            "wizard": {
                "already_installed": "Flarum zaten WordPress'e bağlı. Sihirbazı tekrar çalıştırın, Flarum'daki \"WordPress Bağlantısını\" ve WordPress'teki \"Flarum API Anahtarını\" silin.\n",
                "api_unauthorized": "Verilen kimlik bilgileriyle kimlik doğrulaması yapamadık. URL'yi, kullanıcı adını ve şifreyi iki kez kontrol edin. Daha fazla sorun giderme adımı için belgelere bakın.\n",
                "api_error_get": "Wordpress ayarlarına ({exception}) bir GET isteği gerçekleştirirken hata oluştu.",
                "api_error_post": "Wordpress ayarlarına POST isteği yapılırken hata oluştu ({exception}).",
                "invalid_wordpress_url": "Wordpress'teki \"WordPress Adresi (URL)\" ayarı geçerli bir URL ({actual}) gibi görünmüyor.",
                "plugin_not_installed": "Wordpress eklentisi, o Wordpress sitesinde yüklü veya etkin görünmüyor. En az 1.2.0 sürümünün kurulu olduğundan emin olun.\n"
            }
        },
        "views": {
            "error": {
                "missing_wordpress_embed": "Bu yayının henüz bir yorum dizisi yok. Blog yöneticisiyseniz, gönderiyi yayınlayın veya bir ileti dizisi başlatmak için yorumları devre dışı bırakıp yeniden etkinleştirin.\n"
            }
        }
    }
}
