{
    "acpl-lscache": {
        "admin": {
            "cache_enabled_label": "Enable LSCache",
            "cache_enabled_help": "Check out the <a>Information page</a> on how to test the cache. NOTE: When disabling the cache, all cached entries for this site will be purged.",
            "public_cache_ttl_label": "Default Public Cache TTL",
            "public_cache_ttl_help": "Define how long, in seconds, public pages should be cached. The default value is 604800 seconds (one week).",
            "clearing_cache_listener_label": "Purge LSCache When Flarum Cache is Cleared",
            "serve_stale_label": "Serve Stale Content",
            "serve_stale_help": "If enabled, an outdated version of a cached page will be served to visitors until a fresh cache copy is generated. This reduces server load. If disabled, the page will be dynamically generated during the cache update, which may increase wait times. By design, this option can serve out-of-date content. Please do not enable this if you find that unacceptable.",
            "purge_on_discussion_update_label": "Purge URLs or cache Tags on Discussion Update",
            "purge_on_discussion_update_help": "Enter the URLs or cache Tags you want to purge when a discussion is updated, one per line. URL should start with <code>/</code>, e.g. <code>/rankings</code>, and cache Tag should start with <code>tag=</code>, e.g. <code>tag=rankings</code>. For multiple routes, adding a rule in .htaccess with a regular expression that tags routes and entering only this tag here is faster. <a>Learn more</a>. By default, the cache for the homepage and updated discussions is purged.",
            "cache_exclude_label": "Exclude Paths from Caching",
            "cache_exclude_help": "Paths containing these strings will not be cached. For <code>/mypath/mypage?aa=bb</code>, you can use <code>mypage?aa=</code>. To match the beginning, add <code>^</code> at the start. For an exact match, add <code>$</code> at the end of the URL. One per line.",
            "drop_qs_label": "Drop Query Strings",
            "drop_qs_help": "Use this feature to drop specific query strings, like <code>fbclid</code> or <code>utm*</code>, when caching. This prevents redundant caching of pages with \"junk\" query strings such as UTM codes, which are used for tracking but don't affect page content. This requires LSWS v5.2.3 or newer. List the query strings to drop, one per line. <a>Learn more about dropping query strings</a>.<br></br>\n⚠️ This setting will modify the .htaccess file.\n",
            "status_codes_cache_label": "Default HTTP Status Code Page TTL",
            "status_codes_cache_help": "Specify an HTTP status code and the number of seconds to cache that page, separated by a space. One per line.",
            "purge_all": "Purge All LSCache",
            "purge_all_success": "LiteSpeed Web Server has been notified to purge all LSCache entries"
        }
    }
}
