{
    "fof-sentry": {
        "admin": {
            "sentry_settings": "Sentry Settings",
            "sections": {
                "general": "General Settings",
                "general_help": "Configure your Sentry DSN and environment settings.",
                "user_context": "User Context",
                "user_context_help": "Control what user information is sent to Sentry with error reports.",
                "backend_performance": "Backend Performance Monitoring",
                "backend_performance_help": "Track PHP backend performance and profiling. Set sample rates to control overhead.",
                "database_monitoring": "Database Query Monitoring",
                "database_monitoring_help": "Monitor database query performance, detect slow queries and N+1 issues. Only active when backend performance monitoring is enabled.",
                "frontend_monitoring": "Frontend (JavaScript) Monitoring",
                "frontend_monitoring_help": "Track JavaScript errors and frontend performance. Note that enabling certain features increases bundle size."
            },
            "settings": {
                "dsn_label": "Sentry DSN",
                "dsn_help": "Your Sentry Data Source Name - the primary connection URL for both frontend and backend error reporting. Get this from your Sentry project settings. Important: If using a Relay DSN, disable \"User Feedback\" as it requires direct Sentry access.",
                "dsn_backend_label": "Sentry DSN (Backend Only)",
                "dsn_backend_help": "Optional separate DSN exclusively for backend (PHP) errors. Useful for using a different Sentry project for backend errors, routing through a Relay for improved performance, or separating frontend and backend error tracking. If not set, the primary DSN above will be used for both.",
                "environment_label": "Sentry Environment",
                "environment_help": "Tag all events with an environment name (e.g., \"production\", \"staging\", \"development\"). This helps you filter errors by deployment environment and set different alert rules per environment.",
                "user_feedback_label": "Enable User Feedback Dialog",
                "user_feedback_help": "When enabled, users see a feedback form after encountering an error, allowing them to describe what happened. The form pre-fills with their username, email (if enabled), and group membership. Creates a direct communication channel with users experiencing issues. Requires a direct Sentry DSN (not a Relay DSN).",
                "send_user_emails_label": "Include User Email Addresses in Reports",
                "send_user_emails_help": "When enabled, user email addresses are included in all Sentry events for contacting users and filtering errors. Privacy consideration: Review your privacy policy before enabling. User ID, username, and groups are always included regardless of this setting.",
                "monitor_performance_label": "Backend Performance Monitoring Sample Rate",
                "monitor_performance_help": "Percentage of backend requests to trace (0 = disabled, 100 = trace all). Performance traces include request/response time, database queries, and extension loading times. Recommendation: Start with 10-25% in production, 100% in staging. Lower values reduce data volume and Sentry costs.",
                "profile_rate_label": "Backend Profiling Sample Rate",
                "profile_rate_help": "Percentage of traced transactions to profile (relative to monitoring rate above). Example: If monitoring = 10% and profiling = 50%, then 5% of all requests are profiled. Profiling provides detailed function-level performance data. Performance impact: Profiling adds overhead and increases response time. See <a>Sentry's optimization guide</a>. {icon} <bold>Requires Excimer extension (Linux only). Currently {icon}.</bold>",
                "javascript_label": "Enable JavaScript Error Reporting",
                "javascript_help": "Capture and report JavaScript errors from your forum's frontend to Sentry. Tracks uncaught exceptions, promise rejections, console errors, and network failures. Disable this if you only want backend error tracking.",
                "javascript_console_label": "Capture Console Messages as Breadcrumbs",
                "javascript_console_help": "Record console.log, console.info, console.warn, and console.error calls as breadcrumbs. See the sequence of events leading to an error and debug complex user interactions. Note: Increases data volume. Use selectively in production.",
                "javascript_trace_sample_rate": "Frontend Performance Monitoring Sample Rate",
                "javascript_trace_sample_rate_help": "Percentage of page loads to trace (0 = disabled, 100 = trace all). Tracks page load times, resource loading, API requests, and navigation timing. Bundle size: Adds ~30 KB. Recommendation: Use 10-25% in production.",
                "javascript_replays_session_sample_rate": "Session Replay Sample Rate",
                "javascript_replays_session_sample_rate_help": "Percentage of user sessions to record from the beginning. Captures mouse movements, clicks, scrolling, navigation, and form interactions (with PII masking). Watch exactly what users did to reproduce bugs. Bundle size: Adds ~150 KB. Recommendation: Use 1-5% in production due to storage costs.",
                "javascript_replays_error_sample_rate": "Error-Triggered Replay Sample Rate",
                "javascript_replays_error_sample_rate_help": "Percentage of sessions to record only when an error occurs. More efficient than full session replays - records up to 1 minute before the error and continues until session ends. Perfect for debugging production issues. Bundle size: Adds ~150 KB. Recommendation: Use 10-25% in production.",
                "db_slow_query_threshold_label": "Slow Query Threshold (milliseconds)",
                "db_slow_query_threshold_help": "Queries taking longer than this threshold (in milliseconds) are flagged as slow and automatically tracked regardless of sample rate. Severity levels: Medium (1-2× threshold), High (2-5× threshold), Critical (5×+ threshold). Default: 1000ms (1 second). Lower to 500ms for more aggressive detection.",
                "db_n_plus_one_detection_label": "Enable N+1 Query Detection",
                "db_n_plus_one_detection_help": "Automatically detect N+1 query problems by tracking repeated query patterns. N+1 queries occur when code executes the same query multiple times in a loop instead of using proper joins or eager loading. Helps identify significant performance bottlenecks.",
                "db_n_plus_one_threshold_label": "N+1 Detection Threshold",
                "db_n_plus_one_threshold_help": "Number of times a query pattern must repeat to be flagged as a potential N+1 issue. Sensitivity levels: 5-10 (aggressive, may have false positives), 10-20 (balanced, recommended), 20+ (conservative, only flags severe issues). Default: 10.",
                "db_track_bindings_label": "Track Query Parameter Values",
                "db_track_bindings_help": "Include actual parameter values in query tracking (e.g., \"SELECT * FROM users WHERE id = 123\" instead of \"SELECT * FROM users WHERE id = ?\"). Benefits: See exact values causing slow queries and identify problematic data patterns. Security & Privacy Warning: May expose sensitive user data in Sentry. Passwords and hashes (32+ hex chars) are automatically masked. Long strings (100+ chars) are truncated. Review your privacy policy before enabling. Recommendation: Enable only in staging/development, disable in production.",
                "db_query_sample_rate_label": "Query Sampling Rate",
                "db_query_sample_rate_help": "Percentage of database queries to track in performance monitoring (0-100%). Impact levels: 100% (track all queries, maximum visibility, higher overhead), 50% (track half, balanced), 10-25% (track subset, lower overhead, still catches issues), 0% (track only slow queries, minimum overhead). Note: Slow queries (above threshold) are ALWAYS tracked regardless of this setting. Recommendation: Use 10-25% on high-traffic sites to reduce performance impact and Sentry data costs."
            }
        }
    }
}
