{
    "first-visit-indexpage": {
        "forum": {
            "title": "Forum Rules...",
            "warning-title": "Warning - You must accept these rules to continue to the forum!.",
            "warning-text": "These rules are disclosed to clarify the various responsibilities of all community members here. They shall be adhered to by everyone to ensure that our board runs smoothly and provides a fun and productive experience for all of our community members and visitors.",
            "agree-button": "I Agree...",
            "general-rules": "General rules",
            "general-rules-text": "<p>Remain respectful of other members at all times</p>\n<p>All posts should be professional and courteous. You have every right to disagree with your\nfellow community members and explain your perspective.</p>\n<p>However, you are not free to attack, degrade, insult, or otherwise belittle them or the\nquality of this community. It does not matter what title or power you hold in these forums,\nyou are expected to obey this rule.</p>\n",
            "posting-rules": "Post and Discussions",
            "posting-rules-text": "<p>Be <strong>DESCRIPTIVE</strong> and Don’t use “generic” topic names.</p>\n<p><strong>PLEASE</strong> post a descriptive topic name! Give a short summary of your problem in the subject.\n(Don’t use attention getting subjects, they don’t get attention and only annoy people).</p>\n<p>Here’s a great list of topic subjects <strong>YOU SHOULD NOT POST</strong> :\nHelp me,  Hello,  Very urgent, I have a question, I have a problem, and similar.</p>\n",
            "spam": "Spam and self promotional content",
            "spam-text": "<p>No Spam / Advertising / Self-promote in the forums.</p>\n<p>These forums define spam as unsolicited advertisement for goods, services and/or other\nweb sites, or posts with little, or completely unrelated content. Do not spam the forums with\nlinks to your site or product, or try to self-promote your website, business or forums etc.\nSpamming also includes sending private messages to a large number of different users.</p>\n<p>Links to your website is allowed only in profile bio.</p>\n",
            "copyright": "Copyright & “offensive” posts, links or images",
            "copyright-text": "<p>Providing or asking for information on how to illegally obtain copyrighted materials is forbidden.</p>\n<p>Any material which constitutes defamation, harassment, or abuse is strictly prohibited.\nMaterial that is sexually or otherwise obscene, racist, or otherwise overly discriminatory\nis not permitted on these forums. This includes user pictures. Use common sense while posting.</p>\n",
            "rule-break": "What happens if I break a rule?",
            "rule-break-text": "<p>If you break a rule, then you will either be warned or banned. A ban of your user account may\neither be temporary or permanent. The administrators and moderators also have the right to edit, delete,\nmove or close any thread or post as they see necessary, without prior warning.</p>\n"
        }
    }
}
