{
    "kilowhat-wordpress": {
        "admin": {
            "settings": {
                "section_general_intro": "The base settings required for the extension to work.",
                "api_key": "Shared API Key",
                "api_key_reset": "Generate new API Key",
                "api_key_reset_confirm": "Do you really want to generate a new Shared API Key? The old one will stop working and will have to be manually updated in the WordPress plugin settings.\n",
                "wordpress_url": "WordPress URL",
                "default_actor": "Default Actor",
                "default_actor_placeholder_invalid": "Possible invalid value: {value} - Type to search for a user...",
                "default_actor_placeholder_search": "Type to search for a user...",
                "default_actor_help": "This Flarum user will be assigned as the actor of all suspend, lock, delete actions. It will also be used as the owner of discussions and posts unless \"Assign discussion author from SSO\" is enabled.\n",
                "report_http_errors": "Send WordPress REST API HTTP errors to configured Flarum reporters",
                "report_http_errors_help": "No matter the value of this setting, requests as always logged as text to the default logger. This option is useful if you want API errors to be sent to Sentry or other monitoring tools as exceptions with stack traces.\n",
                "section_sso_intro": "This feature will seamlessly connects WordPress users with Flarum. An account will automatically be created for them and kept in sync with WordPress. If you have existing accounts in Flarum, they will automatically be matched by their email. If you delete a user in Flarum, it will be created again next time the WordPress account logins. To block a Flarum user, suspend the account in Flarum.\n",
                "enable_sso": "Enable SSO integration",
                "login_method": "Global Login Mechanism",
                "login_method_help": "\"Cookie\" only works if WordPress and Flarum share a top level domain. \"Redirect\" will cause a redirect after every login from WordPress even if the user doesn't intend to visit the forum. \"Hidden Iframe\" will only connect when visiting Flarum, causing a page refresh on the first page load. Combined with the \"Iframe delay\" below this can be used to only login on demand.\n",
                "login_method_options": {
                    "cookie": "Cookie",
                    "redirect": "Redirect",
                    "iframe": "Hidden Iframe"
                },
                "cookie_domain": "Cookie Domain",
                "cookie_domain_help": "This setting is only used when using \"Cookie\" login mechanism. You only need to set this value if both websites are on different subdomains.\n",
                "iframe_redirect_delay": "Iframe Redirect Delay (milliseconds)",
                "iframe_redirect_delay_help": "This setting is only used when using \"Hidden Iframe\" login mechanism. How long after the initial Flarum page load the extension will still attempt a login and page refresh without user interaction. If it takes longer than this value to get an answer from WordPress, the user will simply get a suggestion to login and refresh. Set to zero to always suggest login to the user instead of automatically refreshing.\n",
                "wordpress_login_path": "WordPress login path",
                "wordpress_login_path_help": "Only necessary if you renamed your login endpoint manually or via a plugin",
                "wordpress_login_full_page": "Open WordPress login as a page instead of popup",
                "wordpress_login_full_page_help": "By default, clicking the login link from Flarum will open the WordPress login page in a popup, like other OAuth methods. When this setting is enabled, the current browser tab will navigate to the WordPress login page and redirect to Flarum afterward.\n",
                "username_strategy": "Username for new users",
                "username_strategy_options": {
                    "user_login": "Username from WordPress",
                    "first_name": "First name from WordPress",
                    "random": "Random username"
                },
                "username_strategy_help": "A number will be appended to the username if it already exists in Flarum",
                "force_username_choice": "Make users choose their username on first visit",
                "force_username_choice_help": "A default value will be provided with the rule chosen above.",
                "welcome_message": "Introduction message",
                "welcome_message_help": "This message will be shown the first time the user visits the forum, together with the username choice if enabled.",
                "wordpress_login_only": "Only allow WordPress login",
                "wordpress_login_only_help": "Disables Flarum login and directly opens WordPress login modal/page when login is requested. When changing this setting, the extension will attempt to set \"Sign Up\" permission to \"Closed\". Make sure it remains \"Closed\" or visitors will be able to create standalone Flarum accounts.\n",
                "user_delete": "Action when a user is deleted in WordPress",
                "user_delete_options": {
                    "ignore": "Ignore (keep Flarum user)",
                    "delete": "Delete Flarum user",
                    "suspend": "Suspend Flarum user indefinitely (Suspend extension must be enabled)"
                },
                "user_delete_desc": "If you select \"delete\", only the user will be deleted, not their content on Flarum.",
                "role_group_sync": "Role to Group Synchronisation",
                "role_group_sync_help": "The groups selected here will be automatically added to and removed from users by the extension, so it's probably best to use dedicated Flarum groups that you never assign manually and aren't also managed by other extensions. You probably shouldn't assign the admin group this way, both for security reasons and to make sure you don't get accidentally locked out. You can assign multiple groups to a role and a group can be mapped to more than one role. You can create additional Flarum groups on the Flarum <a>Permissions page</a>.\n",
                "section_comments_intro": "This feature replaces WordPress comments with a Flarum iframe. Guest posting is no longer possible. Discussions are only created for posts with comments enabled in WordPress. Enabling or disabling comments is synced with Flarum's discussion lock. If your blog already contains posts when you enable this feature, you need to enable and disable comments again on each article for the Flarum discussion to be created.\n",
                "enable_comments": "Enable comments integration",
                "excerpt_html_whitelist": "Whitelist of HTML tags to keep in the excerpt (comma separated)",
                "excerpt_html_nodes": "Length of the content excerpt (in number of HTML nodes)",
                "excerpt_length": "Length of the content excerpt (in characters)",
                "post_thumbnail_summary": "Show WordPress post thumbnail above excerpt",
                "post_thumbnail_list": "Show WordPress post thumbnail in Flarum discussion list",
                "comment_author_sync": "Assign discussion author from SSO",
                "comment_author_sync_help": "If the Wordpress author has created a Flarum account through SSO, that Flarum account will be set as the comment discussion owner.",
                "comment_tag": "Tag for new comment threads",
                "comment_tag_none": "Do not assign a tag",
                "comment_tag_custom": "Custom values",
                "comment_tag_custom_help": "Comma-separated list of tag IDs",
                "summary_as_last_post": "Set the summary post as the last post of new discussions",
                "summary_as_last_post_help": "This makes new comment discussions rise to the top of the discussion list in Flarum as soon as the WordPress post is published. By default the discussion would only rise to the top once a first user wrote a comment.\n",
                "use_post_date": "Use WordPress post date as the discussion creation date",
                "use_post_date_help": "By default Flarum discussions will use the current time as their creation date. This option allows creating discussions with a past date if the WordPress post also has a past date.\n",
                "post_hide": "Action when a WordPress post is hidden (trashed or moved to draft)",
                "post_hide_options": {
                    "ignore": "Ignore (lock discussion according to Allow Comments)",
                    "lock": "Lock discussion in Flarum",
                    "hide": "Hide discussion in Flarum",
                    "delete": "Permanently delete discussion from Flarum"
                },
                "post_delete": "Action when a WordPress post is deleted permanently",
                "post_delete_options": {
                    "ignore": "Ignore (keep Flarum discussion in current state)",
                    "lock": "Keep Flarum discussion and lock",
                    "hide": "Hide discussion in Flarum",
                    "delete": "Permanently delete discussion from Flarum"
                }
            },
            "tabs": {
                "wizard": "Install wizard",
                "general": "General Settings",
                "sso": "SSO Integration",
                "comments": "Comments Integration",
                "enabled": "Enabled",
                "disabled": "Disabled"
            },
            "appearance": {
                "edit_css_button": "Edit Custom CSS for WordPress Embed only"
            },
            "edit_css": {
                "title": "Edit Custom Embed CSS",
                "customize_text": "Your own LESS/CSS to be applied on top of Flarum's <a>default styles</a> inside the WordPress iframe only."
            },
            "permissions": {
                "gambits": "WordPress Third-party gambits (see documentation)"
            },
            "save-controls": {
                "validation-errors": "We found some errors in your submission",
                "unsaved-changes": "You have unsaved changes",
                "saved-at": "Saved {ago}",
                "no-unsaved-changes": "Everything is saved",
                "save": "Save"
            },
            "health": {
                "title": "Health check",
                "check": "Check now",
                "errors": "We found some issues.",
                "healthy": "Everything is looking good!",
                "not-run": "The Health check will become available once you connect WordPress and Flarum.",
                "request-error": "We failed to perform the Health check."
            },
            "wizard": {
                "intro": "Thanks for purchasing my premium WordPress extension! Fill in your credentials below to automatically connect your Flarum and WordPress together.\n",
                "wordpress_url": "WordPress URL",
                "wordpress_url_help": "A link to your WordPress homepage",
                "wordpress_username": "WordPress admin username",
                "wordpress_password": "WordPress admin password",
                "wordpress_password_help": "The password is only used for the initial configuration and is not stored.",
                "install": "Install"
            },
            "role-group-sync": {
                "head": {
                    "role": "WordPress Role",
                    "group": "Flarum Group"
                },
                "choose": {
                    "role": "Choose WordPress Role...",
                    "group": "Select a group"
                },
                "custom": {
                    "role": "Custom...",
                    "group": "Custom..."
                },
                "selected-custom-group": "Custom",
                "delete": "Delete rule",
                "role-loader": {
                    "loading": "Loading roles from WordPress...",
                    "error": "There was an issue loading the list of roles from WordPress. You can still manually enter role names."
                }
            }
        },
        "forum": {
            "welcome-modal": {
                "title": "Welcome!",
                "default_message": "Welcome to the forum. Pick a username and you are ready to go!",
                "username": "Choose a username",
                "submit": "Enable forum account",
                "not_now": "Skip and read as guest for now"
            },
            "instant-login": {
                "welcome_known_user": "Welcome back, {avatar} <strong>{name}</strong>!",
                "welcome_unknown_user": "Welcome back!",
                "avatar_alt_text": "WordPress Avatar",
                "message": "You can use the forum with your main website account",
                "button": "Login now & refresh"
            },
            "edit-user-modal": {
                "warning": "This user is kept in sync with WordPress. You should edit the email and password from WordPress.\n",
                "edit_in_wordpress": "Edit in WordPress",
                "should_not_edit_email": "You should edit the email in WordPress. <a>Edit anyway</a>",
                "unlink": "Unlink this user from the wordpress user",
                "unlink_help": "If the email matches a WordPress user, it will be linked again next time that user connects in WordPress."
            },
            "settings": {
                "edit_on_wordpress": "Change email and password on main website"
            },
            "log_in": {
                "with_wordpress_button": "Log In with WordPress"
            },
            "summary-post": {
                "head_label": "WordPress Post",
                "blog_link": "Read on blog",
                "read_more": "Read more"
            },
            "embed": {
                "title": "Comments"
            },
            "embed-link-modal": {
                "title": "Exit comment thread",
                "message": "The page is trying to redirect you to {href}",
                "open": "Open link"
            },
            "thumbnail_alt_fallback": "WordPress post thumbnail"
        },
        "api": {
            "blocked_actions": {
                "login": "This account is linked with WordPress. Use the main website login form to connect.",
                "password_reset": "This account is linked with WordPress. Use the main website login form to reset your password.",
                "email_change": "This account is linked with WordPress. Use the main website profile page to change your email."
            },
            "health": {
                "suspend-extension-required": "The Suspend extension must be enabled to use the \"Suspend\" option of \"Action on user delete\"",
                "cookie-domain-format": "The cookie domain does not appear to be a valid domain. Check that it\\'s just a domain without any protocol or path",
                "login-only-signup-open": "You need to disable Sign Up under Flarum permissions for the \"Only allow WordPress login\" setting to fully take effect",
                "role-group-sync-syntax": "Role to group sync settings have an encoding issue",
                "role-group-sync-incomplete": "Role to group sync settings are not completely filled",
                "role-group-sync-invalid-group": "Invalid Flarum group ID selected for role to group sync: {id}",
                "role-group-sync-invalid-role": "Invalid WordPress role selected for role to group sync: {role}",
                "lock-extension-required": "The Lock extension must be enabled to use the Comments integration",
                "tags-extension-required": "The Tags extension must be enabled to use the \"Tag for new comment threads\" option",
                "tag-not-exist": "Tag ID {id} selected for the \"Tag IDs for new comment threads\" option does not exist",
                "debug-mode": "Flarum debug mode is enabled. Disable it once you are finished debugging",
                "config-url-trailing-slash": "The Flarum URL defined in config.php should not have a trailing slash (current value: \"{url}\")",
                "config-url-https": "The Flarum URL defined in config.php should be HTTPS (current value: \"{url}\")",
                "default-actor-not-set": "The \"Default Actor\" setting must be filled",
                "default-actor-not-found": "The \"Default Actor\" setting is not referencing a valid user",
                "api-key-missing": "The \"Flarum API Key\" is missing. Try refreshing the admin panel and check the log file for possible errors",
                "wordpress-url-missing": "The \"WordPress URL\" setting must be filled",
                "wordpress-url-invalid": "The \"WordPress URL\" setting does not appear to be a valid URL (current value: \"{url}\")",
                "wordpress-url-index-php": "The \"WordPress URL\" setting must not include \"/index.php\" (current value: \"{url}\")",
                "wordpress-url-trailing-slash": "The \"WordPress URL\" setting must not include a trailing slash (current value: \"{url}\")",
                "wordpress-url-https": "The \"WordPress URL\" setting should be HTTPS (current value: \"{url}\")",
                "wordpress-url-mismatch": "The \"WordPress URL\" setting in Flarum does not match the \"WordPress Address (URL)\" setting from WordPress (expected: \"{expected}\", actual: \"{actual}\")",
                "flarum-url-mismatch": "The \"Flarum URL\" setting in WordPress does not match the URL configured in Flarum config.php (expected: \"{expected}\", actual: \"{actual}\")",
                "api-key-mismatch": "The \"Shared API Key\" setting in WordPress does not match the \"Shared API Key\" setting in Flarum (expected: \"{expected}\", actual: \"{actual}\")",
                "user-id-not-found": "The \"Flarum User ID\" setting in WordPress does not match any known Flarum user (current value: \"{actual}\"). To use the currently logged in user, you can use ID \"{suggested}\"\n",
                "user-id-not-admin": "The \"Flarum User ID\" setting in WordPress does not match a Flarum administrator (current value: \"{actual}\"). To use the currently logged in user, you can use ID \"{suggested}\"\n",
                "sso-mismatch-flarum": "The SSO integration is enabled in Flarum, but not in WordPress",
                "sso-mismatch-wordpress": "The SSO integration is enabled in WordPress, but not in Flarum",
                "comments-mismatch-flarum": "The Comments integration is enabled in Flarum, but not in WordPress",
                "comments-mismatch-wordpress": "The Comments integration is enabled in WordPress, but not in Flarum",
                "api-error-json": "Trying to access the WordPress API resulted in an error: {message} - Body: {body}",
                "api-error-401": "Trying to access the WordPress API resulted in a 401 error. Verify the \"Shared API Key\" matches between Flarum and WordPress settings",
                "api-error-other": "Trying to access the WordPress API resulted in an error: {message}"
            },
            "wizard": {
                "already_installed": "Flarum is already connected with WordPress. To run the wizard again, delete the \"WordPress URL\" setting in Flarum and the \"Flarum Shared API Key\" setting in WordPress.\n",
                "api_unauthorized": "We could not authenticate with the given credentials. Double-check the URL, username and password. Check the documentation for more troubleshooting steps.\n",
                "api_error_generic": "Error while performing a POST request to the WordPress plugin setup endpoint ({exception}). Make sure the Flarum Integration WordPress plugin is installed and enabled.\n",
                "invalid_wordpress_url": "The \"WordPress Address (URL)\" setting in WordPress does not seem to be a valid URL ({actual})."
            },
            "sync_setting_error": "Error syncing the setting to WordPress. Manually check that the checkboxes on WordPress side at set to the same values as in Flarum. Error: {exception}.\n"
        },
        "views": {
            "error": {
                "missing_wordpress_embed": "This post doesn't have a comment thread yet. If you are the blog administrator, publish the post, or disable and re-enable comments to start a thread.\n"
            }
        }
    }
}
