{
    "kyrne-websocket": {
        "forum": {
            "discussion_list": {
                "show_updates_text": "Show {count} updated discussion|Show {count} updated discussions"
            }
        },
        "admin": {
            "pusher_settings": {
                "local_cert_path": "Local SSL Certificate Path",
                "local_pk_path": "Local SSL Private Key Path",
                "passphrase": "(Optional) SSL Key Passphrase",
                "cert_self_signed": "Self-Signed Certificate Support",
                "app_port_label": "Port",
                "app_host_label": "Host",
                "app_id_label": "App ID",
                "auto_update": "Auto Update Discussions",
                "app_key_label": "App Key",
                "app_secret_label": "App Secret",
                "secure": "Force wss/https for Websocket",
                "title": "Websocket/Pusher Settings",
                "reverse_proxy": "Reverse Proxy Support",
                "auth_only": "Websocket for Logged in Users Only"
            },
            "help": {
                "auto_update": "Don't show the yellow update banner, immediately update the discussion list.",
                "app_id": "Pusher App ID - leave as is if using built-in websocket server.",
                "app_key": "Pusher App Key - leave as is if using built-in websocket server.",
                "secret": "Pusher App Secret - leave as is if using built-in websocket server.",
                "secure": "Force the websocket to use secure protocols - Enable this if you are using a secure websocket server but not website.",
                "host": "Host of your websocket server - leave as is if the server is the same host as your forum.",
                "reverse_proxy": "Websockets will connect over port 443 when this is enabled - Use this if you are using a reverse proxy from port 443 to your websocket server.",
                "port": "Port of your websocket server - leave as is if you don't change the build in server port.",
                "cert_path": "Only needed if using ssl and NOT reverse proxy. Path to your SSL (https) certificate ON THE SERVER your websocket server is on - usually a .crt or .pem file.",
                "pk_path": "Only needed if using ssl and NOT reverse proxy. Path to your SSL (https) private key ON THE SERVER your websocket server is on - usually a .key or .pem file.",
                "passphrase": "Only needed if using ssl and NOT reverse proxy. The passphrase used to encode your certificate - not usually needed.",
                "self_signed": "Only needed if using ssl and NOT reverse proxy. Enable this if your SSL (https) certificate is self-signed.",
                "auth_only": "Only allow authenticated users to connect to the websocket server, can reduce the CPU load."
            }
        }
    }
}
