{
    "acpl-lscache": {
        "admin": {
            "cache_enabled_label": "เปิดใช้งาน LSCache",
            "cache_enabled_help": "ตรวจสอบ <a>หน้าข้อมูล</a> เพื่อดูวิธีทดสอบแคช หมายเหตุ: เมื่อปิดใช้งานแคช รายการแคชทั้งหมดสำหรับไซต์นี้จะถูกล้างออกไป",
            "public_cache_ttl_label": "ค่าเริ่มต้นแคชสาธารณะ TTL",
            "public_cache_ttl_help": "กำหนดระยะเวลาในการแคชหน้าสาธารณะเป็นวินาที ค่าเริ่มต้นคือ 604800 วินาที (หนึ่งสัปดาห์)",
            "clearing_cache_listener_label": "ล้าง LSCache เมื่อล้างแคช Flarum",
            "serve_stale_label": "ส่งมอบเนื้อหาเก่า",
            "serve_stale_help": "หากเปิดใช้งาน เวอร์ชันเก่าของหน้าที่แคชจะแสดงให้ผู้เยี่ยมชมเห็นจนกว่าจะมีการสร้างสำเนาแคชใหม่ ซึ่งจะช่วยลดภาระของเซิร์ฟเวอร์ หากปิดใช้งาน หน้าจะถูกสร้างขึ้นแบบไดนามิกในระหว่างการอัปเดตแคช ซึ่งอาจเพิ่มเวลาในการรอได้ โดยการออกแบบ ตัวเลือกนี้สามารถแสดงเนื้อหาที่ล้าสมัยได้ โปรดอย่าเปิดใช้งานตัวเลือกนี้หากคุณพบว่าสิ่งนี้ไม่สามารถยอมรับได้",
            "purge_on_discussion_update_label": "ล้างลิงก์หรือแคชแท็กในการอัพเดตการสนทนา",
            "purge_on_discussion_update_help": "กรอกลิงก์หรือแคชแท็กที่คุณต้องการล้างข้อมูลเมื่ออัพเดตการสนทนา หนึ่งรายการต่อบรรทัด ลิงก์ควรเริ่มต้นด้วย <code>/</code> เช่น <code>/rankings</code> และแคชแท็กควรเริ่มต้นด้วย <code>tag=</code> เช่น <code>tag=rankings</code> สำหรับหลากหลายเส้นทาง การเพิ่มกฎใน .htaccess ด้วยนิพจน์ทั่วไปที่เส้นทางแท็กและป้อนเฉพาะแท็กนี้ที่นี่จะเร็วกว่า <a>เรียนรู้เพิ่มเติม</a> ตามค่าเริ่มต้น แคชสำหรับหน้าหลักและการสนทนาที่อัพเดตจะถูกล้างข้อมูล",
            "cache_exclude_label": "เส้นทางที่ไม่รวมในการแคช",
            "cache_exclude_help": "เส้นทางที่มีสตริงเหล่านี้จะไม่ถูกแคช ตัวอย่าง <code>/mypath/mypage?aa=bb</code> คุณสามารถใช้ <code>mypage?aa=</code> ได้ หากต้องการให้ตรงกับจุดเริ่มต้น ให้เพิ่ม <code>^</code> ที่จุดเริ่มต้น หากต้องการให้ตรงกัน ให้เพิ่ม <code>$</code> ที่ส่วนท้ายของ URL หนึ่งรายการต่อบรรทัด",
            "drop_qs_label": "ลบคิวรีสตริง",
            "drop_qs_help": "ใช้คุณสมบัตินี้เพื่อลบคิวรีสตริงเฉพาะ เช่น <code>fbclid</code> หรือ <code>utm*</code> เมื่อทำการแคช ซึ่งจะป้องกันการแคชซ้ำซ้อนของหน้าที่มีสตริงคิวรี \"ขยะ\" เช่น รหัส UTM ที่ใช้ในการติดตามแต่ไม่ส่งผลต่อเนื้อหาของหน้า ฟีเจอร์นี้ต้องใช้ LSWS v5.2.3 หรือใหม่กว่า ระบุคิวรีสตริงที่จะลบ หนึ่งรายการต่อบรรทัด <a>ดูข้อมูลเพิ่มเติมเกี่ยวกับการลบคิวรีสตริง</a><br></br>\n⚠️ การตั้งค่านี้จะปรับเปลี่ยนไฟล์ .htaccess\n",
            "status_codes_cache_label": "หน้ารหัสสถานะ HTTP เริ่มต้น TTL",
            "status_codes_cache_help": "ระบุรหัสสถานะ HTTP และจำนวนวินาทีที่จะแคชหน้านั้น โดยคั่นด้วยช่องว่าง บรรทัดละ 1 รหัส",
            "purge_all": "=> acpl-lscache.ref.purge_cache",
            "test_failed_alert": "",
            "permissions": {
                "purge": "=> acpl-lscache.ref.purge_cache"
            }
        },
        "forum": {
            "purge": {
                "discussion": "=> acpl-lscache.ref.purge_cache"
            }
        },
        "lib": {
            "purge_success": "แจ้งให้เซิร์ฟเวอร์ LiteSpeed ทราบเพื่อล้างรายการ LSCache",
            "purge_all_success": "แจ้งให้เซิร์ฟเวอร์ LiteSpeed ทราบเพื่อล้างรายการ LSCache ทั้งหมด"
        },
        "ref": {
            "purge_cache": "ล้าง LSCache"
        }
    }
}
