{
    "fof-reactions": {
        "forum": {
            "disabled-reaction": "คุณไม่สามารถเเสดงความรู้สึกได้ตอนนี้ โปรดลองรีเฟรชหน้าใหม่",
            "warning": "การความรู้สึกขอบคุณมีการเปลี่ยนเเปลงเเล้ว",
            "notification": "{username} เเสดงความรู้สึกด้วย {reaction} ในโพสต์ของคุณ",
            "settings": {
                "notify_post_reacted_label": "มีบางคนเเสดงความรู้สึกต่อโพสต์ขอบคุณ"
            },
            "reacting-own-post": "คุณไม่สามารถเเสดงความรู้สึกให้โพสต์ตัวเองได้",
            "modal": {
                "title": "การเเสดงความรู้สึก"
            },
            "mod_item": "ดูการเเสดงความรู้สึก",
            "react_button_label": "ตอบโต้"
        },
        "admin": {
            "permissions": {
                "react_posts_label": "ตอบโต้โพสต์นี้",
                "see_reactions_label": "ดูว่าใครเเสดงความรู้สึกในโพสต์"
            },
            "page": {
                "reactions": {
                    "title": "ความรู้สึกเเบบกำหนดเอง",
                    "reactions": "ความรู้สึกปัจจุบัน",
                    "Helptext": "ใส่ชื่อ (ตัวบงบอก) ของอีโมจิหรือไอคอนจาก Font Awesome เเละเลือกเเบบไหนที่คุณต้องการ",
                    "help": {
                        "display": "การเเสดงผล",
                        "identifier": "ตัวบงบอก"
                    }
                },
                "convert": {
                    "help": "หากคุณเพิ่งอัพเดทส่วนเสริมนี้ ตัวการเเสดงความรู้สึกของคุณจะถูกเปลี่ยน หากคุณเพิ่งติดตั้งส่วนเสริมนี้ เเค่ไม่ต้องสนใจข้อความนี้",
                    "button": "เปลี่ยนการเเสดงความรู้สึงเเบบเก่า",
                    "converting": "การเเสดงความรู้สึกขอวคุณกำลังเปลี่ยนเเปลง รีเฟรชหน้านี้ในอีกไม่กี่นาทีเพื่อดูประเปลี่ยนเเปลงที่ประมวลผลเสร็จเเล้ว (การประมวลผลอาจใช้เวลามากขึ้นอยู่กำจำนวนความรู้สึกที่คุณเพิ่ม)",
                    "converted": "เปลี่ยนเเปลง {number} เป็นการถูกในเสร็จเสร็จสิ้น"
                },
                "settings": {
                    "save_settings": "บันทึกการตั้งค่า",
                    "integrations": {
                        "legend": "การรวม",
                        "warning": "ความรู้สึกซ้ำกัน <strong>ไม่สามารถ</strong> เปลี่ยนเเปลเป็นการถูกใจได้ <strong>เเละ</strong> การเห็นด้วย",
                        "gamification": {
                            "legend": "Gamification",
                            "upvoteLabel": "เปลี่ยนการเเสดงความรู้สึกเป็นเห็นด้วย",
                            "upvoteHelptext": "กรุณาใส่ตัวบงบอกถึงความรู้สึกที่คุณต้องการให้เปลี่ยนเป็นการเห็นด้วยอย่างอัตโนมัติ",
                            "downvoteLabel": "เปลี่ยนความรู้สึกเป็นไม่เห็นด้วย",
                            "downvoteHelptext": "กรุณาใส่ตัวบงบอกถึงความรู้สึกที่คุณต้องการให้เปลี่ยนเป็นการไม่เห็นด้วยอย่างอัตโนมัติ"
                        },
                        "likes": {
                            "legend": "ถูกใจ",
                            "Label": "เปลี่ยนความรู้สึกเป็นการถูกใจ",
                            "Helptext": "กรุณาใส่ตัวบงบอกถึงความรู้สึกที่คุณต้องการให้เปลี่ยนเป็นการถูกใจอย่างอัตโนมัติ"
                        }
                    }
                }
            }
        }
    }
}
