{
    "acpl-lscache": {
        "admin": {
            "cache_enabled_label": "Активирайте LSCache",
            "cache_enabled_help": "Вижте <a>страницата с информация</a> за това как да тествате кеша. ЗАБЕЛЕЖКА: Когато деактивирате кеша, всички кеширани записи за този сайт ще бъдат изчистени.",
            "public_cache_ttl_label": "Публичен кеш по подразбиране TTL",
            "public_cache_ttl_help": "Определете колко време, в секунди, публичните страници трябва да бъдат кеширани. Стойността по подразбиране е 604800 секунди (една седмица).",
            "clearing_cache_listener_label": "Изчистване на LSCache, когато кешът на Flarum е изчистен",
            "serve_stale_label": "Сервирай остаряло съдържание",
            "serve_stale_help": "Ако е разрешено, остаряла версия на кеширана страница ще се показва на посетителите, докато не бъде генерирано ново кеширано копие. Това намалява натоварването на сървъра. Ако е деактивирано, страницата ще се генерира динамично по време на актуализацията на кеша, което може да увеличи времето за изчакване. По дизайн тази опция може да обслужва неактуално съдържание. Моля, не разрешавайте това, ако смятате, че е неприемливо.",
            "purge_on_discussion_update_label": "Изчистете URL-и или етикети при актуализация на дискусия или публикация",
            "purge_on_discussion_update_help": "Въведете URL-и или етикети, които искате да бъдат изчистени при актуализация на дискусия или публикация, по един на ред. URL-ите трябва да започват с <code>/</code>, например <code>/rankings</code>, а етикетите за кеш трябва да започват с <code>tag=</code>, например <code>tag=rankings</code>. За множество пътища добавете правило в .htaccess с регулярен израз, който маркира пътища и въведете само този етикет тук за по-бързо изчистване. <a>Научете повече</a>. По подразбиране, кешът за началната страница и актуализираните дискусии се изчиства.",
            "cache_exclude_label": "Изключване на пътища от кеширане",
            "cache_exclude_help": "Пътища, съдържащи тези низове, няма да бъдат кеширани. За <code>/mypath/mypage?aa=bb</code> можете да използвате <code>mypage?aa=</code>. За да съвпадне в началото, добавете <code>^</code> в началото. За точно съвпадение, добавете <code>$</code> в края на URL. По един на ред.",
            "drop_qs_label": "Пуснете низовете на заявката",
            "drop_qs_help": "Използвайте тази функция, за да изключите определени заявки, като например <code>fbclid</code> или <code>utm*</code>, когато кеширате. Това предотвратява излишното кеширане на страници със 'неполезни' заявки, като UTM кодове, които се използват за проследяване, но не засягат съдържанието на страницата. Това изисква LSWS v5.2.3 или по-нова версия. Посочете заявките, които искате да изключите, по една на ред. <a>Научете повече за изключване на заявки</a>.<br></br>\n⚠️ Тази настройка ще модифицира файла .htaccess.\n",
            "purge_all": "Изчистете всички LSCache",
            "purge_all_success": "Уеб сървърът LiteSpeed е уведомен да изчисти всички записи в LSCache"
        }
    }
}
