{
    "askvortsov-auto-moderator": {
        "admin": {
            "action_drivers": {
                "activate_email": "Активиране на имейл",
                "add_to_group": "Добави към група",
                "remove_from_group": "Премахни от група",
                "suspend": "Спри",
                "unsuspend": "Възстанови"
            },
            "metric_drivers": {
                "discussions_entered": "Въведени дискусии",
                "discussions_participated": "Участвали дискусии",
                "discussions_started": "Започнати дискусии",
                "posts_made": "Създадени публикации",
                "likes_given": "Дадени харесвания",
                "likes_received": "Получени харесвания",
                "best_answers": "Най-добри отговори",
                "moderator_strikes": "Предупреждения за модератора"
            },
            "requirement_drivers": {
                "email_confirmed": "Имейлът е потвърден",
                "in_group": "В група",
                "suspended": "Спрян",
                "email_matches_regex": "Имейлът отговаря на регулярния израз"
            },
            "in_group_settings": {
                "regex": "Регулярен израз за валидни имейли (без наклонени черти)"
            },
            "group_selector": {
                "placeholder": "Изберете група"
            },
            "suspend_selector": {
                "days": "Дни за спиране",
                "indefinitely": "Спиране за неопределено време?"
            },
            "criterion_status": {
                "heading": "Проверка на състоянието",
                "invalid": "В момента критерият е невалиден. Моля, проверете драйверите по-долу за грешки.",
                "no_actions": "За този критерий не са определени действия. Нищо няма да се случи, когато потребителите получат или загубят този критерий.",
                "no_metrics_or_reqs": "За този критерий не са определени показатели или изисквания. Това означава, че ВСИЧКИ потребители ще отговарят на изискванията за този критерий.",
                "valid": "Този критерий е валиден!",
                "action_validation_errors": "Бяха открити следните грешки при проверка на действията на драйвера:",
                "requirement_validation_errors": "Бяха открити следните грешки при проверка на изискванията на драйвера:"
            },
            "criterion_page": {
                "driver_missing_ext": "Този драйвер зависи от разширения, които не са активирани.",
                "back": "Назад към списъка с критерии",
                "name_label": "Име",
                "icon_label": "Икона",
                "description_label": "Описание",
                "new_criterion": "Създайте критерий",
                "negated": "Отрицание?",
                "loading": "=> core.ref.loading",
                "delete_button": "=> core.ref.delete",
                "metrics_and_requirements_label": "Измервания и Изисквания",
                "metrics_and_requirements_help": "Те определят дали потребителите отговарят на изискванията за този критерий. Измерванията представляват диапазони от стойности, изискванията са булеви условия.",
                "metrics_heading": "Показатели",
                "requirements_heading": "Изисквания",
                "add_metric": "Добавяне на показател",
                "actions_label": "Действия",
                "actions_help": "Действията при печалба се изпълняват, когато даден потребител отговаря на изискванията за нов критерий. Действията при загуба се изпълняват, когато потребителят престане да отговаря на критериите.",
                "actions_on_gain_heading": "Действия върху печалба",
                "actions_on_loss_heading": "Действия при загуба",
                "add_action": "Добавяне на действие"
            },
            "undefined_driver_item": {
                "text": "ГРЕШКА! Драйверът <strong>{driverName}</strong> не е дефиниран. Най-вероятно е добавено от разширение, което в момента не е инсталирано. Ще трябва да активирате отново разширението или да премахнете този драйвер, за да бъде отново валиден критерият."
            },
            "automoderator_page": {
                "criterion_invalid": "В момента критерият е невалиден. Моля, проверете настройките му за повече информация",
                "list_heading": "Критерии",
                "create_criterion_button": "Създайте нов критерий"
            },
            "automoderator_instructions": {
                "header": "Инструкции за разширение",
                "text": "<li>Tl;dr: Когато даден потребител отговаря на критерии X, направете Y. Когато даден потребител вече не отговаря на критерии X, направете Z.</li>\n<li><strong>Критерии:</strong> Критериите са в основата на това разширение. Те са произволни набори от показатели и изисквания. Когато даден потребител отговаря на критерий, всички действия „при усилване“ за критерия ще бъдат изпълнени. Когато потребител загуби критерий, всички действия „при загуба“ за критерия ще бъдат изпълнени.</li>\n<ul>\n   <li><strong>Показател:</strong> Числово условие. Например брой публикации или брой получени харесвания. Критерий може да изисква диапазон/минимум/максимум от показатели.</li>\n   <li><strong>Изискване:</strong> Абстрактно булево условие. Например да не е спрян или да има имейл, който съответства на определен регулярен израз.</li>\n</ul>\n<li><strong>Действия:</strong> Нещо, което се случва автоматично, когато даден критерий бъде изпълнен или изгубен. Това може да включва всичко - от добавяне/премахване на група до изпращане на имейл до спиране на потребител.</li>\n<li><strong>Задействане:</strong> Набор от събития, които биха довели до преоценка на групите критерии на потребителя. Това са част от определенията за показатели и изисквания. Всички критерии ще бъдат оценени при влизане: това е „универсалното задействане“.</li>\n<li>Действията „при загуба“ винаги ще се изпълняват преди действията „при печалба“. По този начин ще се предприемат действия, стига даден потребител да отговаря на поне един от критериите, които извършват това действие при печалба.</li>\n<li>Имайте предвид, че действията се изпълняват само „при загуба“ и „при печалба“. Ръчните редакции, докато даден потребител се квалифицира за даден критерий, няма да задействат повторното прилагане на действията на критерия „при усилване“.</li>\n<li>Ако изтриете критерий, действията „при загуба“ НЯМА да се изпълняват за потребителите, които в момента отговарят на условията за критерия.</li>\n<li>Ако използвате критерии за управление на групи, препоръчваме да поддържате отделен набор от групи, които да се управляват по критерии. Няма да можете да добавяте/премахвате потребители към/от тези групи ръчно.</li>\n"
            }
        },
        "lib": {
            "group_id": "ID на групата",
            "managed_groups": {
                "header": "Управлявани групи:",
                "group_item": "<badge></badge> {groupName}",
                "groups_not_editable": "Групите, управлявани от критериите на автоматичния модератор, не могат да се добавят/премахват към/от потребители ръчно, за да се предотвратят несъответствия."
            }
        }
    }
}
