{
    "askvortsov-pwa": {
        "admin": {
            "nav": {
                "pwa_button": "Прогресивно уеб приложение",
                "pwa_text": "Конфигурирайте Flarum да работи като прогресивно уеб приложение, инсталируемо на мобилни устройства."
            },
            "pwa": {
                "about": {
                    "description_label": "Описание",
                    "description_text": "Можете да зададете описанието на страницата \"Основни\" в административния панел на вашия уебсайт.",
                    "long_name_label": "Пълно име",
                    "long_name_text": "Името на уеб приложението, показвано на потребителя.",
                    "heading": "Относно",
                    "short_name_label": "Прякор",
                    "short_name_text": "Името на приложението, което се показва на потребителя, ако няма достатъчно място за пълното име."
                },
                "colors": {
                    "heading": "Цветове",
                    "background_color_label": "Цвят на фона",
                    "background_color_text": "Това се използва като цветово запълване за екрана за стартиране, който се показва, докато PWA се зарежда. Той не се използва, когато приложението е вече заредено.",
                    "theme_color_label": "Цвят на темата",
                    "theme_color_text": "Този цвят се използва от устройствата при показването на вашето приложение, например в превключвача на задачи на Android, като цветова рамка около сайта."
                },
                "maintenance": {
                    "heading": "Поддръжка",
                    "debug_label": "Режим на отстраняване на грешки?",
                    "debug_text": "Това ще записва информация за уведомления в storage/logs. Обикновено трябва да бъде изключено, за да се избегне ненужно попълване на регистрационни файлове.",
                    "reset_vapid_text": "Това ще регенерира VAPID ключовете и ще изтрие всички налични абонаменти, използвайки текущите VAPID ключове.",
                    "reset_vapid_confirm": "Нулирането на VAPID ключовете ще премахне всички абонаменти, използвайки настоящите ключове, така че потребителите няма да получават известия, докато не посетят сайта отново. Това трябва да се прави само при настройка на изпращане на насочени известия за първи път или ако насочените известия изобщо не работят и има предупреждение за липсващи VAPID ключове по-горе.",
                    "reset_vapid_success": "Успешно нулиране на VAPID ключовете. Бяха нулирани {count} абонамента. Заредете страницата отново, за да видите актуализиран доклад за състоянието."
                },
                "firebase_config": {
                    "heading": "",
                    "help_text": "",
                    "see_documentation_here": "",
                    "upload_successful": "",
                    "upload_file": ""
                },
                "other": {
                    "heading": "Други",
                    "force_portrait_text": "Задължителна вертикална ориентация?",
                    "push_notif_preference_default_to_email_label": "Предпочитания по подразбиране за изпращане на насочени известия към имейл?",
                    "push_notif_preference_default_to_email_text": "Ако е вярно, потребителите ще имат насочени известия, активирани по подразбиране за всички типове известия, където известията по имейл са активирани по подразбиране. Ако е невярно, насочените известия ще бъдат деактивирани по подразбиране.",
                    "user_max_subscriptions_label": "Максимален брой абонаменти за насочени известия на потребител",
                    "user_max_subscriptions_text": "Колко push абонамента трябва да може да има всеки потребител едновременно? Когато потребител получи push уведомление, всеки абонамент ще доведе до API заявка. Обикновено всеки абонамент съответства на браузър, който потребителят е използвал."
                },
                "heading": "Конфигурация на прогресивно уеб приложение",
                "text": "Конфигурирайте вашия сайт на Flarum да функционира като прогресивно уеб приложение! Моля, имайте предвид, че това автоматично не поставя вашия сайт в магазина за приложения. Вместо това, това означава, че потребителите имат опция \"Добави към началния екран\" за вашия сайт. Ние предоставяме някои проверки за състоянието, но най-добрият начин за тестване е да опитате да инсталирате приложението (потърсете инструкции в Google за инсталиране на прогресивни уеб приложения). Също така, имайте предвид, че изскачащите прозорци \"Инсталирай това PWA\" са контролирани от браузърите и не могат да бъдат задействани от разработчици, администратори или програми. Препоръчвам включването на инструкции за инсталиране на PWA в документацията на вашия сайт.",
                "status_check_heading": "Проверка на състоянието",
                "logo_heading": "Лога и икони",
                "logo_text": "За да можете да инсталирате прогресивното си уеб приложение, трябва да качите поне едно лого. Моля, имайте предвид, че всички лога трябва да са квадратни; ако не са, те ще бъдат преоразмерени и вероятно ще се разтегнат.\n\nПредлагат се няколко опции за размер по-долу. Препоръчвам да опитате да качите лого с колкото се може повече размери, за да бъде поддържано от повече устройства.\n\nМоля, имайте предвид, че можете да качите 1 голямо лого на полетата за по-малките лога. Например, можете да качите лого с размер 1000px x 1000px на всички полета по-долу. Въпреки това, ако опитате да качите лого с размер 50px x 50px на полето с размер 512x512px, то ще бъде силно разтегнато.\n",
                "logo_size_text": "Качете лого, което ще бъде мащабирано до {size} пиксела по размер на {size} пиксела.",
                "submit_button": "Запазване на настройките",
                "refreshed_message": "Конфигурацията на PWA беше успешно обновена."
            },
            "status": {
                "config_no_https": "URL адресът във вашия файл config.php не използва HTTPS. За да работят прогресивните уеб приложения, се изисква HTTPS.",
                "possible_https_disabled": "Вашият сайт може да не работи на HTTPS. Изчистването на кеша (страница с административната панела => бутон \"Инструменти\") може да помогне. Ако сайтът ви работи на HTTPS, игнорирайте това съобщение. В противен случай, имайте предвид, че HTTPS е задължителен, за да функционират прогресивните уеб приложения (PWA).",
                "no_logo": "Трябва да качите поне едно лого с размер от поне 144x144 пиксела, за да можете да инсталирате PWA (прогресивното уеб приложение).",
                "no_name": "Трябва да предоставите пълно име за вашето приложение, за да може да работи.",
                "no_vapid_keys": "Не са намерени VAPID ключове. Те са задължителни, за да могат да се изпращат насочени известия. Можете да нулирате VAPID ключовете по-долу.",
                "key_gen_failed": "Генерирането на ключовете, необходими за изпращане на насочени известия, се провали. Пълното съобщение за грешка беше: {error}",
                "suggest_gmp": "Разширението gmp за PHP не изглежда да е активирано на вашия сървър. То не е строго задължително, но може да подобри производителността и се препоръчва. Някои общоизползвани хостинг услуги може да не го поддържат.",
                "success": "Не бяха открити потенциални проблеми!"
            }
        },
        "forum": {
            "alerts": {
                "optin": "Имате включени насочени известия, но не сте конфигурирали това устройство.",
                "optin_button": "Конфигуриране"
            },
            "discussion_controls": {
                "share_button": "Споделяне"
            },
            "post_controls": {
                "share_button": "Споделяне",
                "share_api": {
                    "title": "Отговорът на {username} към {title}"
                }
            },
            "user_controls": {
                "share_button": "Споделяне"
            },
            "settings": {
                "push_header": "Натисни",
                "pwa_notifications": {
                    "access_default": "Поради ограничения на браузъра, трябва да дадете съгласие, за да получавате уведомления на това устройство.",
                    "access_default_button": "Избирам",
                    "access_denied": "Трябва да настроите браузъра си, за да получавате уведомления на това устройство.",
                    "access_denied_button": "Научете как",
                    "no_browser_support": "Този браузър не поддържа насочени известия за прогресивни уеб приложения.",
                    "no_browser_support_button": "Научете повече"
                }
            }
        },
        "views": {
            "offline": {
                "header": "Грешка при свързване с мрежата",
                "text": "Това приложение изисква мрежова връзка; не може да се използва в офлайн режим. Моля, проверете вашата връзка."
            }
        }
    }
}
