{
    "fof-sitemap": {
        "admin": {
            "settings": {
                "exclude_users": "Изключи всички потребителски профили от картата на сайта",
                "exclude_users_help": "По подразбиране всеки потребител, видим за гостите, ще бъде индексиран",
                "mode_label": "Режим на работа",
                "mode_help": "Изборът на правилния режим за вашия размер на форума е жизнено важен.",
                "mode_help_runtime_label": "Режим на изпълнение",
                "mode_help_runtime": "За малки форуми, най-вероятно в споделени хостинг среди, като дискусиите, потребителите, таговете и страниците са сумарно по-малко от 10 000 елемента. Картата на сайта се генерира в движение при всяка заявка.",
                "mode_help_schedule": "Следните режими добавят своите задачи към графиката на Flarum.",
                "mode_help_schedule_setup": "Без правилната настройка на Flarum, следните режими няма да работят. Вижте тук <a>за повече информация</a>.",
                "mode_help_large": "50 000 е техническият лимит за файловете на карта на сайта. Ако имате още записи за съхранение, използвайте следната опция!",
                "mode_help_multi_label": "Мулти-файлов режим",
                "mode_help_multi": "Най-доброто за по-големи форуми, започвайки от 10 000 елемента. Многокомпонентни, компресирани файлове с карта на сайта ще бъдат генерирани и съхранени в /публична папка",
                "advanced_options_label": "Разширени опции",
                "frequency_label": "Колко често планировчикът трябва да изгражда отново кешираната карта на сайта?",
                "risky_performance_improvements": "Активиране на рискови подобрения на производителността",
                "risky_performance_improvements_help": "Тези подобрения правят CRON да работи по-бързо при набори от данни с милиони редове, но може да наруши съвместимостта с някои разширения.",
                "modes": {
                    "runtime": "Време за изпълнение",
                    "multi_file": "Мулти файл"
                },
                "frequency": {
                    "hourly": "Почасово",
                    "twice_daily": "Два пъти дневно",
                    "daily": "Ежедневно"
                },
                "soft_404": {
                    "heading": "Soft 404 предотвратяване",
                    "help": "Когато даден модел няма или има малко релевантно съдържание, роботите на Google и на други търсачки, могат да го маркират като страници „soft 404“. За да елиминирате това, задайте минимален брой елементи, необходими за всеки отговарящ на условията елемент.",
                    "user": {
                        "comments": {
                            "minimum_item_threshold_label": "Потребител: Минимален брой коментари/публикации",
                            "minimum_item_threshold_help": "Минималният брой коментари/публикации, които потребителят трябва да има, за да бъде включен профилът му в картата на сайта."
                        }
                    },
                    "tags": {
                        "discussion": {
                            "minimum_item_threshold_label": "Минимален брой дискусии",
                            "minimum_item_threshold_help": "Минималният брой дискусии, които един таг трябва да има, за да бъде включен в картата на сайта."
                        }
                    }
                }
            }
        }
    }
}
