{
    "fof-stopforumspam": {
        "admin": {
            "settings": {
                "introduction": "Проверява регистрациите на нови потребители спрямо базата данни <a>StopForumSpam</a>. Ако праговете за <code>confidence</code> или <code>frequency</code> са достигнати, потребителят не може да завърши регистрацията си във вашия форум.\n\nПоддържа се и SSO регистрация чрез <code>fof/oauth</code> и <code>fof/passport</code>. Други доставчици на SSO би трябвало да работят, но не са тествани.\n",
                "username_label": "Проверка за спам на потребителското име",
                "ip_label": "Проверка за спам на IP адрес",
                "email_label": "Проверка за спам по имейл",
                "frequency_label": "Праг",
                "frequency_help": "Броят доклади за спам между всички активирани проверки, които ще задействат филтъра за спам.\nПример: Ако имейлът има 1 попадение, а IP адресът има 2 попадения, ще има общо 3 попадения. Ако прагът е зададен на 3 или по-малко, ние ще предотвратим регистрацията.\n",
                "api_key_label": "API Ключ",
                "api_key_text": "Имате активиран fof/spamblock, сега имате опцията да докладвате спамери на StopForumSpam, за да предпазите по-голямата форумна общност от спам.",
                "api_key_instructions_text": "<register>Регистрирайте се за StopForumSpam</register>. След това ще трябва да <key>получите API ключ</key>.",
                "regional_endpoint_label": "Географски достъп",
                "regional_endpoint_help": "По подразбиране ще насочим търсенето към най-близкия регионален сървър, за да осигурим най-бърз отговор. Ако желаете да ограничите трафика до конкретен регион, например за спазване на разпоредбите за поверителност на компанията или държавата, тогава можете да принудите връзка към конкретен регион.",
                "region_closest_label": "Най-близо",
                "region_europe_label": "Европа",
                "region_us_label": "Съединени Щати",
                "confidence_label": "Увереност",
                "confidence_help": "Резултатът за доверие е сравнително добър индикатор, че тестваното поле би довело до нежелана дейност. Задайте нивото на увереност като процент. Ако полето е равно или над тази цифра, регистрацията ще бъде блокирана, независимо от теста за \"честота\" по-горе.",
                "email_hash_label": "Използвайте хеширан имейл адрес",
                "email_hash_help": "Подайте MD5 хеш на имейл адреса, ако желаете да не предавате самия имейл адрес. Този метод заобикаля всички черни списъци, заобикалящи проверки за нормализиране и обфускация."
            }
        },
        "forum": {
            "message": {
                "spam": "Вашата информация е маркирана като спам."
            }
        },
        "api": {
            "error": {
                "unknown": "Неуспешно докладване на потребител на StopForumSpam."
            }
        }
    }
}
