{
    "clarkwinkelmann-scout": {
        "admin": {
            "setting": {
                "driver": "Trình điều khiển",
                "driverOption": {
                    "null": "Rỗng",
                    "algolia": "Algolia",
                    "meilisearch": "Meilisearch",
                    "tntsearch": "TNTSearch"
                },
                "prefix": "Tiền tố tên chỉ mục (tùy chọn)",
                "queue": "Xử lý cập nhật chỉ mục hàng đợi",
                "queueHelp": "Cài đặt này chỉ có hiệu lực nếu trình điều khiển queue không đồng bộ được định cấu hình trong Flarum.",
                "limit": "Giới hạn kết quả mặc định",
                "limitPlaceholder": "Tự động",
                "limitHelp": "Điều này sẽ ghi đè số lượng kết quả được yêu cầu cho công cụ tìm kiếm và ảnh hưởng đến số trang kết quả có thể được tạo (giới hạn cũng tính nội dung mà người dùng sẽ không thể xem). Một số công cụ có thể yêu cầu cấu hình bổ sung để thay đổi mức tối đa cho phép.\n",
                "queryMinLength": "Độ dài truy vấn tối thiểu cho đề xuất",
                "queryMinLengthPlaceholder": "Tự động",
                "queryMinLengthHelp": "Cài đặt này chỉ ảnh hưởng đến trình đơn thả xuống đề xuất của đầu vào tìm kiếm trong tiêu đề. Flarum có độ dài truy vấn mặc định là 3 ký tự trước khi truy xuất các đề xuất mà bạn có thể ghi đè bằng cài đặt này. Trang kết quả tìm kiếm hoàn chỉnh không bao giờ có bất kỳ độ dài truy vấn tối thiểu nào. Bạn phải xóa bộ nhớ cache sau khi thay đổi giá trị này.\n",
                "algoliaId": "ID Algolia",
                "algoliaSecret": "Mã Secret Algolia",
                "algoliaConnectTimeout": "Timeout kết nối Algolia (tùy chọn)",
                "algoliaReadTimeout": "Timeout đọc Algolia (tùy chọn)",
                "algoliaWriteTimeout": "Timeout viết Algolia (tùy chọn)",
                "meilisearchHost": "Host Meilisearch",
                "meilisearchKey": "Mã key Meilisearch",
                "tntsearchMaxDocs": "TNT Search Max Docs (tùy chọn, số lượng kết quả tối đa)",
                "tntsearchFuzziness": "TNT Search Fuzziness (đối sánh lỗi chính tả/biến thể)",
                "tntsearchFuzzyDistance": "TNT Search Fuzziness Levenshtein Distance (tùy chọn)",
                "tntsearchFuzzyPrefixLength": "Độ dài tiền tố TNT Search Fuzziness (tùy chọn)",
                "tntsearchFuzzyMaxExpansions": "TNT Search Fuzziness Mở rộng Tối đa (tùy chọn)"
            }
        }
    }
}
