{
    "justoverclock-reputation-score": {
        "admin": {
            "tagMinimumReputationLabel": "Giới hạn điểm uy tín tối thiểu",
            "tagMinimumReputationLabelHelp": "Định nghĩa số điểm uy tín tối thiểu để tạo và trả lời một chủ đề.",
            "resetRewardsButton": "Đặt lại toàn bộ phần thưởng người dùng",
            "resetRewardsButtonHelp": "Hành động này không thể hoàn tác! Khi bấm nút này, tất cả thông tin lưu trong cột phần thưởng sẽ bị xóa và được tính lại tự động ở lần tương tác đầu tiên của người dùng.",
            "resetRewardDisclaimer": "Chỉ nên sử dụng thao tác này khi tiện ích được cập nhật thay đổi bản dịch hoặc logic phân bổ điểm uy tín nội bộ!",
            "resetRewardsSuccess": "Đã xóa toàn bộ phần thưởng thành công",
            "resetRewardsError": "Đã xảy ra lỗi khi thử đặt lại tất cả trường phần thưởng",
            "oneYearSeniority": "Thâm niên 1+ năm",
            "threeYearSeniority": "Thâm niên 3+ năm",
            "fiveYearSeniority": "Thâm niên 5+ năm",
            "posts": "bài viết",
            "discussions": "thảo luận",
            "like": "lượt thích",
            "pointsIncreased": "Điểm đã tăng",
            "pointsDecreased": "Điểm đã giảm",
            "historyPostDeleted": "Điểm uy tín giảm do bài viết bị xóa hoặc ẩn.",
            "historyPostCreated": "Điểm uy tín tăng khi tạo bài viết.",
            "historyLikeSet": "Điểm uy tín tăng khi nhận được lượt thích.",
            "historyLikeUnset": "Điểm uy tín giảm khi bị bỏ thích.",
            "historyBestAnswerSet": "Điểm uy tín tăng khi nhận được câu trả lời hay nhất.",
            "historyBestAnswerUnset": "Điểm uy tín giảm khi bị gỡ câu trả lời hay nhất.",
            "historyDiscussionCreated": "Điểm uy tín tăng khi bắt đầu thảo luận.",
            "historyDiscussionClosed": "Điểm uy tín giảm vì chủ đề của bạn đã bị đóng.",
            "historyFlagCreated": "Điểm uy tín tăng khi báo cáo người dùng.",
            "permission": {
                "canEarnReputationForDiscussion": "Có thể nhận điểm uy tín khi tạo thảo luận",
                "canEarnReputationForPost": "Có thể nhận điểm uy tín khi tạo bài viết",
                "canEarnReputationForLikes": "Có thể nhận điểm uy tín khi tặng lượt thích",
                "canPostWithReputation": "Truy cập với điểm uy tín tối thiểu"
            },
            "settings": {
                "maxPoints": "Điểm uy tín tối đa",
                "maxPointsHelp": "Nhập số điểm uy tín tối đa cho phép, ví dụ \"1000\"",
                "discussionPoints": "Điểm cho mỗi thảo luận mới tạo",
                "discussionPointsHelp": "Nhập số điểm người dùng nhận khi tạo thảo luận mới (ví dụ: 0.55)",
                "bestAnswerPoints": "Điểm cho \"câu trả lời hay nhất\"",
                "bestAnswerHelp": "Nhập số điểm người dùng nhận khi được chọn là \"câu trả lời hay nhất\"",
                "likePoints": "Điểm cho lượt thích nhận được",
                "likePointsHelp": "Nhập số điểm người dùng nhận khi nhận được một lượt thích",
                "postPoints": "Điểm cho mỗi bài viết được tạo",
                "postPointsHelp": "Nhập số điểm người dùng nhận khi tạo bài viết mới (điểm sẽ được nhân dựa trên độ dài bài viết)",
                "flagPoints": "Điểm cho việc báo cáo bài viết",
                "flagPointsHelp": "Nhập số điểm người dùng nhận khi báo cáo bài viết",
                "minReputationThreshold": "Điểm uy tín tối thiểu để tạo hoặc tham gia một chủ đề",
                "minReputationThresholdHelp": "Điểm uy tín tối thiểu để cho phép người dùng đăng bài hoặc tạo chủ đề mới",
                "postRewardThreshold": "Ngưỡng phần thưởng theo số lượng bài viết",
                "postRewardThresholdHelp": "<p>Nhập số lượng bài tối thiểu để trao huy chương cho người dùng.</p>\n<span>\n  Mỗi người dùng có thể nhận 3 phần thưởng dựa trên số lượng bài viết. Nếu bạn\n  đặt ví dụ \"50\", hệ số nội bộ (x1, x3, x8) sẽ trao phần thưởng\n  cho \"50\", \"150\" và \"400\" bài viết (tương ứng đồng, bạc và vàng).\n</span>\n",
                "discussionRewardThreshold": "Ngưỡng phần thưởng theo số lượng thảo luận",
                "discussionRewardThresholdHelp": "<p>Nhập số lượng thảo luận tối thiểu để trao huy chương cho người dùng.</p>\n<span>\n  Mỗi người dùng có thể nhận 3 phần thưởng dựa trên số lượng thảo luận. Nếu bạn\n  đặt ví dụ \"50\", hệ số nội bộ (x1, x3, x8) sẽ trao phần thưởng\n  cho \"50\", \"150\" và \"400\" thảo luận (tương ứng đồng, bạc và vàng).\n</span>\n",
                "seniorityRewardThreshold": "Ngưỡng thâm niên",
                "seniorityRewardThresholdHelp": "<p>Nhập số năm thâm niên tối thiểu để trao huy chương cho người dùng.</p>\n<span>\n  Mỗi người dùng có thể nhận 3 phần thưởng dựa trên thâm niên. Nếu bạn\n  đặt ví dụ \"1\", hệ số nội bộ (x1, x3, x5) sẽ trao phần thưởng\n  cho \"1\", \"3\" và \"5\" năm thâm niên (tương ứng cấp đồng, bạc và vàng).\n</span>\n"
            }
        },
        "forum": {
            "notEnoughReputationMessage": "Bạn không có đủ điểm uy tín để trả lời chủ đề này...",
            "emptyReputationHistory": "Không tìm thấy lịch sử cho người dùng này...",
            "reputation": "Uy tín",
            "reputationBar": "Điểm uy tín",
            "trust": "Uy tín",
            "reputationIncreasedNotification": "Uy tín của bạn đang tăng! Tiếp tục phát huy nhé!",
            "reputationDecreasedNotification": "Ôi không! Uy tín của bạn đang giảm!",
            "pageTitle": "Top 20 người dùng đáng tin cậy",
            "topReputation": "Uy tín hàng đầu",
            "discussionCount": "Số thảo luận",
            "totalPosts": "Tổng số bài viết",
            "reputationHistory": "Lịch sử uy tín",
            "reputationHistoryPageTitle": "Dòng thời gian này hiển thị 15 sự kiện gần nhất ảnh hưởng đến uy tín của bạn.",
            "xPostsReached": "Đạt mốc {count} bài viết!",
            "tagReputationWarning": "Để có thể trả lời hoặc tạo chủ đề, bạn cần ít nhất {count} điểm uy tín!",
            "tagReputationWarningTitle": "Cảnh báo!",
            "firstLoginModalContent": "<p>\n    Diễn đàn này sử dụng hệ thống uy tín động để khuyến khích sự tương tác tích cực trong cộng đồng.\n    Là người dùng, bạn có thể kiếm điểm uy tín bằng cách đóng góp có ý nghĩa cho các cuộc thảo luận và tương tác, chẳng hạn như:\n    <ul>\n      <li>\n        Tạo thảo luận mới: Chia sẻ suy nghĩ và ý tưởng của bạn với cộng đồng.\n      </li>\n      <li>\n        Trả lời bài viết: Nhận điểm dựa trên chất lượng phản hồi của bạn.\n      </li>\n      <li>\n        Báo cáo người dùng: Góp phần duy trì môi trường lành mạnh bằng cách báo cáo hành vi không phù hợp.\n      </li>\n      <li>\n        Nhận lượt thích: Thể hiện sự trân trọng với bài viết của người khác và được thưởng khi nhận lại lượt thích.\n      </li>\n      <li>\n        Viết câu trả lời hay nhất: Kiếm điểm khi câu trả lời của bạn giải quyết vấn đề và được chọn là \"câu trả lời hay nhất\".\n      </li>\n    </ul>\n  </p>\n  <p>\n    Hãy tích cực, giúp đỡ mọi người và đóng góp cho cộng đồng để kiếm điểm uy tín. Hành động của bạn\n    nói lên tất cả, và với mỗi điểm bạn sẽ nhận được nhiều sự ghi nhận hơn cho nỗ lực của mình. Tiếp tục tương tác và xây dựng uy tín của bạn!\n  </p>\n"
        }
    }
}
