{
    "kilowhat-rich-embeds": {
        "admin": {
            "settings": {
                "layout": "Bố cục",
                "layoutOptions": {
                    "inline": "1 dòng",
                    "block": "Khối",
                    "separated": "Phân cách"
                },
                "position": "Vị trí",
                "positionOptions": {
                    "replace": "Thay thế liên kết",
                    "above": "Liên kết ở trên",
                    "below": "Liên kết bên dưới"
                },
                "style": "Kiểu",
                "styleOptions": {
                    "vertical": "Chiều dọc",
                    "horizontal": "Chiều ngang"
                },
                "maxImageCount": "Số lượng hình ảnh tối đa trong bản xem trước",
                "maxImageCountHelp": "Bao nhiêu hình ảnh từ Opengraph hoặc trình phân tích dự phòng sẽ được hiển thị. Tất cả URL hình ảnh luôn được lưu, cho phép bạn thay đổi cài đặt này sau.\n",
                "maxImageCountPlaceholder": "Để trống để không giới hạn",
                "imageProxy": "Proxy ảnh OpenGraph",
                "imageProxyHelp": "Tất cả hình ảnh OpenGraph và favicon sẽ được proxy thông qua Flarum thay vì trình duyệt của khách",
                "cacheProxy": "Cache ảnh proxy",
                "cacheProxyHelp": "Hình ảnh sẽ được cache vào bộ nhớ thông qua headers HTTP của họ",
                "withoutOpengraph": "Tạo rich embed cho các trang ngoại trừ dữ liệu OpenGraph",
                "withoutOpengraphHelp": "Tiêu đề, mô tả và ảnh sẽ được quét khỏi trang HTML",
                "blacklist": "Danh sách đen URL",
                "blacklistHelp": "Kiểm tra tài liệu để biết định dạng. Các URL này sẽ không bao giờ có nhiều nhúng và không thể được ủy quyền thông qua proxy hình ảnh",
                "whitelist": "Danh sách trắng URL",
                "whitelistHelp": "Kiểm tra tài liệu để biết định dạng. Nếu một giá trị được đặt, tất cả các URL khác sẽ được coi là danh sách đen",
                "crawlerTimeout": "",
                "crawlerTimeoutHelp": "",
                "imageEmbeds": "Rich Embeds cho Ảnh",
                "imageEmbedsHelp": "Tính năng này truy xuất và hiển thị thông tin bổ sung về hình ảnh bên ngoài được chèn trong bài đăng bằng mã bbcode hoặc dấu xuống. Tại thời điểm này, nó sử dụng lại cùng một danh sách đen / danh sách trắng và các quyền như các liên kết phong phú. Những hình ảnh này không được hỗ trợ thông qua proxy hình ảnh OpenGraph. Bạn phải xóa bộ đệm Flarum sau khi thay đổi cài đặt này.\n",
                "flarumApiPreviews": "Bật bản xem trước Flarum nâng cao",
                "flarumApiPreviewsHelp": "Tính năng này phân tích cú pháp dữ liệu JSON bổ sung đã được bao gồm trong HTML bởi tất cả các diễn đàn do Flarum cung cấp. Nó sẽ hoạt động với bất kỳ diễn đàn nào chạy Flarum 1.4+ và quảng cáo header Flarum<code>X-Powered-By</code>.\n",
                "githubApiKey": "API Key Github",
                "githubApiKeyHelp": "Điền vào để bật bản xem trước GitHub được cung cấp bởi API cho các kho, sự cố và PR, bao gồm cả kho riêng.",
                "githubOrgWhitelist": "Danh sách cho phép của tổ chức",
                "githubOrgWhitelistHelp": "Danh sách các tổ chức GitHub được phân tách bằng dấu phẩy sẽ sử dụng bản xem trước do API cung cấp. Sử dụng trường này để ngăn mọi kho lưu trữ riêng tư có thể truy cập bằng khóa API bị lộ, để giảm mức sử dụng API hoặc chỉ thay đổi kiểu nhúng của tổ chức của riêng bạn. Nếu để trống, bạn có thể xem trước bất kỳ repo nào mà khóa API có thể truy cập.\n",
                "googleApiAuthConfig": "Đường dẫn cấu hình xác thực SDK của Google hoặc JSON",
                "googleApiAuthConfigHelp": "Cài đặt này được sử dụng kết hợp với các cài đặt YouTube và Google Drive bên dưới. Nó phải chứa đường dẫn tuyệt đối đến tệp xác thực JSON trên hệ thống tệp cục bộ, hoặc nội dung của tệp đó. Nếu để trống, khóa API hoặc tài khoản dịch vụ sẽ tự động được phát hiện thông qua các biến môi trường bởi Google API SDK.\n",
                "googleApiKey": "Khóa API Google SDK",
                "googleApiKeyHelp": "Cài đặt này được sử dụng kết hợp với các cài đặt YouTube và Google Drive bên dưới. Nếu để trống, khóa API hoặc tài khoản dịch vụ sẽ tự động được phát hiện thông qua các biến môi trường bởi Google API SDK.\n",
                "youtubePlayer": "Cho phép phát video YouTube từ bản xem trước",
                "youtubePlayerHelp": "Trình phát iframe sẽ được tải theo yêu cầu khi người dùng nhấp vào nút phát trong bản xem trước. Bạn phải cấu hình CSP và tiêu đề frame để cho phép frame từ tên miền YouTube. Tính năng này có thể được sử dụng mà không cần quyền truy cập API.\n",
                "youtubeNoCookie": "Sử dụng tên miền iframe no-cookie của YouTube",
                "youtubeNoCookieHelp": "Chuyển sang tên miền no-cookie thay thế được YouTube cung cấp. Một số video có thể không thể phát trong iframe với tùy chọn này được bật. Tính năng này có thể được sử dụng mà không cần quyền truy cập API.\n",
                "youtubeSmartFallback": "",
                "youtubeSmartFallbackHelp": "",
                "youtubeApiPreviews": "Bật bản xem trước YouTube phong phú nâng cao do API cung cấp",
                "youtubeApiPreviewsHelp": "Google API SDK phải được cấu hình ở trên. Tính năng này sẽ hiển thị thêm thống kê về video và có thể hiển thị video riêng tư mà người dùng SDK có quyền truy cập.\n",
                "googledriveApiPreviews": "Bật bản xem trước Google Drive phong phú nâng cao do API cung cấp",
                "googledriveApiPreviewsHelp": "Google API SDK phải được cấu hình ở trên. Tính năng này sẽ hiển thị tiêu đề và bản xem trước của tệp Google Drive. Sử dụng tài khoản dịch vụ với quyền truy cập vào Drive riêng tư để bật xem trước tệp riêng tư.\n"
            },
            "section": {
                "siteSpecificHelp": "Dưới đây là các cài đặt cụ thể cho trang web cải thiện nhúng bằng cách sử dụng dữ liệu không có sẵn thông qua OpenGraph và quét HTML. Tất cả các tùy chọn đều tùy chọn. Một số tùy chọn yêu cầu quyền truy cập API của bên thứ ba có thể có giới hạn tốc độ hoặc phí.\n",
                "flarum": "Flarum",
                "github": "GitHub",
                "google": "Google",
                "youtube": "YouTube",
                "googledrive": "Google Drive"
            },
            "permissions": {
                "viewGoogleDriveThumbnails": "Xem hình thu nhỏ Google Drive do API cung cấp",
                "useOnOwnPost": "Sử dụng nhúng trong bài đăng của riêng mình",
                "disableOnOwnPost": "Tắt nhúng trên bài đăng của chính mình",
                "refreshOnOwnPost": "Làm mới bản nhúng trên bài đăng của chính mình",
                "disableOnAnyPost": "Tắt nhúng trên bất kỳ bài đăng nào",
                "refreshOnAnyPost": "Làm mới bản nhúng trên bất kỳ bài đăng nào"
            },
            "preview": {
                "title": "Xem trước",
                "refresh": "Làm mới",
                "loading": "Đang tải..."
            }
        },
        "lib": {
            "embed": {
                "altFavicon": "Biểu tượng {website}",
                "altImageFallback": "Ảnh Opengraph {website}",
                "altAvatar": "Hình ảnh đại diện tác giả",
                "missing": {
                    "retrieving": "Đang tải...",
                    "other": "Không thể tạo bản xem trước cho liên kết này"
                }
            },
            "controls": {
                "refresh": "Tải dữ liệu lại",
                "disable": "Tắt nhúng trên bài viết này",
                "disableConfirmation": "Tất cả các nhúng sẽ bị xóa khỏi bài đăng này. Tiếp tục?",
                "imgCopy": "Sao chép URL ảnh",
                "imgCopied": "Đã sao chép!",
                "imgOpen": "Mở ảnh trong tab mới",
                "play": "Nhấp để phát phương tiện bằng trình phát nhúng",
                "expandDescription": "Mở rộng mô tả"
            }
        },
        "api": {
            "error": {
                "blacklistedUrl": "URL {url} chưa được đưa vào danh sách cho phép để nhúng.",
                "invalidUrl": "URL {url} không hợp lệ."
            },
            "embed": {
                "flarum": {
                    "discussion": {
                        "type": "Thảo luận",
                        "stats": {
                            "commentCount": "Trả lời",
                            "participantCount": "Người tham gia",
                            "createdAt": "Ngày bắt đầu"
                        }
                    },
                    "user": {
                        "type": "Hồ sơ",
                        "avatarAlt": "Ảnh đại diện",
                        "stats": {
                            "discussionCount": "Thảo luận",
                            "commentCount": "Bình luận",
                            "joinTime": "Ngày tham gia"
                        }
                    }
                },
                "github": {
                    "siteName": "GitHub",
                    "privateRepoSuffix": "[riêng tư]",
                    "issue": {
                        "type": "Vấn đề",
                        "stats": {
                            "commentCount": "Bình luận",
                            "createdAt": "Tạo lúc"
                        }
                    },
                    "pull": {
                        "type": "Pull request",
                        "stats": {
                            "commentCount": "Bình luận",
                            "reviewCount": "Đánh giá",
                            "commitCount": "Commit",
                            "createdAt": "Tạo lúc"
                        }
                    },
                    "repo": {
                        "type": {
                            "public": "Kho công khai",
                            "private": "Kho riêng tư"
                        },
                        "stats": {
                            "openIssueCount": "Vấn đề mở",
                            "subscriberCount": "Người theo dõi",
                            "stargazerCount": "Sao",
                            "forkCount": "Fork"
                        }
                    }
                },
                "youtube": {
                    "siteName": "YouTube",
                    "video": {
                        "type": "Video",
                        "thumbnailAlt": "Hình thu nhỏ video",
                        "stats": {
                            "viewCount": "Lượt xem",
                            "likeCount": "Thích",
                            "commentCount": "Bình luận",
                            "publishedAt": "Xuất bản lúc"
                        }
                    }
                },
                "googledrive": {
                    "siteName": "Google Drive",
                    "file": {
                        "type": "Tệp",
                        "thumbnailAlt": "Bản xem trước tệp Google Drive",
                        "stats": {
                            "size": "Kích thước tệp",
                            "createdTime": "Tạo lúc",
                            "modifiedTime": "Sửa đổi lúc"
                        }
                    }
                }
            }
        }
    }
}
