{
    "ordinaryjellyfish-automod": {
        "admin": {
            "permissions": {
                "bypass": "Bỏ qua bộ lọc tự động"
            },
            "settings": {
                "threshold": "Ngưỡng độ tin cậy",
                "threshold_help": "Ngưỡng độ tin cậy nằm trong khoảng từ 0.00 đến 1.00, phản ánh khả năng đầu vào hoặc phản hồi thuộc về một danh mục nhất định. Ngưỡng thấp hơn sẽ giảm số lượng dương tính giả, nhưng có thể làm tăng số lượng âm tính giả. Ngưỡng cao hơn sẽ làm tăng số lượng dương tính giả, nhưng có thể giảm số lượng âm tính giả.",
                "moderate_categories_label": "Danh mục kiểm duyệt",
                "moderate_categories_label_help": "Các danh mục sẽ tự động gắn cờ nội dung để kiểm duyệt khi được bật và thỏa mãn quy tắc độ tin cậy.",
                "moderate_categories_enable": "Bật danh mục kiểm duyệt",
                "service_account": "Tài khoản dịch vụ",
                "filter_label": "Bộ lọc dựng sẵn",
                "filter_help": "Đây là các bộ lọc mà tôi đã tạo để giúp giữ an toàn cho diễn đàn của bạn. Các bộ lọc đã bật sẽ tự động gắn cờ giống như danh mục kiểm duyệt.",
                "filter_enable": "Bật bộ lọc dựng sẵn",
                "filters": {
                    "doxxing": "Tiết lộ thông tin cá nhân",
                    "doxxing_help": "Hành động công khai tiết lộ thông tin cá nhân trước đây vốn riêng tư về một cá nhân hoặc tổ chức, thường với mục đích xấu.",
                    "flag_unsafe_images": "Hình ảnh không an toàn",
                    "flag_unsafe_images_help": "Chạy kiểm tra Google Safe Search và gắn cờ các hình ảnh không an toàn. Lưu ý rằng điều này có thể làm chậm quá trình đăng bình luận của bạn."
                }
            }
        },
        "lib": {
            "moderate_categories": {
                "toxic": "Độc hại",
                "toxic_help": "Nội dung thô lỗ, thiếu tôn trọng hoặc phi lý.",
                "derogatory": "Xúc phạm",
                "derogatory_help": "Bình luận tiêu cực hoặc gây hại nhắm vào danh tính và/hoặc các thuộc tính được bảo vệ.",
                "violent": "Bạo lực",
                "violent_help": "Mô tả các tình huống miêu tả bạo lực đối với một cá nhân hoặc nhóm, hoặc mô tả chung về máu me.",
                "sexual": "Tình dục",
                "sexual_help": "Chứa các tham chiếu đến hành vi tình dục hoặc nội dung khiêu dâm khác.",
                "insult": "Lăng mạ",
                "insult_help": "Bình luận mang tính xúc phạm, kích động hoặc tiêu cực hướng tới một người hoặc một nhóm người.",
                "profanity": "Ngôn từ thô tục",
                "profanity_help": "Ngôn từ tục tĩu hoặc thô tục như chửi thề.",
                "death": "Cái chết, tổn hại & bi kịch",
                "death_help": "Cái chết của con người, bi kịch, tai nạn, thảm họa và hành vi tự gây hại.",
                "weapons": "Vũ khí & súng đạn",
                "weapons_help": "Nội dung đề cập đến dao, súng, vũ khí cá nhân và các phụ kiện như đạn dược, bao đựng, v.v.",
                "public_safety": "An toàn công cộng",
                "public_safety_help": "Các dịch vụ và tổ chức cung cấp cứu trợ và đảm bảo an toàn công cộng.",
                "health": "Sức khỏe",
                "health_help": "Sức khỏe con người, bao gồm: tình trạng sức khỏe, bệnh tật và rối loạn; liệu pháp y tế, thuốc men, tiêm chủng, thực hành y tế và tài nguyên hỗ trợ hồi phục, bao gồm nhóm hỗ trợ.",
                "religion": "Tôn giáo & Niềm tin",
                "religion_help": "Hệ thống niềm tin liên quan đến khả năng tồn tại của các quy luật và thực thể siêu nhiên; tôn giáo, đức tin, tín ngưỡng, thực hành tâm linh, nhà thờ và nơi thờ tự. Bao gồm chiêm tinh và huyền thuật.",
                "drugs": "Ma túy",
                "drugs_help": "Ma túy giải trí và bất hợp pháp; dụng cụ và việc trồng trọt, cửa hàng bán phụ kiện… Bao gồm cả việc sử dụng y tế của các loại ma túy thường được dùng để giải trí (ví dụ: cần sa).",
                "war": "Chiến tranh & Xung đột",
                "war_help": "Chiến tranh, xung đột quân sự và xung đột thể chất lớn liên quan đến nhiều người. Bao gồm thảo luận về các dịch vụ quân sự, ngay cả khi không liên quan trực tiếp đến chiến tranh hoặc xung đột.",
                "finance": "Tài chính",
                "finance_help": "Dịch vụ tài chính cho cá nhân và doanh nghiệp, chẳng hạn như ngân hàng, cho vay, tín dụng, đầu tư và bảo hiểm.",
                "politics": "Chính trị",
                "politics_help": "Tin tức và phương tiện chính trị; thảo luận về xã hội, chính phủ và chính sách công.",
                "legal": "Pháp lý",
                "legal_help": "Nội dung liên quan đến luật pháp, bao gồm các hãng luật, thông tin pháp lý, tài liệu pháp lý chính, dịch vụ pháp lý, ấn phẩm và công nghệ pháp lý, nhân chứng chuyên môn, tư vấn kiện tụng và các nhà cung cấp dịch vụ pháp lý khác."
            }
        },
        "forum": {
            "flag_reason": "Tự động kiểm duyệt đã gắn cờ bài viết này vì {reason}"
        }
    }
}
