{
    "vlssu-flarum-cravatar": {
        "admin": {
            "settings": {
                "proxy": {
                    "title": "Proxy cravatars",
                    "helptext": "Theo mặc định, URL cravatar được lấy trực tiếp từ cravatar.cn. Điều này cho phép tất cả các yêu cầu cravatar được phục vụ trực tiếp bởi chính diễn đàn."
                },
                "replace-flarum-custom": {
                    "title": "Thay thế avatar tùy chỉnh đã tải lên diễn đàn",
                    "helptext": "Thay thế avatar tùy chỉnh đã được tải lên diễn đàn bằng Cravatar"
                },
                "allow-user-toggle": {
                    "title": "",
                    "helptext": ""
                },
                "defaults": {
                    "title": "Mặc định",
                    "helptext": "Điều gì xảy ra khi một địa chỉ email không có hình ảnh Cravatar phù hợp? Cravatar có một số tùy chọn tích hợp sẵn mà bạn có thể sử dụng làm mặc định. Hầu hết các tùy chọn này hoạt động bằng cách lấy hash email được yêu cầu và sử dụng nó để tạo hình ảnh theo chủ đề, độc nhất cho địa chỉ email đó.",
                    "mp_label": "mp: (mystery-person) một đường viền đơn giản, kiểu hoạt hình của một người (không thay đổi theo hash email)",
                    "identicon_label": "identicon: một mẫu hình học dựa trên hash email",
                    "monsterid_label": "monsterid: một 'quái vật' được tạo ra với các màu sắc, khuôn mặt khác nhau, v.v.",
                    "wavatar_label": "wavatar: các khuôn mặt được tạo ra với các đặc điểm và nền khác nhau",
                    "retro_label": "retro: các khuôn mặt pixel kiểu trò chơi arcade 8-bit tuyệt vời được tạo ra",
                    "robohash_label": "robohash: một robot được tạo ra với các màu sắc, khuôn mặt khác nhau, v.v."
                },
                "rating": {
                    "title": "Xếp hạng",
                    "helptext": "Cravatar cho phép người dùng tự xếp hạng hình ảnh của họ để chỉ ra xem hình ảnh có phù hợp với một nhóm đối tượng nhất định hay không. Theo mặc định, chỉ các hình ảnh được xếp hạng 'G' mới được hiển thị, trừ khi bạn chỉ định muốn xem các xếp hạng cao hơn. Bạn có thể chọn một trong các mức xếp hạng sau để yêu cầu hình ảnh có mức tối đa là xếp hạng đó.",
                    "g_label": "g: phù hợp để hiển thị trên tất cả các trang web với mọi loại đối tượng",
                    "pg_label": "pg: có thể chứa các cử chỉ thô lỗ, người ăn mặc khêu gợi, từ ngữ thô tục nhẹ hoặc bạo lực nhẹ",
                    "r_label": "r: có thể chứa những nội dung như chửi thề nặng, bạo lực dữ dội, ảnh khỏa thân hoặc sử dụng ma túy mạnh",
                    "x_label": "x: có thể chứa hình ảnh tình dục khiêu dâm hoặc bạo lực cực kỳ ghê rợn"
                },
                "force-default": {
                    "title": "Buộc sử dụng mặc định",
                    "helptext": "Buộc sử dụng bộ mặc định, ngay cả khi hash email liên kết với avatar tùy chỉnh do người dùng tải lên"
                }
            }
        },
        "forum": {
            "settings": {
                "edit-cravatar": "Quản lý avatar trên cravatar.cn",
                "use-cravatar": "",
                "use-uploaded": ""
            }
        }
    }
}
