{
    "askvortsov-trust-levels": {
        "admin": {
            "metric_drivers": {
                "discussions_entered": "Discussioni avviate",
                "discussions_participated": "Discussioni a cui si è partecipato",
                "discussions_started": "Discussioni Iniziate",
                "posts_made": "Post Scritti",
                "likes_given": "Mi piace dati",
                "likes_received": "Mi Piace Ricevuti",
                "best_answers": "Risposte migliori"
            },
            "group_selector": {
                "placeholder": "Scegli un gruppo"
            },
            "trust_level_modal": {
                "title": "Crea livello di fiducia",
                "name_label": "Nome",
                "name_placeholder": "Nome Livello di Fiducia",
                "group_label": "Gruppo",
                "submit_button": "=> core.ref.save_changes",
                "delete_button": "Cancella Livello di Fiducia",
                "delete_confirmation": "Sei sicuro di voler eliminare questo livello di fiducia? Il gruppo del livello di fiducia non verrà revocato agli utenti che lo hanno ricevuto."
            },
            "trust_level_page": {
                "list_heading": "Livelli di Fiducia",
                "create_trust_level_button": "Crea Nuovo Livello di Fiducia",
                "instructions_header": "Istruzioni",
                "instructions_text": "<li>I livelli di fiducia consentono di gestire automaticamente l'appartenenza ad un gruppo in base all'attività degli utenti.</li>\n<li>Ogni livello di fiducia definisce i criteri che devono essere soddisfatti (ad es. Discussioni avviate, post pubblicati, ecc.) E un gruppo da assegnare.</li>\n<li>Gli utenti vengono aggiunti automaticamente ai gruppi per tutti i livelli di fiducia per i quali si qualificano quando effettuano l'accesso.</li>\n<li>Poiché questi gruppi vengono gestiti automaticamente, si consiglia di mantenere un set separato di gruppi per i livelli di fiducia.</li>\n<li>Se elimini un livello di fiducia, dovresti eliminare anche il gruppo associato; in caso contrario, gli utenti in quel livello di fiducia rimarranno in quel gruppo.</li>\n<li>Per evitare errori, non è possibile aggiornare il gruppo di un livello di attendibilità dopo che è stato creato.</li>\n<li>Eventuali metriche lasciate disattivate non verranno conteggiate. Se tutte le metriche sono disabilitate per un determinato livello di affidabilità, TUTTI gli utenti riceveranno quel livello.</li>\n<li>Se un gruppo è gestito da più livelli di fiducia, l'utente verrà aggiunto al gruppo purché si trovi in almeno uno di questi livelli.</li>\n"
            }
        },
        "forum": {
            "edit_user": {
                "trust_levels_heading": "Livelli di Fiducia",
                "trust_level_item": "<badge></badge> {level} (Gestisce il gruppo: {groupName})",
                "trust_levels_not_editable": "I livelli di fiducia e i gruppi gestiti da livelli di fiducia non possono essere modificati manualmente per evitare incongruenze."
            }
        }
    }
}
