{
    "fof-stopforumspam": {
        "admin": {
            "settings": {
                "introduction": "Controlla le registrazioni dei nuovi utenti nel database di <a>StopForumSpam</a>. Se vengono raggiunte le soglie di <code>fiducia</code> o di <code>frequenza</code>, all'utente viene impedito di completare la registrazione sul tuo forum.\n\nÈ supportato anche il registro SSO tramite <code>fof/oauth</code> e <code>fof/passport</code>. Altri provider SSO dovrebbero funzionare, ma non sono testati.\n",
                "username_label": "Controllo Spam Nome Utente",
                "ip_label": "Controllo Spam indirizzo IP",
                "email_label": "Controllo Spam Email",
                "frequency_label": "Soglia",
                "frequency_help": "Il numero di segnalazioni di spam tra tutti i controlli abilitati che innescano il filtro antispam.\nEs: se l'e-mail ha 1 hit e l'ip ha 2 hit, ci saranno 3 hit in totale. Se la soglia è impostata su 3 o meno, impediremo la registrazione.\n",
                "api_key_label": "Chiave API",
                "api_key_text": "Hai abilitato fof/spamblock, ora hai la possibilità di segnalare gli spammer a StopForumSpam per mantenere libera la comunità del forum dallo spam.",
                "api_key_instructions_text": "<register> Iscriviti a StopForumSpam </register>. Dopo dovrai <key> richiedere una chiave API </key>.",
                "regional_endpoint_label": "Accesso Geografico",
                "regional_endpoint_help": "Per impostazione predefinita, indirizzeremo la ricerca al server regionale più vicino per fornire la risposta più rapida. Se desideri limitare il traffico a una regione specifica, ad esempio per la conformità alle normative sulla privacy dell'azienda o del paese, puoi forzare una connessione a una regione specifica.",
                "region_closest_label": "Più vicina",
                "region_europe_label": "Europa",
                "region_us_label": "Stati Uniti",
                "confidence_label": "Fiducia",
                "confidence_help": "Il punteggio di fiducia è un indicatore efficace contro le attività indesiderate. Imposta il tuo livello di fiducia in percentuale. Se il campo è uguale o superiore a questa cifra, la registrazione verrà bloccata, indipendentemente dal test di 'frequenza' di cui sopra.",
                "email_hash_label": "Usa email con hash",
                "email_hash_help": "Passa un hash MD5 dell'indirizzo e-mail se desideri non passare l'indirizzo e-mail stesso. Questo metodo ignora tutte le liste nere, la normalizzazione e i controlli di bypass dell'offuscamento.",
                "title": "FriendsOfFlarum Stop Forum Spam",
                "frequency_text": "Il numero di segnalazioni di spam tra tutti i controlli abilitati che faranno scattare il filtro antispam.",
                "frequency_example_text": "Es: se l'email ha 1 hit e l'IP ha 2 hit, ci saranno 3 hit in totale. Se la soglia è impostata su 3 o meno, impedirà la registrazione."
            }
        },
        "forum": {
            "message": {
                "spam": "Le tue informazioni sono state contrassegnate come spam."
            }
        },
        "api": {
            "error": {
                "unknown": "Impossibile segnalare l'utente a StopForumSpam."
            }
        }
    }
}
