{
    "first-visit-indexpage": {
        "forum": {
            "title": "Regole del Forum...",
            "alert-message": "",
            "accept-rules": "",
            "app-title": "",
            "warning-title": "Attenzione - Devi accettare queste regole per postare sul forum!.",
            "warning-text": "Queste regole sono divulgate per chiarire le varie responsabilità di tutti i membri del forum. Devono essere rispettate da tutti per garantire che tutto funzioni senza intoppi e offra un'esperienza divertente e produttiva a tutti i membri del forum ed ai visitatori.",
            "agree-button": "Accetto...",
            "general-rules": "Regole Generali",
            "general-rules-text": "<p>Rimani sempre rispettoso nei confronti degli altri membri</p>\n<p>Tutti i post devono essere professionali e cortesi. Hai tutto il diritto di non essere d'accordo con \nqualche utente della comunità e puoi sempre spiegare il tuo punto di vista.</p>\n<p>Tuttavia, non sei libero di attaccare, denigrare, insultare o sminuire gli utenti o il\nloro diverso modo di pensare. Non importa quale titolo o potere detieni in questo forum,\nci si aspetta che tutti siano trattati in egual maniera.</p>\n",
            "posting-rules": "Post e Discussioni",
            "posting-rules-text": "<p>Sii <strong>DESCRITTIVO</strong> nei titoli dei thread e non utilizzare nomi \"generici\".</p>\n<p><strong>IL TITOLO</strong> serve a chiunque per capire l'argomento della discussione! Fai un breve riassunto del tuo problema nell'argomento.\n(Non menzionare utenti non necessari per attirare l'attenzione, spesso non la si ottiene e infastidisce solo le persone).</p>\n<p>Ecco un ottimo elenco di argomenti che <strong>NON DEVI POSTARE</strong> :\nAiutami, ciao, molto urgente, ho una domanda, ho un problema e simili.</p>\n",
            "spam": "Spam e contenuti promozionali",
            "spam-text": "<p>No spam/pubblicità/autopromozione nei forum.</p>\n<p>Questo forum definisce lo spam come pubblicità non richiesta per beni, servizi e/o altro\nsiti web o post con contenuti scarsi o completamente non correlati. Non spammare i forum con\nlink al tuo sito o prodotto, e non cercare di auto-promuovere il tuo sito web, attività o forum, ecc.\nLo spamming include anche l'invio di messaggi privati agli utenti.</p>\n<p>I link al tuo sito web sono consentiti solo nella biografia del profilo.</p>\n",
            "copyright": "Copyright, contenuti offensiti, link e immagini",
            "copyright-text": "<p>È vietato fornire o chiedere informazioni su come ottenere illegalmente materiale protetto da copyright.</p>\n<p>Qualsiasi materiale che costituisca diffamazione, molestia o abuso è severamente vietato.\nMateriale sessualmente esplicito o in altro modo osceno, razzista o altrimenti eccessivamente discriminatorio\nnon verrà tollerato in questo forum. Ciò include le immagini degli avatar o simili. Usa il buon senso durante la pubblicazione.</p>\n",
            "rule-break": "Cosa succede se non rispetto queste regole?",
            "rule-break-text": "<p>Se infrangi una regola, verrai avvisato o bannato. Il ban del tuo account utente potrebbe\nessere temporaneo o permanente (a discrezione dei moderatori). Gli amministratori e i moderatori hanno anche il diritto di modificare, eliminare,\nspostare o chiudere qualsiasi thread o post qualora lo si ritenga necessario, senza preavviso.</p>\n"
        }
    }
}
