{
    "askvortsov-pwa": {
        "admin": {
            "nav": {
                "pwa_button": "პროგრესული ვებ აპი",
                "pwa_text": "დააკონფიგურირეთ Flarum, რომ იმუშაოს როგორც პროგრესული ვებ–აპი, ინსტალაცია მობილურ მოწყობილობებზე."
            },
            "pwa": {
                "about": {
                    "description_text": "აღწერილობის დაყენება შეგიძლიათ თქვენი ადმინისტრატორის დაფის „Basics“ გვერდზე.",
                    "name_text": "შეიყვანეთ გრძელი სახელი, რომელიც უნდა გამოიყენოთ თქვენს PWA-ში.",
                    "heading": "შესახებ",
                    "short_name_text": "შეგიძლიათ დააყენოთ მოკლე სახელი 'Basics' გვერდზე თქვენს ადმინისტრატორის დაფაზე."
                },
                "colors": {
                    "heading": "ფერები",
                    "background_color_text": "ეს გამოიყენება როგორც შემცვლელი ფერადი Splash ეკრანისთვის, რომელიც ნაჩვენებია თქვენი PWA- ს ჩატვირთვისას. ის არ გამოიყენება, როდესაც აპი უკვე ჩატვირთულია.",
                    "theme_color_text": "ამ ფერს ზოგჯერ იყენებენ მოწყობილობები თქვენი აპლიკაციის ჩვენებისას, მაგალითად, Android–ის task switcher-ისას, როგორც ფერი, რომელიც გარშემორტყმულია საიტზე. ამის დაყენება შეგიძლიათ პირველადი თემის შეცვლით თქვენი ადმინისტრატორის დაფის 'Appearance' გვერდზე."
                },
                "maintenance": {
                    "heading": "",
                    "debug_label": ""
                },
                "heading": "პროგრესული ვებ აპლიკაციის კონფიგურაცია",
                "text": "დააკონფიგურირეთ თქვენი Flarum საიტი, რომ იმუშაოს როგორც პროგრესული ვებ – აპი! გთხოვთ გაითვალისწინოთ, რომ ეს თქვენს საიტს ავტომატურად არ აყენებს აპლიკაციების მაღაზიაში. ამის ნაცვლად, ეს ნიშნავს, რომ მომხმარებლებს აქვთ თქვენი სახლის ეკრანის დამატება. ჩვენ გთავაზობთ სტატუსის შემოწმებას, თუმცა ამის შესამოწმებლად საუკეთესო გზაა მისი დაინსტალირება (მოძებნეთ Google- ში ინსტრუქციები, თუ როგორ უნდა დააყენოთ პროგრესული ვებ აპლიკაციები). ასევე, გახსოვდეთ, რომ დააყენოთ  PWA' popup აკონტროლებენ ბრაუზერებს და მათი ჩართვა არ შეუძლიათ დეველოპერებს/ადმინისტრატორებს/პროგრამებს. გირჩევთ შეიტანოთ ინსტრუქცია, თუ როგორ უნდა დააყენოთ PWA თქვენი საიტის დოკუმენტაციაში.",
                "status_check_heading": "სტატუსის შემოწმება",
                "logo_heading": "ლოგოები და აიქონები",
                "logo_text": "თქვენ უნდა ატვირთოთ მინიმუმ ერთი ლოგო, რომ თქვენი პროგრესული ვებ აპი იყოს ინსტალირებული. გთხოვთ გაითვალისწინოთ, რომ ყველა ლოგო უნდა იყოს კვადრატული; თუ ისინი არ არიან ამ ფორმის, შესაძლოა შეიცვალოს და გაჭიმული გახდეს.\n\nქვემოთ მოცემულია ზომის მრავალი ვარიანტი. გირჩევთ, ლოგო ატვირთოთ რაც შეიძლება დიდი ზომის: ეს მხარს უჭერს უფრო მეტ მოწყობილობას.\n\nგთხოვთ გაითვალისწინოთ, რომ შეგიძლიათ შეიტანოთ 1 დიდი ლოგო მცირე ლოგოების შესატანებში. მაგალითად, შეგიძლიათ ატვირთოთ 1000px x 1000px ლოგო ქვემოთ მოცემულ ყველა ფაილში. ამასთან, თუ შეეცდებით 50px x 50px ლოგო ატვირთოთ 512x512 შენატანში, ის ძალიან გაიჭიმება.\n",
                "logo_size_text": "ატვირთეთ ლოგო, რომელიც მასშტაბირდება {size} პიქსელი {size} პიქსელთან.",
                "submit_button": "პარამეტრების შენახვა",
                "refreshed_message": "PWA კონფიგურაცია განახლდა წარმატებით."
            },
            "status": {
                "config_no_https": "თქვენს config.php ფაილში url არ იყენებს HTTPS. პროგრესული ვებ–პროგრამების მუშაობისთვის საჭიროა HTTPS.",
                "possible_https_disabled": "თქვენი საიტი შეიძლება არ მუშაობს HTTPS- ზე. თუ ეს არის, უგულებელყოფს ამას. თუ გაითვალისწინეთ, რომ პროგრესული ვებ–პროგრამების მუშაობისთვის საჭიროა HTTPS.",
                "no_logo": "თქვენი აპის მუშაობისთვის უნდა ატვირთოთ მინიმუმ ერთი ლოგო, ზომით მინიმუმ 196 პიქსელი.",
                "no_name": "თქვენ უნდა მიუთითოთ თქვენი აპის სრული სახელი.",
                "push_needs_gmp_and_web_push": "Gmp PHP გაფართოება და minishlink/web-push ბიბლიოთეკა (კომპოზიტორი მოითხოვს minishlink /web-push) უნდა იყოს ჩართული push შეტყობინებების მუშაობისთვის.",
                "success": "პოტენციური შეცდომები ვერ მოიძებნა!"
            }
        },
        "forum": {
            "alerts": {
                "optin": "თქვენ ჩართეთ push შეტყობინებები, მაგრამ არ დაგიკონფიგურებიათ ეს მოწყობილობა.",
                "optin_button": "კონფიგურაცია"
            },
            "discussion_controls": {
                "share_button": "გაზიარება"
            },
            "post_controls": {
                "share_button": "გაზიარება",
                "share_api": {
                    "title": "{username}'(ი)ს პასუხი {title} -ზე"
                }
            },
            "user_controls": {
                "share_button": "გაზიარება"
            },
            "settings": {
                "push_header": "Push",
                "pwa_notifications": {
                    "access_default": "ბრაუზერის შეზღუდვების გამო, თქვენ უნდა აირჩიოთ მონაწილეობა ამ მოწყობილობაზე push შეტყობინებების მისაღებად.",
                    "access_default_button": "უარი თქვით",
                    "access_denied": "თქვენ უნდა მოირგოთ თქვენი ბრაუზერის პარამეტრები, რომ მიიღოთ ამ მოწყობილობაზე push შეტყობინებები.",
                    "access_denied_button": "ისწავლეთ როგორ",
                    "no_browser_support": "ეს ბრაუზერი მხარს არ უჭერს push შეტყობინებებს პროგრესული ვებ აპებისთვის.",
                    "no_browser_support_button": "მეტის შესწავლა"
                }
            }
        }
    }
}
