{
    "core": {
        "admin": {
            "appearance": {
                "colors_text": "Wählen Sie zwei Farben, um den Grundton des Forums zu ändern. Die erste Farbe dient für die Akzente, die zweite für die Hintergrundelemente.",
                "description": "Verändern Sie die Farbe, das Logo und weitere Variablen des Forums.",
                "enter_hex_message": "Geben Sie eine Farbe im Hexadezimalformat ein.",
                "favicon_text": "Laden Sie ein Bild hoch, welches als Favicon für das Forum verwendet wird.",
                "logo_heading": "Firmenzeichen",
                "logo_text": "Laden Sie ein Logo hoch, welches anstelle des Forum-Titels angezeigt wird."
            },
            "basics": {
                "description": "Legen Sie den Forentitel, die Sprache und weitere Grundeinstellungen fest.",
                "display_name_text": "Wählen Sie den Treiber, der verwendet wird, um den Anzeigenamen der Benutzer zu bestimmen. Standardmäßig wird der Benutzername angezeigt.",
                "home_page_text": "Wählen Sie die Seite aus, die Benutzer beim Besuch des Forums zuerst sehen.",
                "slug_driver_text": "Wählen Sie den Treiber, welcher die Foren-URLs mit einem \"Slug\" ausstattet.",
                "welcome_banner_text": "Legen Sie den Text fest, der auf der Seite \"Alle Diskussionen\" erscheint, um Besucher zu begrüßen."
            },
            "dashboard": {
                "description": "Ihr Forum auf einen Blick.",
                "io_error_message": "Es konnte nicht in das Dateisystem geschrieben werden. Überprüfen Sie die Berechtigungen Ihres Dateisystems und versuchen Sie es erneut. Oder versuchen Sie es über die Kommandozeile auszuführen."
            },
            "debug-warning": {
                "detail": "Sofern der <code>Debugmodus</code> aktiv ist, wird Flarum seine <code>JavaScript</code> und <code>CSS</code> Ressourcen bei jedem Seitenabruf neu generieren und könnte zudem potenziell weitere Informationen preisgeben, etwa Datenbankgeheimnisse, Umgebungsvariablen usw.\n\nEs wird dringendst empfohlen, den <code>debug</code> in Ihrer <code>config.php</code> Datei in einem Produktionskontext zu deaktivieren. Konsultieren Sie bitte die <link>Flarum Dokumentation</link> für zusätzliche Informationen.\n"
            },
            "edit_css": {
                "customize_text": "Passen Sie das Erscheinungsbild Ihres Forums mithilfe eigenen Less/CSS-Code an, welcher zusätzlich zu Flarums <a>Standard-Design</a> angewendet wird."
            },
            "edit_group": {
                "delete_confirmation": "Sind Sie sicher, dass Sie diese Gruppe löschen möchten? Die Mitglieder der Gruppe werden nicht gelöscht."
            },
            "email": {
                "description": "Konfigurieren Sie den E-Mail-Treiber, die Parameter und die zu verwendenden Adressen für den Versand von E-Mails.",
                "not_sending_message": "Flarum sendet derzeit keine E-Mails. Bitte überprüfen Sie die Korrektheit ihrer E-Mail-Konfiguration.",
                "send_test_mail_text": "Versenden Sie eine E-Mail mit der gegebenen Konfiguration an Ihre Adresse, {email}."
            },
            "extension": {
                "confirm_purge": "Die Bereinigung entfernt sämtliche Datenbankeinträge und Assets, die sich auf die Erweiterung beziehen. Die Deinstallation der Erweiterung wird nicht ausgeführt; dies muss über Composer geschehen. Sind Sie sicher, dass Sie fortfahren möchten?",
                "confirm_uninstall": "Die Deinstallation entfernt alle Datenbankeinträge und Assets, die mit der Erweiterung in Verbindung stehen. Sind Sie sicher, dass Sie fortfahren möchten?",
                "enable_to_see": "Aktivieren Sie die Erweiterung, um Einstellungen einsehen und verändern zu können."
            },
            "loading": {
                "title": "Bitte warten Sie…"
            },
            "settings": {
                "saved_message": "Ihre Änderungen wurden gespeichert."
            },
            "users": {
                "description": "Eine paginierte Liste aller Benutzer in Ihrem Forum."
            }
        },
        "email": {
            "activate_account": {
                "body": "Sehr geehrte/r {username},\n\njemand (hoffentlich Sie!) hat sich im Forum {forum} mit dieser E-Mail-Adresse registriert.\n\nFalls Sie es waren, folgen Sie bitte dem untenstehenden Link, um Ihr Konto zu aktivieren:\n{url}\n\nFalls Sie es nicht waren, ignorieren Sie bitte diese E-Mail.\n",
                "subject": "Aktivierung Ihres neuen Kontos"
            },
            "confirm_email": {
                "body": "Sehr geehrte/r {username},\n\njemand (hoffentlich Sie!) hat die E-Mail-Adresse im Forum {forum} geändert.\n\nFalls Sie es waren, folgen Sie bitte dem untenstehenden Link, um die neue E-Mail-Adresse zu bestätigen:\n{url}\n\nFalls Sie es nicht waren, ignorieren Sie bitte diese E-Mail.\n",
                "subject": "Bestätigung Ihrer E-Mail-Adresse"
            },
            "reset_password": {
                "body": "Sehr geehrte/r {username},\n\njemand (hoffentlich Sie!) hat das Zurücksetzen des Passwortes im Forum {forum} beantragt.\n\nFalls Sie es waren, folgen Sie bitte dem untenstehenden Link, um ein neues Passwort festzulegen:\n{url}\n\nFalls Sie es nicht waren, ignorieren Sie bitte diese E-Mail.\n",
                "subject": "Zurücksetzung Ihres Passwortes"
            },
            "send_test": {
                "body": "Sehr geehrte/r {username},\n\ndies ist eine Test-E-Mail zur Überprüfung, ob Ihre Flarum-E-Mail-Konfiguration korrekt funktioniert.\n\nFalls Sie es waren, dann zeigt diese E-Mail an, dass Ihre Konfiguration funktioniert.\n\nFalls Sie es nicht waren, ignorieren Sie bitte diese E-Mail.\n"
            }
        },
        "forum": {
            "change_email": {
                "incorrect_password_message": "Das von Ihnen eingegebene Passwort ist falsch."
            },
            "change_password": {
                "text": "Klicken Sie auf die Schaltfläche, um einen Link zum Zurücksetzen Ihres Passwortes zu erhalten."
            },
            "composer_discussion": {
                "body_placeholder": "Verfassen Sie Ihren Beitrag…",
                "discard_confirmation": "Ihr Beitrag wurde nicht versendet. Möchten Sie ihn verwerfen?"
            },
            "composer_edit": {
                "discard_confirmation": "Ihre Änderungen wurden nicht übernommen. Möchten Sie sie verwerfen?",
                "edited_message": "Ihre Änderungen wurden gespeichert."
            },
            "composer_reply": {
                "discard_confirmation": "Ihre Antwort wurde nicht versendet. Möchten Sie sie verwerfen?",
                "posted_message": "Ihre Antwort wurde versendet."
            },
            "discussion_controls": {
                "cannot_reply_text": "Sie haben keine Berechtigung, auf diese Diskussion zu antworten.",
                "delete_confirmation": "Möchten Sie diese Diskussion wirklich löschen?"
            },
            "discussion_list": {
                "empty_text": "Es gibt noch keine Diskussionen in diesem Forum.",
                "unread_replies_a11y_label": "{count, plural, one {# ungelesene Antwort} other {# ungelesene Antworten}}. Markieren Sie ungelesene {count, plural, one {Antwort} other {Antworten}} als gelesen."
            },
            "forgot_password": {
                "email_sent_message": "Falls die von Ihnen eingegebene E-Mail-Adresse auf dieser Seite registriert ist, senden wir Ihnen eine E-Mail mit einem Link, über den Sie Ihr Passwort zurücksetzen können. Bitte prüfen Sie auch Ihren Spam-Ordner, falls die E-Mail nicht innerhalb der nächsten Minuten ankommt.",
                "text": "Bitte geben Sie Ihre E-Mail-Adresse ein, um einen Link zum Zurücksetzen Ihres Passwortes zu erhalten."
            },
            "index": {
                "mark_all_as_read_confirmation": "Sind Sie sicher, dass Sie alle Diskussionen als gelesen markieren möchten?"
            },
            "notifications": {
                "delete_all_confirm": "Sind Sie sicher, dass Sie alle Benachrichtigungen löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden."
            },
            "post_controls": {
                "delete_confirmation": "Sind Sie sicher, dass Sie diesen Beitrag dauerhaft löschen möchten? Dies kann nicht rückgängig gemacht werden.",
                "hide_confirmation": "Sind Sie sicher, dass Sie diesen Beitrag löschen möchten?"
            },
            "security": {
                "cannot_terminate_current_session": "Die derzeit aktive Sitzung kann nicht beendet werden. Bitte melden Sie sich stattdessen ab.",
                "session_termination_failed": "Beim Beenden Ihrer Sitzungen ist ein Fehler aufgetreten."
            },
            "settings": {
                "notification_checkbox_a11y_label_template": "Erhalten Sie \"{description}\" Benachrichtigungen über {method}",
                "notify_discussion_renamed_label": "Wenn jemand eine Diskussion ändert, die Sie gestartet haben"
            },
            "user": {
                "avatar_upload_tooltip": "Laden Sie einen neuen Avatar hoch"
            }
        },
        "lib": {
            "edit_user": {
                "nothing_available": "Sie sind nicht berechtigt, diesen Benutzer zu bearbeiten."
            },
            "error": {
                "circular_dependencies_message": "Zirkuläre Abhängigkeiten erkannt: {extensions}. Prozess abgebrochen. Bitte deaktivieren Sie eine der Erweiterungen und versuchen Sie es erneut.",
                "extension_initialiation_failed_message": "{extension} konnte nicht initialisiert werden, überprüfen Sie die Browser-Konsole für weitere Informationen.",
                "generic_cross_origin_message": "Es tut uns leid! Bei einer Cross-Origin-Anfrage ist ein Problem aufgetreten. Bitte laden Sie die Seite neu und versuchen Sie es erneut.",
                "generic_message": "Es tut uns leid! Es ist ein Fehler aufgetreten. Bitte laden Sie die Seite neu und versuchen Sie es erneut.",
                "permission_denied_message": "Sie haben keine Berechtigung, dies zu tun.",
                "rate_limit_exceeded_message": "Bitte nicht so schnell. Versuchen Sie es in Kürze erneut.",
                "render_failed_message": "Beim Anzeigen dieses Inhalts ist ein Fehler aufgetreten. Wenn Sie ein Benutzer sind, versuchen Sie es später erneut. Wenn Sie ein Administrator sind, überprüfen Sie Ihre Flarum-Protokolldateien, um weitere Informationen zu erhalten."
            }
        },
        "ref": {
            "confirmation_email_sent": "Wir haben eine Bestätigungs-E-Mail an {email} gesendet. Bitte überprüfen Sie Ihren Spam-Ordner, falls Sie keine E-Mail erhalten haben.",
            "generic_confirmation_message": "Sind Sie sicher, dass Sie fortfahren möchten? Diese Aktion kann nicht rückgängig gemacht werden.",
            "icon_text": "Geben Sie den Namen des <a>FontAwesome</a>-Symbols ein, aber <em>mit</em> dem Präfix <code>fas fa-</code>.",
            "reset_your_password": "Ihr Passwort zurücksetzen",
            "you": "Sie"
        },
        "views": {
            "confirm_email": {
                "text": "Klicken Sie auf die Schaltfläche unten, um die E-Mail-Adresse Ihres Kontos zu bestätigen."
            },
            "error": {
                "csrf_token_mismatch": "Sie waren zu lange inaktiv.",
                "csrf_token_mismatch_return_link": "Bitte gehen Sie zurück und versuchen Sie es erneut",
                "not_authenticated": "Sie haben keine Berechtigung, auf diese Seite zuzugreifen. Bitte versuchen Sie sich erneut anzumelden.",
                "permission_denied": "Sie haben keine Berechtigung, auf diese Seite zuzugreifen."
            },
            "log_out": {
                "log_out_confirmation": "Sind Sie sicher, dass Sie sich von {forum} abmelden möchten?"
            }
        }
    }
}
