{
    "acpl-lscache": {
        "admin": {
            "cache_enabled_label": "LSCache қосу",
            "cache_enabled_help": "",
            "public_cache_ttl_label": "Әдепкі қолжетімді жалпы кэш TTL",
            "public_cache_ttl_help": "Жалпы беттердің қанша секундта кэштелетінін көрсетіңіз. Әдепкі мән - 300 секунд.",
            "clearing_cache_listener_label": "Flarum кэші тазартылған кезде LSCache файлын тазалаңыз",
            "serve_stale_label": "Ескірген Қызмет ету",
            "serve_stale_help": "ҚОСЫЛҒАН болса, кэштелген беттің ескірген көшірмесі кэштің жаңа көшірмесі қолжетімді болғанша келушілерге көрсетіледі. Келесі сапарларда сервер жүктемесін азайтады. ӨШІРІЛГЕН болса, келушілер күтіп тұрғанда бет динамикалық түрде жасалады. Дизайн бойынша бұл опция ескірген мазмұнға қызмет ете алады. Егер сізге ҰНАМАСА, бұл опцияны қоспаңыз.",
            "purge_on_discussion_update_label": "Талқылауды немесе жазбаны жаңарту кезінде URL мекенжайларын немесе тегтерді жойыңыз",
            "purge_on_discussion_update_help": "Әр жолға бір URL немесе тег көрсетіңіз. Url <code>/</code> арқылы басталуы керек, мысалы: <code>/rankings</code> және кэш Тег <code>tag=</code> деп басталуы керек, мысалы: <code>teg=рейтинг</code>. Бұл кеңейтім әрбір бағытты тегтейді және мысалы, сізде тазартқыңыз келетін көптеген маршруттар болса, маршруттарды белгілейтін тұрақты өрнекпен .htaccess ережесін қосқан дұрыс және мұнда параметрлерде тек осы тегті енгізіңіз. . Бұл әдіс әлдеқайда жылдамырақ болады. <a>Толығырақ</a>. Әдепкі бойынша, басты бетке арналған кэш, сондай-ақ жаңартылған талқылауларға арналған кэш тазартылады.",
            "cache_exclude_label": "Жолдарды кэштемеңіз",
            "cache_exclude_help": "Осы жолдарды қамтитын жолдар кэштелмейді. Мысалы, <code>/mypath/mypage?aa=bb</code> үшін мұнда <code>mypage?aa=</code> қолдануға болады. Басын сәйкестендіру үшін элементтің басына <code>^</code> қосыңыз. Дәл сәйкестікті жасау үшін URL мекенжайының соңына <code>$</code> қосыңыз. Әр жолға бір.",
            "drop_qs_label": "",
            "drop_qs_help": "",
            "purge_all": "Барлық LSCache файлын тазалаңыз",
            "purge_all_success": "Барлық LSCache жазбаларын тазарту үшін хабарландырылған LiteSpeed веб-сервері"
        }
    }
}
