{
    "clarkwinkelmann-scout": {
        "admin": {
            "setting": {
                "driver": "Pilote",
                "driverOption": {
                    "null": "Néant",
                    "algolia": "Algolia",
                    "meilisearch": "Meilisearch",
                    "tntsearch": "TNTSearch"
                },
                "prefix": "Préfixe du nom de l'index (facultatif)",
                "queue": "Traiter les mises à jour d'index dans la file d'attente",
                "queueHelp": "Ce paramètre n'a d'effet que si un pilote de file d'attente asynchrone est configuré dans Flarum.",
                "limit": "Limite des résultats par défaut",
                "limitPlaceholder": "Automatique",
                "limitHelp": "Cela annule le nombre de résultats demandés au moteur de recherche et influence le nombre de pages de résultats qui peuvent être générées (la limite compte également le contenu que l'utilisateur ne pourra pas voir). Certains moteurs peuvent nécessiter une configuration supplémentaire pour modifier le maximum autorisé.\n",
                "queryMinLength": "Longueur minimale des requêtes pour les suggestions",
                "queryMinLengthPlaceholder": "Automatique",
                "queryMinLengthHelp": "Ce paramètre n'affecte que la liste déroulante des suggestions de l'entrée de recherche dans l'en-tête. Flarum a une longueur de requête par défaut de 3 caractères avant de récupérer les suggestions, que vous pouvez remplacer par ce paramètre. La page complète de résultats de recherche n'a jamais de longueur de requête minimale. Vous devez vider le cache après avoir modifié cette valeur.\n",
                "algoliaId": "Identifiant d'Algolia",
                "algoliaSecret": "Clé secrète d'Algolia",
                "algoliaConnectTimeout": "Délai de connexion d'Algolia (facultatif)",
                "algoliaReadTimeout": "Délai de lecture d'Algolia (facultatif)",
                "algoliaWriteTimeout": "Délai d'écriture d'Algolia (facultatif)",
                "meilisearchHost": "Hôte de Meilisearch",
                "meilisearchKey": "Clé de Meilisearch",
                "tntsearchMaxDocs": "Documents maximum de TNTSearch (facultatif, il s'agit du nombre maximum de résultats)",
                "tntsearchFuzziness": "Caractère flou de TNTSearch (erreurs de frappe ou correspondance des variations)",
                "tntsearchFuzzyDistance": "Distance de Levenshtein du caractère flou de TNTSearch (facultatif)",
                "tntsearchFuzzyPrefixLength": "Longueur du préfixe du caractère flou de TNTSearch (facultatif)",
                "tntsearchFuzzyMaxExpansions": "Extensions maximales du caractère flou de TNTSearch (facultatif)"
            }
        }
    }
}
