{
    "ianm-gravatar": {
        "admin": {
            "settings": {
                "proxy": {
                    "title": "Proxy les gravatars",
                    "helptext": "Par défaut, les URL de gravatar sont récupérées directement depuis gravatar.com. Cela permet à toutes les demandes de gravatar d'être servies directement par le forum lui-même."
                },
                "replace-flarum-custom": {
                    "title": "Remplacer les avatars personnalisés téléchargés sur le forum",
                    "helptext": "Remplacez les avatars personnalisés déjà téléchargés sur le forum par un Gravatar"
                },
                "defaults": {
                    "title": "Valeurs par défaut",
                    "helptext": "Que se passe-t-il lorsqu'une adresse courriel n'a pas d'image Gravatar correspondante ? Gravatar a un certain nombre d'options intégrées que vous pouvez utiliser par défaut. La plupart d'entre eux fonctionnent en prenant le hachage de courriel demandé et en l'utilisant pour générer une image thématique unique à cette adresse courriel.",
                    "mp_label": "mp : (personne-mystère) une silhouette simple de style dessin animé d'une personne (ne varie pas selon le hachage du courriel)",
                    "identicon_label": "identicon : un motif géométrique basé sur un hachage du courriel",
                    "monsterid_label": "monsterid : un 'monstre' généré avec différentes couleurs, visages, etc.",
                    "wavatar_label": "wavatar : visages générés avec des caractéristiques et des arrière-plans différents",
                    "retro_label": "rétro : superbes visages pixelisés de style arcade générés en 8 bits",
                    "robohash_label": "robohash : un robot généré avec différentes couleurs, visages, etc."
                },
                "rating": {
                    "title": "Notation",
                    "helptext": "Gravatar permet aux utilisateurs d'auto-évaluer leurs images afin qu'ils puissent indiquer si une image est appropriée pour un certain public. Par défaut, seules les images classées « G » sont affichées, sauf si vous indiquez que vous souhaitez voir des notes plus élevées. Vous pouvez spécifier l'un des classements suivants pour demander des images jusqu'à ce classement y compris.",
                    "g_label": "g : adapté à l'affichage sur tous les sites Web avec tout type d'audience",
                    "pg_label": "pg : peut contenir des gestes grossiers, des individus vêtus de manière provocante, des jurons mineurs ou de la violence légère",
                    "r_label": "r : peut contenir des choses telles que des grossièretés, une violence intense, de la nudité ou la consommation de drogues dures",
                    "x_label": "x : peut contenir des images sexuelles hardcore ou de la violence extrêmement dérangeante"
                },
                "force-default": {
                    "title": "Forcer la valeur par défaut",
                    "helptext": "Force l'utilisation d'un ensemble de réglages par défaut, même si le hachage du courriel renvoie à un avatar personnalisé téléchargé par un utilisateur"
                }
            }
        },
        "forum": {
            "settings": {
                "edit-gravatar": "Gérer l'avatar sur gravatar.com"
            }
        }
    }
}
