{
    "acpl-lscache": {
        "admin": {
            "public_cache_ttl_label": "Alapértelmezett nyilvános gyorsítótár TTL-je",
            "public_cache_ttl_help": "Adja meg, hogy hány másodpercig legyenek a nyilvános lapok gyorsítótárazva. Az alapértelmezett érték 300 másodperc.",
            "clearing_cache_listener_label": "Az LSCache tisztítása a Flarum gyorsítótárának törlésekor",
            "serve_stale_label": "Elavult lapok kiszolgálása",
            "serve_stale_help": "Ha BE van kapcsolva, akkor a gyorsítótárazott oldal lesz megjelenítve a látogatók számára, amíg egy új másolat nem lesz elérhető. Csökkenti a kiszolgáló terhelését az egymást követő látogatások esetén. Ha KI van kapcsolva, akkor az oldal dinamikusan elő lesz állítva, míg a látogatók várakoznak. Ez a beállítás tervezetten azt okozhatja, hogy elévült tartalmat fog szolgáltatni. Ha ez nem felel meg Önnek, akkor ne kapcsolja be ezt a beállítást.",
            "purge_on_discussion_update_label": "Webcímek vagy címkék törlése, ha egy téma vagy bejegyzés frissül",
            "purge_on_discussion_update_help": "Soronként adjon meg egy webcímet vagy címkét. A webcímnek <code>/</code> karakterrel kell kezdődnie, például <code>/rankings</code>, a gyorsítórcímkének pedig <code>tag=</code> szöveggel, például <code>tag=rankings</code>. Ez a bővítmény megcímkéz minden elérési utat, így ha sok törlendő útvonala van, akkor jobb ha egy reguláris kifejezéssel leírt szabályt ad meg egy .htaccess fájlban, amely megcímkézi az elérési utakat, és itt a beállításokban csak ezt a címkét adja meg. Ez a módszer sokkal gyorsabb lesz. <a>További tudnivalók</a>. Alapértelmezetten a kezdőlap, valamint a frissített témák gyorsítótára lesz kitisztítva.",
            "cache_exclude_label": "Ne gyorsítótárazza az útvonalakat",
            "cache_exclude_help": "Az ezeket a karakterláncokat tartalmazó elérési utak nem lesznek gyorsítótárazva. Például az <code>/mypath/mypage?aa=bb</code> címhez használható a <code>mypage?aa=</code>. Az elejéhez illesztéshez adjon egy <code>^</code> karaktert az elem elé. A pontos egyezéshez adja a <code>$</code> karaktert a webcím végéhez. Soronként egyet adjon meg.",
            "purge_all": "Az összes LSCache tisztítása",
            "purge_all_success": "A LiteSpeed webkiszolgáló értesítve, hogy tisztítsa ki az LSCache összes bejegyzését"
        }
    }
}
