{
    "fof-sentry": {
        "admin": {
            "sentry_settings": "Sentry beállítások",
            "sections": {
                "general": "Általános beállítások",
                "general_help": "A Sentry DNS- és környezeti beállításainak megadása.",
                "user_context": "Felhasználói kontextus",
                "user_context_help": "Szabja meg, hogy milyen felhasználói információk legyenek elküldve a Sentry számára a hibajelentésekkel.",
                "backend_performance": "Háttérrendszer teljesítményének figyelése",
                "backend_performance_help": "Kövesse nyomon a PHP háttérrendszer teljesítményét és profilozását. Állítsa be a mintavételi gyakoriságot a pluszköltség szinten tartásához.",
                "database_monitoring": "Adatbázis-lekérdezések figyelése",
                "database_monitoring_help": "Kísérje figyelemmel az adatbázis-lekérdezések teljesítményét, észlelje a lassú lekérdezéseket és az N+1 problémákat. Csak akkor aktív, ha a háttérrendszer teljesítményének figyelése engedélyezve van.",
                "frontend_monitoring": "Felhasználói felület (JavaScript) figyelése",
                "frontend_monitoring_help": "Kövesse a JavaScript-hibákat és a felület teljesítményét. Vegye figyelembe, hogy egyes funkciók növelik a csomag méretét."
            },
            "settings": {
                "dsn_label": "Sentry DSN",
                "dsn_help": "A Sentry adatforrás neve – az elsődleges kapcsolati webcím a felhasználói felület és a háttérrendszer hibajelentéséhez. A Sentry projekt beállításaiban találja. Fontos: ha továbbítási DSN-t használ, akkor kapcsolja ki a „Felhasználói visszajelzés” lehetőséget, mert az közvetlen Sentry-hozzáférést igényel.",
                "dsn_backend_label": "Sentry DSN (csak háttérszolgáltatás)",
                "dsn_backend_help": "Nem kötelező, különálló DSN, csak a háttérrendszer (PHP) hibáihoz. Ez akkor hasznos, ha más projektet szeretne használni a háttérrendszer hibáihoz, ha továbbítót használ a jobb teljesítmény érdekében, vagy ha külön akarja választani a felület és a háttérrendszer követését. Ha nincs megadva, akkor az elsődleges DSN lesz használva mindkettőhöz.",
                "environment_label": "Sentry környezet",
                "environment_help": "Az összes esemény címkézése a környezet nevével (például „production”, „staging”, „development”). Ez segít a hibák környezet szerinti szűrésében, és így környezetenként különböző értesítési szabályokat lehet beállítani.",
                "user_feedback_label": "Felhasználói visszajelzési párbeszédablak bekapcsolása",
                "user_feedback_help": "Ha be van kapcsolva, a felhasználók egy visszajelzési párbeszédablakot látnak, ha hibára futnak, így leírhatják, hogy mi történt. Az űrlap előre kitölti a felhasználónevüket, e-mail-címüket (ha be van kapcsolva) és a csoporttagságukat. Közvetlen kommunikációs csatornát hoz létre a hibát tapasztaló felhasználókkal. Közvetlen Sentry DSN-t igényel (nem továbbítót).",
                "send_user_emails_label": "Felhasználók e-mail-címének hozzáadása a jelentésekhez",
                "send_user_emails_help": "Ha be van kapcsolva, a felhasználó e-mail-címe szerepelni fog az összes Sentry eseményben, hogy fel lehessen venni velük a kapcsolatot, és szűrhetőek legyenek a hibáik. Adatvédelmi megfontolások: a bekapcsolás előtt olvassa át az adatvédelmi irányelveket. A felhasználóazonosító, felhasználónév és a csoportok a beállítástól függetlenül benne lesznek.",
                "monitor_performance_label": "Háttérrendszer teljesítményfigyelési aránya",
                "monitor_performance_help": "A nyomkövetendő háttérrendszerkérések százalékos aránya (0 = kikapcsolva, 100 = összes nyomkövetése). A teljesítmény-nyomkövetések tartalmazzák a kérések és válaszok idejét, az adatbázis-lekérdezéseket, és a bővítmények betöltési idejét. Javaslat: Kezdje éles környezetben 10-25%-kal, és 100%-kal a teszten. Az alacsonyabb érték csökkenti az adatmennyiséget és a Sentry költségeit.",
                "profile_rate_label": "Háttérszolgáltatás profilozási aránya",
                "profile_rate_help": "Profilozandó követett tranzakciók aránya (a figyelési arányhoz viszonyítva). Példa: Ha a figyelés = 10%, és a profilozás = 50%, akkor az összes kérés 5%-a lesz profilozva. A profilozás részletes függvényszintű teljesítményadatokat biztosít. Teljesítményre gyakorolt hatás: a profilozás pluszköltségbe kerül, és növeli a válaszidőt. Lásd a <a>Sentry optimalizációs útmutatóját</a>. {icon} <bold>Excimer bővítményt igényel (csak Linuxra érhető el). Jelenleg {icon}.</bold>",
                "javascript_label": "JavaScript-hibák jelentésének bekapcsolása",
                "javascript_help": "A fórum felhasználói felületének JavaScript-hibáinak rögzítése és jelentése a Sentry felé. Követi az el nem kapott kivételeket, az elutasított promise objektumokat, a konzolhibákat és a hálózati hibákat. Kapcsolja ki, ha csak a háttérrendszer hibáit követné.",
                "javascript_console_label": "Konzolüzenetek rögzítése kenyérmorzsaként",
                "javascript_console_help": "Kenyérmorzsaként rögzíti a A console.log, console.info, console.warn és console.error hívásokat. Így láthatja a hibákhoz vezetők eseménysorokat és követheti az összetett felhasználói interakciókat. Megjegyzés: Növeli az adatmennyiséget. Éles környezetben használja szelektíven.",
                "javascript_trace_sample_rate": "Felhasználói felület teljesítményfigyelési aránya",
                "javascript_trace_sample_rate_help": "A nyomkövetendő oldalbetöltések százalékos aránya (0 = kikapcsolva, 100 = az összes nyomkövetése). Követi az oldalbetöltési időket, az erőforrás-betöltést, az API-kéréseket és a navigáció időzítéseit. Csomagméret: ~30 kB-tal növeli. Ajánlás: élesben használjon 10-25%-ot.",
                "javascript_replays_session_sample_rate": "Munkamenet-visszajátszás mintavételi aránya",
                "javascript_replays_session_sample_rate_help": "A kezdetektől rögzítendő felhasználói munkamenetek százalékos aránya. Rögzíti az egérmozgásokat, a kattintásokat, a görgetéseket, a navigációt és az űrlap-interakciókat (a személyes adatok maszkolásával). Pontosan megfigyelheti, hogy mit tettek a felhasználók a hibák reprodukálásához. Csomagméret: ~150 kB-tal növeli. Ajánlás: a tárolási költségek miatt élesben használjon 1-5%-ot.",
                "javascript_replays_error_sample_rate": "Hiba által kiváltott visszajátszások mintavételi aránya",
                "javascript_replays_error_sample_rate_help": "Hiba esetén rögzítendő visszajátszások százalékos aránya. Hatékonyabb, mint a teljes munkamenet-visszajátszások – a hiba rögzítése előtt legfeljebb 1 perccel indul el, és a munkamenet végéig tart. Tökéletes az élesben felmerülő problémák hibakereséséhez. Csomagméret: ~150 kB-tal növeli. Ajánlás: élesben használjon 10-25%-ot.",
                "db_slow_query_threshold_label": "Lassú lekérdezési küszöbérték (ezredmásodpercben)",
                "db_slow_query_threshold_help": "A küszöbértéknél (ezredmásodperben) tovább tartó lekérdezések lassúként lesznek megjelölve, és automatikusan követve lesznek, a mintavételi aránytól függetlenül. Súlyossági szintek: Közepes (küszöb 1-2×), Magas (küszöb 2-5×), Kritikus (köszöb 5×+). Alapértelmezett: 1000 ms (1 másodperc). Az agresszívebb észleléshez csökkentse 500 ms-ra.",
                "db_n_plus_one_detection_label": "N+1 lekérdezések észlelésének bekapcsolása",
                "db_n_plus_one_detection_help": "N+1 lekérdezések automatikus észlelése az ismételt lekérdezési minták követésével. N+1 lekérdezés akkor történik, amikor a kód ugyanazt a lekérdezést futtatja ciklusban, ahelyett hogy megfelelő összekapcsolásokat és előzetes betöltést használna. Segít a jelentős teljesítménybeli szűk keresztmetszetek azonosításában.",
                "db_n_plus_one_threshold_label": "N+1 észlelés küszöbértéke",
                "db_n_plus_one_threshold_help": "A lekérdezési mintának hányszor kell ismétlődnie, hogy potenciális N+1 problémának legyen jelölve. Érzékenységi szintek: 5-10 (agresszív, lehetnek fals pozitívok), 10-20 (kiegyensúlyozott, ajánlott), 20+ (konzervatív, csak a komoly problémákat jelöli meg). Alapértelmezett: 10.",
                "db_track_bindings_label": "Lekérdezési paraméterek értékének követése",
                "db_track_bindings_help": "Valódi paraméterértékek belevétele a lekérdezések nyomkövetésébe (például „SELECT * FROM users WHERE id = ?” helyett „SELECT * FROM users WHERE id = 123”). Előnyök: láthatóak a lassú lekérdezések pontos értékei, és azonosíthatóak a problémás adatminták. Biztonsági és adatvédelmi figyelmeztetés: érzékeny felhasználói adatokat küldhet a Sentrynek. A jelszavak és az ujjlenyomatok (32+ hexadecimális karakter) automatikusan maszkolva lesznek. A hosszú karakterláncok (100+ karakter) le lesznek vágva. Bekapcsolás előtt tekintse át az adatvédelmi irányelveket. Ajánlás: csak teszt/fejlesztői környezeten kapcsolja be, élesben kapcsolja ki.",
                "db_query_sample_rate_label": "Lekérdezések mintavételi aránya",
                "db_query_sample_rate_help": "A teljesítménykövetésben nyomkövetendő adatbázis-lekérdezések százaléka (0-100%). Hatási szintek: 100% (összes lekérdezés követése, maximális láthatóság, magasabb pluszköltség), 50% (fele követése, kiegyensúlyozott), 10-25% (részhalmaz követése, alacsonyabb pluszköltség, továbbra is megfog problémákat), 0% (csak a lassú lekérdezések követése, minimális pluszköltség). Megjegyzés: a lassú lekérdezések (a fenti küszöbérték) MINDIG követve lesznek, ettől a beállítástól függetlenül. Ajánlás: használjon 10-25%-ot a nagy forgalmú webhelyekhez, hogy csökkentse a teljesítményre gyakorolt hatását, és a Sentry adatköltségeit."
            }
        }
    }
}
