{
    "askvortsov-pwa": {
        "admin": {
            "nav": {
                "pwa_button": "Progressieve web applicatie",
                "pwa_text": "Configureer Flarum als een Progressieve Webapplicatie die geïnstalleerd kan worden op telefoons."
            },
            "pwa": {
                "about": {
                    "description_label": "Beschrijving",
                    "description_text": "Je kan de beschrijving bewerken op de 'Basis' pagina in je administratiepaneel.",
                    "long_name_label": "Lange naam",
                    "long_name_text": "De naam van de webapplicatie die wordt weergegeven aan de gebruiker.",
                    "heading": "Over",
                    "short_name_label": "Korte naam",
                    "short_name_text": "De naam van de applicatie die wordt weergegeven aan de gebruiken indien er niet genoeg ruimte is voor de lange naam."
                },
                "colors": {
                    "heading": "Kleuren",
                    "background_color_label": "Achtergrondkleur",
                    "background_color_text": "Dit wordt als vervangende kleur gebruikt voor de splash-screen die wordt weergegeven als de applicatie wordt geladen. Het wordt niet gebruikt wanneer de applicatie volledig is geladen.",
                    "theme_color_label": "Themakleur",
                    "theme_color_text": "Deze kleur wordt op sommige apparaten (tijdens het gebruik van de applicatie) gebruikt om taakbalk aan te passen naar je website."
                },
                "maintenance": {
                    "heading": "Onderhoud",
                    "debug_label": "Debug modus?",
                    "debug_text": "Dit logt informatie meldingen naar `storage/logs`. Dit moet over het algemeen worden uitgeschakeld om te voorkomen dat logs onnodig worden gevuld.",
                    "reset_vapid_text": "Hierdoor worden VAPID-sleutels opnieuw gegenereerd en bestaande abonnementen die de huidige VAPID-sleutels gebruiken, worden verwijderd.",
                    "reset_vapid_confirm": "Het resetten van VAPID-sleutels verwijdert alle abonnementen die gebruikmaken van de bestaande sleutels, zodat gebruikers geen meldingen ontvangen tot de volgende keer dat ze je site bezoeken. Dit moet je alleen doen als je pushmeldingen voor het eerst instelt, of als pushmeldingen helemaal niet werken en er hierboven een waarschuwing staat over ontbrekende VAPID-sleutels.",
                    "reset_vapid_success": "De VAPID-sleutels zijn succesvol gereset. {count} abonnementen zijn gereset. Herlaad de pagina om de vernieuwde statusrapport in te zien."
                },
                "firebase_config": {
                    "heading": "Firebase",
                    "help_text": "Om ondersteuning voor pushnotificaties toe te voegen tijdens het publiceren in de Apple appstore, moet je Firebase gebruiken om notificaties toe te voegen aan je applicatie. Maak een Firebase Service Configuratie aan en upload deze hier.",
                    "see_documentation_here": "Bekijk de documentatie",
                    "upload_successful": "Je Firebase configuratie is succesvol geüpload",
                    "upload_file": "Upload bestand"
                },
                "other": {
                    "heading": "Anders",
                    "force_portrait_text": "Portret oriëntatie forceren?",
                    "push_notif_preference_default_to_email_label": "Pushvoorkeuren standaard koppelen aan e-mail?",
                    "push_notif_preference_default_to_email_text": "Als dit is ingesteld zullen pushnotificaties automatisch ingeschakeld worden voor alle type meldingen waarbij e-mailmeldingen standaard zijn ingesteld. Wanneer dit niet het geval is zijn pushmeldingen standaard uitgeschakeld voor gebruikers.",
                    "user_max_subscriptions_label": "Maximale pushnotificatie abonnementen per gebruiker",
                    "user_max_subscriptions_text": "Hoeveel pushnotificatie abonnementen mag een gebruiker hebben per keer? Wanneer een gebruiker een pushnotificatie ontvangt zal elk abonnement resulteren in een API aanvraag. Een abonnement is normaal gesproken gekoppeld aan de gebruikte browser.",
                    "window_controls_overlay_label": "Window Controls Overlay aanzetten?",
                    "window_controls_overlay_text": "Als dit is ingesteld kunnen gebruikers een meer meeslepende en native ervaring krijgen doordat de titelbalk is verborgen. Windows Control Overlay wordt wel of niet ingeschakeld aan de hand van de voorkeur van de gebruiker en capabiliteit van de browser. De titelbalk moet je aanpassen door CSS/JS toe te voegen nadat deze is ingeschakeld, anders overlappen de besturingselementen sommige elementen van de bovenste navigatiebalk van je forum en kan het venster vrijwel niet worden versleept.\n\nZie ook: <compatibilitylink>De ondersteuning van Window Controls Overlay</compatibilitylink> & <learnlink>Lees meer over Window Controls Overlay in Microsoft Learn</learnlink>\n"
                },
                "heading": "Progressieve Webapplicatie Configuratie",
                "text": "Configureer je Flarum website als een progressieve webapplicatie! Houd er rekening mee dat dit je site niet automatisch in de Appstore plaatst. In plaats daarvan betekent dit dat gebruikers een 'Toevoegen aan beginscherm' optie hebben op je site. Er zijn enkele statuscontroles beschikbaar, maar de beste manier om te testen is door het zelf uit te proberen en te installeren (zoek eventueel op Google hoe je progressieve webapplicaties kan installeren). Houd er ook rekening mee dat popups zoals 'Installeer deze PWA' wordt aangestuurd door de browser en niet kunnen worden geactiveerd door ontwikkelaars, beheerders of programma's. Ik raad je aan om instructies over hoe je de PWA kan installeren op je website te plaatsen.",
                "status_check_heading": "Statuscontrole",
                "logo_heading": "Logo's en iconen",
                "logo_text": "Upload op zijn minst één logo voor je progressieve webapplicatie om te kunnen installeren. Houd er rekening mee dat alle logo's vierkant moeten zijn. Wanneer dit niet het geval is zullen ze mogelijk misvormt worden weergegeven.\n\nHieronder zijn enkele verschillende groottes beschikbaar. Ik raad aan zo veel mogelijk logo's te uploaden als mogelijk is: dit vergroot de ondersteuning voor meer apparaten.\n\nHoud er rekening mee dat je 1 groot logo kunt uploaden voor kleinere logo's. Upload bijvoorbeeld een logo van 1000px x 1000px naar ALLE onderstaande uploadmogelijkheden. Als je echter een logo van 50x50px probeert te uploaden naar de 512x512px ingang, zal deze erg worden uitgerekt.\n",
                "logo_size_text": "Upload een logo ter grootte van {size} bij {size} pixels.",
                "submit_button": "Instellingen opslaan",
                "refreshed_message": "PWA Configuratie succesvol opnieuw ingeladen."
            },
            "status": {
                "config_no_https": "De url in je config.php bestand gebruikt geen HTTPS. HTTPS is vereist om progressieve webapplicaties te laten werken.",
                "possible_https_disabled": "Het kan zijn dat je site niet op HTTPS draait. Mogelijk helpt het wissen van je cache (admin dashboard pagina => tools knop). Als dat zo is kun je dit bericht negeren. Wanneer dat niet zo is, houd er dan rekening mee dat HTTPS is vereist is om progressieve webapplicaties te laten werken.",
                "no_logo": "Je moet minstens één logo uploaden van minimaal 144x144px om de progressieve webapplicatie te kunnen installeren.",
                "no_name": "Je moet een volledige naam invullen voordat je applicatie werkt.",
                "no_vapid_keys": "Geen VAPID-sleutel gevonden. Deze is verplicht om pushnotificaties te verzenden. Je kan je VAPID-sleutel hieronder resetten.",
                "key_gen_failed": "Het genereren van pushnotificatiessleutels is mislukt. De volledige foutmelding was: {error}",
                "suggest_gmp": "De gmp PHP-extensie lijkt niet te zijn ingeschakeld op je server. Het is niet noodzakelijk, maar het kan de prestaties verbeteren en wordt daarom aanbevolen. Sommige gedeelde webhostingpakketten ondersteunen dit mogelijk niet.",
                "success": "Geen potentiële problemen gevonden!"
            }
        },
        "forum": {
            "alerts": {
                "optin": "Je hebt pushnotificaties ingeschakeld maar deze zijn niet op dit apparaat geconfigureerd.",
                "optin_button": "Configureer"
            },
            "discussion_controls": {
                "share_button": "Deel"
            },
            "post_controls": {
                "share_button": "Deel",
                "share_api": {
                    "title": "{username}'s reactie op {title}"
                }
            },
            "user_controls": {
                "share_button": "Deel"
            },
            "settings": {
                "push_header": "Push",
                "pwa_notifications": {
                    "access_default": "Vanwege browserbeperkingen moet je je aanmelden om pushberichten op dit apparaat te ontvangen.",
                    "access_default_button": "Opt-in",
                    "access_denied": "Pas je browserinstellingen aan om pushberichten op dit apparaat te ontvangen.",
                    "access_denied_button": "Meer informatie",
                    "no_browser_support": "Deze webbrowser ondersteunt geen pushnotificaties voor progressieve webapplicaties.",
                    "no_browser_support_button": "Meer informatie"
                }
            }
        },
        "views": {
            "offline": {
                "header": "Netwerkfout",
                "text": "Deze applicatie heeft een internetverbinding nodig en kan niet worden gebruikt wanneer je offline bent. Controleer je internetverbinding."
            }
        }
    }
}
