{
    "acpl-lscache": {
        "admin": {
            "public_cache_ttl_label": "TTL общедоступного кеша по умолчанию",
            "public_cache_ttl_help": "Укажите, как долго в секундах кэшируются общедоступные страницы. Значение по умолчанию 300 секунд.",
            "clearing_cache_listener_label": "Очистить LSCache при очистке кэша Flarum cache",
            "serve_stale_label": "Обслуживать Устарелую",
            "serve_stale_help": "Если включено, устаревшая копия кэшированной страницы будет отображаться посетителям до тех пор, пока не станет доступна новая копия кеша. Снижает нагрузку на сервер при следующих посещениях. Если ВЫКЛЮЧЕНО, страница будет динамически генерироваться, пока посетители ждут. По задумке, этот вариант может обслуживать устаревший контент. Не включайте эту опцию, если вас это не устраивает.",
            "purge_on_discussion_update_label": "Удалять URL-адреса или теги при обновлении обсуждения или публикации",
            "purge_on_discussion_update_help": "Укажите по одному URL-адресу или тегу в каждой строке. URL-адрес должен начинаться с <code> / </code>, например <code>/rankings </code> и тег кеша должны начинаться с <code>tag=</code>, например <code>tag=rankings</code>. Это расширение помечает каждый маршрут, и, например, если у вас есть много маршрутов, которые вы хотите очистить, лучше добавить правило в .htaccess с регулярным выражением, которое будет отмечать маршруты, и здесь в настройках введите только этот тег . Этот способ будет намного быстрее. <a>Подробнее…</a> По умолчанию очищается кеш домашней страницы, а также кеш обновленных обсуждений.",
            "cache_exclude_label": "Не кэшировать пути",
            "cache_exclude_help": "Пути, содержащие эти строки, не будут кэшироваться. Например, можно использовать <code>/mypathh/mypage?aa=bb</code>, <code>mypage?aa=</code>. Для поиска совпадения начала, добавьте <code>^</code> в начале элемента. Для поиска точного совпадения добавьте <code>$</code> в конце URL.\nОдин в строку.",
            "purge_all": "Очистить все LSCache",
            "purge_all_success": "Уведомленный веб-сервер LiteSpeed для очистки всех записей LSCache"
        }
    }
}
