{
    "askvortsov-pwa": {
        "admin": {
            "nav": {
                "pwa_button": "Прогрессивное Веб Приложение",
                "pwa_text": "Настройте Flarum для работы в качестве прогрессивного веб-приложения, которое можно установить на мобильные устройства."
            },
            "pwa": {
                "about": {
                    "description_label": "Описание",
                    "description_text": "Вы можете установить описание на странице «Основные» в панели администратора.",
                    "long_name_label": "Длинное имя",
                    "long_name_text": "Имя веб-приложения, отображаемое пользователю.",
                    "heading": "Описание",
                    "short_name_label": "Короткое имя",
                    "short_name_text": "Имя приложения, отображаемое пользователю, если для длинного имени недостаточно места."
                },
                "colors": {
                    "heading": "Цвета",
                    "background_color_label": "Фоновый цвет",
                    "background_color_text": "Он используется в качестве заполнителя для экрана-заставки, который отображается во время загрузки PWA. Он не используется, когда приложение фактически загружено.",
                    "theme_color_label": "Цвет темы",
                    "theme_color_text": "Этот цвет иногда используется устройствами при отображении вашего приложения, например, в переключателе задач Android, в качестве цвета, окружающего сайт."
                },
                "maintenance": {
                    "heading": "Содержание",
                    "debug_label": "Режим отладки?",
                    "debug_text": "Это запишет информацию об уведомлениях в `storage/logs`. Обычно его следует отключать, чтобы избежать ненужного заполнения журналов.",
                    "reset_vapid_text": "Это приведет к повторному созданию ключей VAPID и удалению всех существующих подписок с использованием текущих ключей VAPID.",
                    "reset_vapid_confirm": "Сброс ключей VAPID приведет к удалению всех подписок, использующих существующие ключи, поэтому пользователи не будут получать никаких уведомлений до тех пор, пока в следующий раз не посетят ваш сайт. Это следует делать только при первой настройке push-уведомлений или если push-уведомления вообще не работают, а выше есть предупреждение об отсутствии ключей VAPID.",
                    "reset_vapid_success": "Ключи VAPID успешно сброшены. {count} подписок были сброшены. Перезагрузите страницу, чтобы увидеть обновленный отчет о проверке состояния."
                },
                "other": {
                    "heading": "Иное",
                    "force_portrait_text": "Принудительная портретная ориентация?"
                },
                "heading": "Конфигурация Прогрессивного веб-приложения",
                "text": "Настройте свой сайт Flarum для работы в качестве прогрессивного веб-приложения! Обратите внимание, что это не помещает ваш сайт в магазин приложений. Это означает, что у пользователей есть опция «Добавить на главный экран» для вашего сайта. Мы предоставляем некоторые проверки состояния, однако лучший способ проверить это — попробовать и установить его (поищите в Google инструкции по установке прогрессивных веб-приложений). Кроме того, имейте в виду, что всплывающие окна «установите это PWA» контролируются браузерами и не могут запускаться разработчиками/администраторами/программами. Я рекомендую включить инструкции по установке PWA в документацию вашего сайта.",
                "status_check_heading": "Проверка статуса",
                "logo_heading": "Логотипы и иконки",
                "logo_text": "Вы должны загрузить хотя бы один логотип, чтобы ваше прогрессивное веб-приложение можно было установить. Обратите внимание, что все логотипы должны быть квадратными; если это не так, они будут изменены в размере и, возможно, растянуты.\n\nНиже представлено несколько вариантов размеров. Я бы порекомендовал Вам загрузить логотип различных размеров: это поддерживает большее количество устройств.\n\nОбратите внимание, что Вы можете загрузить 1 большой логотип во входные данные для логотипов меньшего размера. Например, Вы можете загрузить логотип размером 1000 x 1000 пикселей во ВСЕ входные файлы ниже. Однако, если Вы попытаетесь загрузить логотип размером 50 x 50 пикселей на вход 512 x 512, он будет сильно растянут.\n",
                "logo_size_text": "Загрузите логотип, который будет масштабирован до {size} пикселей на {size} пикселей.",
                "submit_button": "Сохранить настройки",
                "refreshed_message": "Конфигурация PWA успешно обновлена."
            },
            "status": {
                "config_no_https": "URL-адрес в вашем файле config.php не использует HTTPS. HTTPS требуется для работы прогрессивных веб-приложений.",
                "possible_https_disabled": "Возможно, ваш сайт не работает на HTTPS. Очистка кеша (страница панели администратора = кнопка инструментов) может помочь. Если это сделано, игнорируйте это. Если это не так, имейте в виду, что для работы Progressive Web Apps требуется HTTPS.",
                "no_logo": "Чтобы ваше приложение работало, вы должны загрузить хотя бы один логотип размером не менее 196пикселей.",
                "no_name": "Вы должны указать полное имя, чтобы ваше приложение работало.",
                "no_vapid_keys": "Ключи VAPID не найдены. Они необходимы для отправки push-уведомлений. Вы можете сбросить ключи VAPID ниже.",
                "key_gen_failed": "Не удалось сгенерировать ключи, необходимые для push-уведомлений. Полное сообщение об ошибке: {error}",
                "suggest_gmp": "PHP-расширение gmp, похоже, не включено на вашем сервере. Это не обязательно, но может улучшить производительность и рекомендуется. Однако некоторые хосты могут не поддерживать его.",
                "success": "Потенциальных проблем не обнаружено!"
            }
        },
        "forum": {
            "alerts": {
                "optin": "У Вас включены push-уведомления, но Вы не настроили это устройство.",
                "optin_button": "Сконфигурировать"
            },
            "discussion_controls": {
                "share_button": "Поделиться"
            },
            "post_controls": {
                "share_button": "Поделиться",
                "share_api": {
                    "title": "Ответ {username} на {title}'"
                }
            },
            "user_controls": {
                "share_button": "Поделиться"
            },
            "settings": {
                "push_header": "Пуш",
                "pwa_notifications": {
                    "access_default": "Из-за ограничений браузера вы должны согласиться на получение push-уведомлений на этом устройстве.",
                    "access_default_button": "Выбрать в",
                    "access_denied": "Вы должны изменить настройки браузера, чтобы получать push-уведомления на этом устройстве.",
                    "access_denied_button": "Узнать, как",
                    "no_browser_support": "Этот браузер не поддерживает push-уведомления для прогрессивных веб-приложений.",
                    "no_browser_support_button": "Узнать больше"
                }
            }
        },
        "views": {
            "offline": {
                "header": "Ошибка подключения к сети",
                "text": "Это приложение требует подключения к сети; его нельзя использовать в автономном режиме. Пожалуйста, проверьте подключение."
            }
        }
    }
}
