{
    "fof-sitemap": {
        "admin": {
            "settings": {
                "exclude_users": "Исключить все профили пользователей из карты сайта",
                "exclude_users_help": "По умолчанию все пользователи, видимые гостям, будут проиндексированы",
                "mode_label": "Режим работы",
                "mode_help": "Выберите режим работы, подходящий под размер Вашего форума.",
                "mode_help_runtime_label": "При запросе",
                "mode_help_runtime": "Для небольших форумов, на общем хостинге. Общее количество дискуссий, пользователей и тегов в сумме не должно превышать 10 000 элементов. Карта сайта генерируется при каждом запросе.",
                "mode_help_schedule": "Следующие режимы добавляют собственные задачи в планировщик Flarum.",
                "mode_help_schedule_setup": "Без правильной настройки планировщика Flarum, эти режимы не будут работать. Дополнительную информацию можно посмотреть <a>здесь</a>.",
                "mode_help_large": "50 000 элементов являются техническим лимитом для файлов карты сайта. Если Вы хотите хранить больше элементов, используйте параметр ниже!",
                "mode_help_multi_label": "Несколько файлов",
                "mode_help_multi": "Для больших форумов, на которых общее количество дискуссий, пользователей и тегов в сумме превышает 10 000 элементов. Несколько частей карты сайта будут сжаты и сохранены в директории /public.",
                "advanced_options_label": "Дополнительные параметры",
                "frequency_label": "Как часто планировщик должен обновлять кэшированную карту сайта?",
                "risky_performance_improvements": "Разрешить рискованные улучшения производительности",
                "risky_performance_improvements_help": "Эти улучшения делают работу CRON-планировщика быстрее на базах данных в миллионы строк, но могут привести к нарушению совместимости с некоторыми расширениями.",
                "modes": {
                    "runtime": "При запросе",
                    "multi_file": "Несколько файлов",
                    "cache": "Кэш",
                    "cache_disk": "Диск"
                },
                "frequency": {
                    "hourly": "Раз в час",
                    "twice_daily": "Два раза в день",
                    "daily": "Ежедневно"
                },
                "mode_help_cache_disk_label": "Кэш/Диск",
                "mode_help_cache_disk": "Для малых и средних форумов, на хостинге, позволяющем настройку cronjobs и включение планировщика Flarum. Общее количество дискуссий, пользователей и тегов в сумме не должно превышать 50 000 элементов.",
                "title": "Карта сайта"
            }
        }
    }
}
