{
    "fof-sitemap": {
        "admin": {
            "settings": {
                "title": "FoF Карта сайта",
                "mode_label": "Режим работы",
                "mode_help": "Выбор правильного режима для вашего размера форума критически важен.",
                "mode_help_runtime_label": "Рабочий режим",
                "mode_help_runtime": "Для небольших форумов, чаще всего базирующихся на хостингах совместного использования, в которых число дискуссий, пользователей, тегов и страниц в сумме не превышает 10тыс. Карта сайта генерируется \"на лету\" при каждом запросе.",
                "mode_help_schedule": "Следующие режимы добавляют свои задачи в планировщик Фларума.",
                "mode_help_schedule_setup": "Если планировщик задач Фларума не был корректно настроен, следующие режимы не смогут работать. Ознакомьтесь с <a>детальной информацией</a>.",
                "mode_help_cache_disk_label": "Режим кэша/Дисковый режим",
                "mode_help_cache_disk": "Наилучший выбор для форумов от малых до средних, чаще всего размещенных на хостингах с планировщиками задач, позволяющих использование планировщика Фларума (подробнее см.далее) - с числом дискуссий, пользователей, тегов и страниц, в сумме не превышающем 50 тыс.",
                "mode_help_large": "50 тыс. элементов - технический предел для файлов карты сайта. Если вам требуется больше, используйте следующую опцию!",
                "mode_help_multi_label": "Мультифайловый режим",
                "mode_help_multi": "Оптимально для больших форумов, включающих от 50 тыс. элементов.  Карта сайта создается как набор из нескольких сжатых файлов, размещенных в папке /public",
                "advanced_options_label": "Расширенные опции",
                "frequency_label": "Как часто планировщик должен обновлять карту сайта на базе кэша или на диске?",
                "modes": {
                    "runtime": "\"На лету\"",
                    "cache": "Кэш",
                    "cache_disk": "Диск",
                    "multi_file": "Мультифайловый"
                },
                "frequency": {
                    "hourly": "Ежечасно",
                    "twice_daily": "Дважды в день",
                    "daily": "Ежедневно"
                }
            }
        }
    }
}
