{
    "fof-anti-spam": {
        "admin": {
            "permissions": {
                "spamblock_users_label": "Отмечать пользователя как спамера"
            },
            "settings": {
                "button": "Настройки",
                "default-actions": {
                    "delete_user_label": "Удаление пользователя",
                    "delete_user_help": "Безвозвратное удаление пользователя. Если этот параметр отключён, пользователь будет заблокирован.",
                    "delete_discussions_label": "Удаление дискуссий",
                    "delete_discussions_help": "Безвозвратное удаление всех дискуссий, автором которых является этот пользователь. Если этот параметр отключён, дискуссии будут удалены с возможностью восстановления.",
                    "delete_posts_label": "Удаление сообщений",
                    "delete_posts_help": "Безвозвратное удаление всех сообщений, автором которых является этот пользователь. Если этот параметр отключён, сообщения будут удалены с возможностью восстановления.",
                    "heading": "Действия модерации по умолчанию",
                    "introduction": "Когда пользователь помечается в качестве спамера, модераторам доступны различные действия в зависимости от конкретной ситуации. Эти настройки позволяют Вам заранее задать действия, которые Вы чаще всего выполняете. Это ускоряет процесс реагирования на события, но также допускает изменения вариантов по мере необходимости.\n",
                    "move_discussions_to_tags_label": "Переместить дискуссии в тег(и)",
                    "move_discussions_to_tags_help": "Все обсуждения, автором которых является этот пользователь, будут перемещены в указанные Вами теги. Снимите флажок с тега, чтобы оставить дискуссию в исходных тегах. Параметр не работает, если включена опция \"Удаление дискуссий\"."
                },
                "stopforumspam": {
                    "heading": "StopForumSpam",
                    "introduction": "Проверка новых пользователей в базе данных <a>StopForumSpam</a> при регистрации. При достижении пороговых значений <code>confidence</code> или <code>frequency</code>, регистрация пользователя будет прервана.\n\nПрисутствует поддержка регистрации SSO через <code>fof/oauth</code> и <code>fof/passport</code>. Другие провайдеры SSO должны работать, но не протестированы.\n",
                    "username_label": "Проверка имени пользователя",
                    "ip_label": "Проверка IP",
                    "email_label": "Проверка email",
                    "frequency_label": "Частота",
                    "frequency_help": "Общее число всех совпадений спам-фильтра, при котором включится система безопасности и предотвратит регистрацию пользователя.\nНапример, если e-mail имеет 1 совпадение, IP имеет 2 совпадения, то общее число совпадений спам-фильтра будет 3. Если пороговое значение установлено на 3 или меньше, регистрация пользователя будет предотвращена.\n",
                    "api_key_label": "Ключ API",
                    "api_key_text": "У Вас имеется возможность сообщать информацию о спамерах в StopForumSpam, чтобы защитить своё и остальные сообщества от спама.",
                    "api_key_instructions_text": "<register>Зарегистрируйтесь в StopForumSpam</register>. Вам необходимо <key>получить ключ API</key>.",
                    "regional_endpoint_label": "Расположение сервера",
                    "regional_endpoint_help": "По умолчанию, поиск ведётся на ближайшем региональном сервере для обеспечения наиболее быстрого ответа. Если Вы хотите ограничить трафик определённым регионом, например, для соблюдения правил конфиденциальности компании или страны, Вы можете принудительно указать соединение с этим регионом.",
                    "region_closest_label": "Ближайший",
                    "region_europe_label": "Европа",
                    "region_us_label": "Соединенные Штаты",
                    "confidence_label": "Доверие",
                    "confidence_help": "Установите уровень доверия в процентах. Если доверие равно или больше этого значения, регистрация пользователя будет предотвращена независимо от проверки по параметру \"Частота\".",
                    "email_hash_label": "Использовать хешированные адреса email",
                    "email_hash_help": "Если Вы не хотите передавать открытые адреса email, Вы можете передавать их MD5-хэш. Этот метод обходит все чёрные списки, проверки по нормализации и обфускации.",
                    "sfs_lookup_label": "Поиск регистраций",
                    "sfs_lookup_help": "Если параметр включён, мы будем проверять базу данных StopForumSpam при регистрации нового пользователя на Вашем форуме. При нахождении пользователя (имя пользователя, IP, email) в базе данных StopForumSpam и при сопоставлении других настроек фильтрации, ему будет отказано в регистрации.",
                    "report_blocked_registrations_label": "Сообщать о заблокированных регистрациях",
                    "report_blocked_registrations_help": "При блокировании регистрации пользователя функцией \"Поиск регистраций\", мы отправим отчёт в StopForumSpam для подтверждения активности спамеров. Для работы этого параметра требуется указать ключ API StopForumSpam."
                }
            },
            "blocked_registrations": {
                "button": "Заблокированные регистрации",
                "title": "Заблокированные регистрации",
                "no-records": "Заблокированных регистраций не найдено.",
                "help": "На этой странице показаны все регистрации, заблокированные сервисом StopForumSpam. Вы можете проанализировать каждую регистрацию и, при желании, удалить запись из базы данных.\n",
                "attempted-at": "Дата",
                "ip": "IP",
                "email": "Email",
                "username": "Имя пользователя",
                "login-provider": "Провайдер",
                "login-provider-data": "Данные провайдера",
                "sfs-data": "Данные StopForumSpam",
                "delete_entry": "Удалить запись"
            }
        },
        "forum": {
            "message": {
                "stopforumspam": {
                    "blocked": "Данные Вашей регистрации были найдены в базе данных по предотвращению спама. Ваша регистрация заблокирована."
                }
            },
            "spammer_modal": {
                "hard_delete_discussions_label": "Удаление дискуссий",
                "hard_delete_discussions_help": "Безвозвратное удаление всех дискуссий, автором которых является этот пользователь. Если этот параметр отключён, дискуссии будут удалены с возможностью восстановления.",
                "hard_delete_posts_label": "Удаление сообщений",
                "hard_delete_posts_help": "Безвозвратное удаление всех сообщений (комментариев, ответов и т.п.), автором которых является этот пользователь. Если этот параметр отключён, сообщения будут удалены с возможностью восстановления.",
                "hard_delete_user_label": "Удаление пользователя",
                "hard_delete_user_help": "Безвозвратное удаление пользователя. Если этот параметр отключён, пользователь будет заблокирован.",
                "intro": "При отметке пользователя как спамера будет предпринято несколько действий, которые зависят от установленных на Вашем форуме расширений.",
                "move_discussions_tag_label": "Переместить дискуссии в тег карантина",
                "move_discussions_tag_help": "Все дискуссии, автором которых является этот пользователь, будут перенесены в специальный тег, заданный Вами в настройках форума. Если этот параметр отключён, дискуссии останутся с текущими тегами.",
                "process_button": "Запустить анализ",
                "title": "Отметить {username} как спамера",
                "report_to_sfs_label": "Сообщить в StopForumSpam",
                "report_to_sfs_help": "Основные данные пользователя (имя пользователя, email, IP) будут переданы в StopForumSpam. Это поможет предотвратить регистрацию пользователя на других форумах, использующих сервис StopForumSpam."
            },
            "user_controls": {
                "spammer_button": "Спамер"
            }
        }
    }
}
