{
    "fof-stopforumspam": {
        "admin": {
            "settings": {
                "introduction": "Проверка новых пользователей в базе данных <a>StopForumSpam</a> при регистрации. При достижении пороговых значений <code>confidence</code> или <code>frequency</code>, регистрация пользователя будет прервана.\n\nПрисутствует поддержка регистрации SSO через <code>fof/oauth</code> и <code>fof/passport</code>. Другие провайдеры SSO должны работать, но не протестированы.\n",
                "username_label": "Проверка имени пользователя",
                "ip_label": "Проверка IP",
                "email_label": "Проверка e-mail",
                "frequency_label": "Частота",
                "frequency_help": "Общее число всех совпадений спам-фильтра, при котором включится система безопасности и предотвратит регистрацию пользователя.\nНапример, если e-mail имеет 1 совпадение, IP имеет 2 совпадения, то общее число совпадений спам-фильтра будет 3. Если пороговое значение установлено на 3 или меньше, регистрация пользователя будет предотвращена.\n",
                "api_key_label": "Ключ API",
                "api_key_text": "У Вас включено расширение fof/spamblock. У Вас имеется возможность сообщать информацию о спамерах в StopForumSpam, чтобы защитить своё и остальные сообщества от спама.",
                "api_key_instructions_text": "<register>Зарегистрируйтесь в StopForumSpam</register>. Вам необходимо <key>получить ключ API</key>.",
                "regional_endpoint_label": "Расположение сервера",
                "regional_endpoint_help": "По умолчанию, поиск ведётся на ближайшем региональном сервере для обеспечения наиболее быстрого ответа. Если Вы хотите ограничить трафик определённым регионом, например, для соблюдения правил конфиденциальности компании или страны, Вы можете принудительно указать соединение с этим регионом.",
                "region_closest_label": "Ближайший",
                "region_europe_label": "Европа",
                "region_us_label": "Соединенные Штаты",
                "confidence_label": "Доверие",
                "confidence_help": "Установите уровень доверия в процентах. Если доверие равно или больше этого значения, регистрация пользователя будет предотвращена независимо от проверки по параметру \"Частота\".",
                "email_hash_label": "Использовать хешированные адреса e-mail",
                "email_hash_help": "Если Вы не хотите передавать открытые адреса e-mail, Вы можете передавать их MD5-хэш. Этот метод обходит все чёрные списки, проверки по нормализации и обфускации."
            }
        },
        "forum": {
            "message": {
                "spam": "Ваша информация отмечена как спам."
            }
        },
        "api": {
            "error": {
                "unknown": "Не удалось сообщить информацию о пользователе в StopForumSpam."
            }
        }
    }
}
