{
    "acpl-lscache": {
        "admin": {
            "public_cache_ttl_label": "TTL de la caché pública predefinida",
            "public_cache_ttl_help": "Especifica cuánto tiempo, en segundos, se almacenan en caché las páginas públicas. El valor por defecto es de 300 segundos.",
            "clearing_cache_listener_label": "",
            "serve_stale_label": "Serve Stale",
            "serve_stale_help": "Si está activado, la copia antigua de una página en caché se mostrará a los visitantes hasta que haya una nueva copia en caché disponible. Reduce la carga del servidor para las siguientes visitas. Si está desactivado, la página se generará dinámicamente mientras los visitantes esperan. Por su diseño, esta opción puede servir contenido obsoleto. No habilite esta opción, si no le parece bien.",
            "purge_on_discussion_update_label": "Purga de URLs o etiquetas cuando se actualiza una discusión o post",
            "purge_on_discussion_update_help": "Especifique una URL o una etiqueta por línea. La Url debe comenzar con <code>/</code>, por ejemplo <code>/rankings</code> y la Etiqueta de la caché debe comenzar con <code>tag=</code>, por ejemplo <code>tag=rankings</code>. Esta extensión etiqueta todas las rutas y, por ejemplo, si tienes muchas rutas que quieres purgar, es mejor añadir una regla en .htaccess con una expresión regular que etiquete las rutas y aquí en la configuración introducir sólo esta etiqueta. Este método será mucho más rápido. <a>Aprenda más</a>. Por defecto, la caché de la página de inicio se purga, así como la caché de las discusiones actualizadas.",
            "cache_exclude_label": "No almacenar en caché las direcciones",
            "cache_exclude_help": "Las direcciones que contengan estas cadenas no se almacenarán en la caché. Por ejemplo, para <code>/midireccion/mipagina?aa=bb</code>, se puede utilizar aquí <code>midireccion?aa=</code>. Para que coincida con el principio, añada <code>^</code> al principio del elemento. Para hacer una coincidencia exacta, añada <code>$</code> al final de la URL. Uno por línea.",
            "purge_all": "Purgar todo el LSCache",
            "purge_all_success": "Notificación al LiteSpeed Web Server para que purgue todas las entradas de LSCache"
        }
    }
}
