{
    "flarum-ext-contactme": {
        "settings": {
            "emaillabel": "Correo electrónico al que se enviará el formulario de contacto"
        },
        "admin": {
            "settings": {
                "emaillabel": "Correo electrónico al que se enviará el formulario de contacto"
            }
        },
        "forum": {
            "title": "Contáctanos",
            "messagesent": "¡Mensaje enviado!",
            "plsregister": "Regístrate o inicia sesión para continuar",
            "tocontinue": "Para continuar con este formulario de contacto",
            "backsoon": "Te contactaremos en breve",
            "notloggedin": "Tienes que iniciar sesión para usar el formulario de contacto",
            "placeholderName": "Escribe tu nombre aquí",
            "emailfield": "Escribe tu dirección de correo electrónico",
            "pageTitle": ".Contáctanos",
            "subject": "Mensaje desde el formulario de contacto",
            "sendForm": "Enviar correo",
            "textAreaField": "Escribe tu mensaje aquí",
            "pText": "<p>Rellenando este formulario de contacto puedes enviarnos comunicaciones comerciales, propuestas de colaboración o cualquier tipo de consulta, que responderemos en un máximo de 7 días.</p>\n      <p><strong>Tratamiento de datos personales</strong></p>\n      <p>(Privacy policy art. 13 del d.lgs. 196/2003)</p>\n      <p>Te informamos que los datos que nos facilites al rellenar el \"formulario de contacto\" de este sitio serán tratados conforme a lo establecido en el Decreto Legislativo 196/2003, Código en materia de protección de datos personales.\n         El formulario de contacto disponible en el sitio tiene como único propósito permitir que los visitantes puedan contactar, si así lo desean, con el responsable del sitio, enviándole un correo electrónico a través de dicho formulario.\n         Esta información se refiere a los datos personales que el usuario visitante envía al rellenar el formulario de contacto.</p>\n      <p>Por favor, sigue estas reglas:</p>\n      <li>No abuses del formulario de contacto para solicitudes que puedas hacer en el foro.</li>\n      <li>No envíes el mismo correo varias veces.</li>\n"
        },
        "email": {
            "contact": {
                "subject": "Nuevo contacto vía formulario",
                "body": "Hola!\n\nHas recibido un nuevo mensaje desde el formulario de contacto de {username} (email: {email})\n\nSu mensaje es:\n\n{message}"
            }
        }
    }
}
